TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:31 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0496010                           PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v6.2.7 *
       3              ;* Date/Time created: Thu Jul 02 08:31:31 2015                 *
       4              ;***************************************************************
       5                      .compiler_opts --diag_wrap=off --float_support=fpu32 --hll_source=on --mem_model:code=flat --mem_mode
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("../ConvertorCntrl/ReleCntrl.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v6.2.7 Copyright (c) 1996-2014 Texas I
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("D:\ActiveProject\EKT5\PKMT_NONBIOS\InvertorCntrl\ISPprg")
      13              $C$DW$1 .dwtag  DW_TAG_variable, DW_AT_name("GpioDataRegs")
      14                      .dwattr $C$DW$1, DW_AT_TI_symbol_name("_GpioDataRegs")
      15                      .dwattr $C$DW$1, DW_AT_type(*$C$DW$T$59)

     605              ;*                            0 Parameter,  0 Auto,  0 SOE     *
     606              ;***************************************************************
     607              
     608 00000080       _onDistOK2:
     609                      .dwcfi  cfa_offset, -2
     610                      .dwcfi  save_reg_to_mem, 26, 0
     611                      .dwcfi  save_reg_to_reg, 78, 26
     612                      .dwpsn  file "../ConvertorCntrl/ReleCntrl.c",line 95,column 2,is_stmt
     613 00000080 761F!         MOVW      DP,#_GpioDataRegs+18  ; [CPU_U] 
         00000081 0000 
     614 00000082 1A12!         OR        @_GpioDataRegs+18,#0x0040 ; [CPU_] |95| 
         00000083 0040 
     615                      .dwpsn  file "../ConvertorCntrl/ReleCntrl.c",line 96,column 1,is_stmt
     616              $C$DW$26        .dwtag  DW_TAG_TI_branch
     617                      .dwattr $C$DW$26, DW_AT_low_pc(0x00)
     618                      .dwattr $C$DW$26, DW_AT_TI_return
     619 00000084 0006          LRETR     ; [CPU_] 
     620                      ; return occurs ; [] 
     621                      .dwattr $C$DW$25, DW_AT_TI_end_file("../ConvertorCntrl/ReleCntrl.c")
     622                      .dwattr $C$DW$25, DW_AT_TI_end_line(0x60)
     623                      .dwattr $C$DW$25, DW_AT_TI_end_column(0x01)
     624                      .dwendentry
     625                      .dwendtag $C$DW$25
     626              
     627 00000085               .sect   ".text"
     628                      .clink
     629                      .global _offDistOK2
     630              
     631              $C$DW$27        .dwtag  DW_TAG_subprogram, DW_AT_name("offDistOK2")
     632                      .dwattr $C$DW$27, DW_AT_low_pc(_offDistOK2)
     633                      .dwattr $C$DW$27, DW_AT_high_pc(0x00)
     634                      .dwattr $C$DW$27, DW_AT_TI_symbol_name("_offDistOK2")
     635                      .dwattr $C$DW$27, DW_AT_external
     636                      .dwattr $C$DW$27, DW_AT_TI_begin_file("../ConvertorCntrl/ReleCntrl.c")
     637                      .dwattr $C$DW$27, DW_AT_TI_begin_line(0x62)
     638                      .dwattr $C$DW$27, DW_AT_TI_begin_column(0x06)
     639                      .dwattr $C$DW$27, DW_AT_TI_max_frame_size(-2)
     640                      .dwpsn  file "../ConvertorCntrl/ReleCntrl.c",line 98,column 22,is_stmt,address _offDistOK2
     641              
     642                      .dwfde $C$DW$CIE, _offDistOK2
     643              
     644              ;***************************************************************
     645              ;* FNAME: _offDistOK2                   FR SIZE:   0           *
     646              ;*                                                             *
     647              ;* FUNCTION ENVIRONMENT                                        *
     648              ;*                                                             *
     649              ;* FUNCTION PROPERTIES                                         *
     650              ;*                            0 Parameter,  0 Auto,  0 SOE     *
     651              ;***************************************************************
     652              
     653 00000085       _offDistOK2:
     654                      .dwcfi  cfa_offset, -2
     655                      .dwcfi  save_reg_to_mem, 26, 0
     656                      .dwcfi  save_reg_to_reg, 78, 26
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:31 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0496010                           PAGE   14

     657                      .dwpsn  file "../ConvertorCntrl/ReleCntrl.c",line 99,column 2,is_stmt
     658 00000085 761F!         MOVW      DP,#_GpioDataRegs+20  ; [CPU_U] 
         00000086 0000 
     659 00000087 1A14!         OR        @_GpioDataRegs+20,#0x0040 ; [CPU_] |99| 
         00000088 0040 
     660                      .dwpsn  file "../ConvertorCntrl/ReleCntrl.c",line 100,column 1,is_stmt
     661              $C$DW$28        .dwtag  DW_TAG_TI_branch
     662                      .dwattr $C$DW$28, DW_AT_low_pc(0x00)
     663                      .dwattr $C$DW$28, DW_AT_TI_return
     664 00000089 0006          LRETR     ; [CPU_] 
     665                      ; return occurs ; [] 
     666                      .dwattr $C$DW$27, DW_AT_TI_end_file("../ConvertorCntrl/ReleCntrl.c")
     667                      .dwattr $C$DW$27, DW_AT_TI_end_line(0x64)
     668                      .dwattr $C$DW$27, DW_AT_TI_end_column(0x01)
     669                      .dwendentry
     670                      .dwendtag $C$DW$27
     671              
     672              ;**************************************************************
     673              ;* UNDEFINED EXTERNAL REFERENCES                              *
     674              ;**************************************************************
     675                      .global _GpioDataRegs
     676                      .global _GpioCtrlRegs
     677              
     678              ;***************************************************************
     679              ;* TYPE INFORMATION                                            *
     680              ;***************************************************************
     681              
     682              $C$DW$T$20      .dwtag  DW_TAG_structure_type
     683                      .dwattr $C$DW$T$20, DW_AT_name("GPA1_BITS")
     684                      .dwattr $C$DW$T$20, DW_AT_byte_size(0x02)
     685              $C$DW$29        .dwtag  DW_TAG_member
     686                      .dwattr $C$DW$29, DW_AT_type(*$C$DW$T$19)
     687                      .dwattr $C$DW$29, DW_AT_name("GPIO0")
     688                      .dwattr $C$DW$29, DW_AT_TI_symbol_name("_GPIO0")
     689                      .dwattr $C$DW$29, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x02)
     690                      .dwattr $C$DW$29, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     691                      .dwattr $C$DW$29, DW_AT_accessibility(DW_ACCESS_public)
     692              $C$DW$30        .dwtag  DW_TAG_member
     693                      .dwattr $C$DW$30, DW_AT_type(*$C$DW$T$19)
     694                      .dwattr $C$DW$30, DW_AT_name("GPIO1")
     695                      .dwattr $C$DW$30, DW_AT_TI_symbol_name("_GPIO1")
     696                      .dwattr $C$DW$30, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x02)
     697                      .dwattr $C$DW$30, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     698                      .dwattr $C$DW$30, DW_AT_accessibility(DW_ACCESS_public)
     699              $C$DW$31        .dwtag  DW_TAG_member
     700                      .dwattr $C$DW$31, DW_AT_type(*$C$DW$T$19)
     701                      .dwattr $C$DW$31, DW_AT_name("GPIO2")
     702                      .dwattr $C$DW$31, DW_AT_TI_symbol_name("_GPIO2")
     703                      .dwattr $C$DW$31, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x02)
     704                      .dwattr $C$DW$31, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     705                      .dwattr $C$DW$31, DW_AT_accessibility(DW_ACCESS_public)
     706              $C$DW$32        .dwtag  DW_TAG_member
     707                      .dwattr $C$DW$32, DW_AT_type(*$C$DW$T$19)
     708                      .dwattr $C$DW$32, DW_AT_name("GPIO3")
     709                      .dwattr $C$DW$32, DW_AT_TI_symbol_name("_GPIO3")
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:31 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0496010                           PAGE   15

     710                      .dwattr $C$DW$32, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x02)
     711                      .dwattr $C$DW$32, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     712                      .dwattr $C$DW$32, DW_AT_accessibility(DW_ACCESS_public)
     713              $C$DW$33        .dwtag  DW_TAG_member
     714                      .dwattr $C$DW$33, DW_AT_type(*$C$DW$T$19)
     715                      .dwattr $C$DW$33, DW_AT_name("GPIO4")
     716                      .dwattr $C$DW$33, DW_AT_TI_symbol_name("_GPIO4")
     717                      .dwattr $C$DW$33, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x02)
     718                      .dwattr $C$DW$33, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     719                      .dwattr $C$DW$33, DW_AT_accessibility(DW_ACCESS_public)
     720              $C$DW$34        .dwtag  DW_TAG_member
     721                      .dwattr $C$DW$34, DW_AT_type(*$C$DW$T$19)
     722                      .dwattr $C$DW$34, DW_AT_name("GPIO5")
     723                      .dwattr $C$DW$34, DW_AT_TI_symbol_name("_GPIO5")
     724                      .dwattr $C$DW$34, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x02)
     725                      .dwattr $C$DW$34, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     726                      .dwattr $C$DW$34, DW_AT_accessibility(DW_ACCESS_public)
     727              $C$DW$35        .dwtag  DW_TAG_member
     728                      .dwattr $C$DW$35, DW_AT_type(*$C$DW$T$19)
     729                      .dwattr $C$DW$35, DW_AT_name("GPIO6")
     730                      .dwattr $C$DW$35, DW_AT_TI_symbol_name("_GPIO6")
     731                      .dwattr $C$DW$35, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x02)
     732                      .dwattr $C$DW$35, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     733                      .dwattr $C$DW$35, DW_AT_accessibility(DW_ACCESS_public)
     734              $C$DW$36        .dwtag  DW_TAG_member
     735                      .dwattr $C$DW$36, DW_AT_type(*$C$DW$T$19)
     736                      .dwattr $C$DW$36, DW_AT_name("GPIO7")
     737                      .dwattr $C$DW$36, DW_AT_TI_symbol_name("_GPIO7")
     738                      .dwattr $C$DW$36, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x02)
     739                      .dwattr $C$DW$36, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     740                      .dwattr $C$DW$36, DW_AT_accessibility(DW_ACCESS_public)
     741              $C$DW$37        .dwtag  DW_TAG_member
     742                      .dwattr $C$DW$37, DW_AT_type(*$C$DW$T$19)
     743                      .dwattr $C$DW$37, DW_AT_name("GPIO8")
     744                      .dwattr $C$DW$37, DW_AT_TI_symbol_name("_GPIO8")
     745                      .dwattr $C$DW$37, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x02)
     746                      .dwattr $C$DW$37, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     747                      .dwattr $C$DW$37, DW_AT_accessibility(DW_ACCESS_public)
     748              $C$DW$38        .dwtag  DW_TAG_member
     749                      .dwattr $C$DW$38, DW_AT_type(*$C$DW$T$19)
     750                      .dwattr $C$DW$38, DW_AT_name("GPIO9")
     751                      .dwattr $C$DW$38, DW_AT_TI_symbol_name("_GPIO9")
     752                      .dwattr $C$DW$38, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x02)
     753                      .dwattr $C$DW$38, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     754                      .dwattr $C$DW$38, DW_AT_accessibility(DW_ACCESS_public)
     755              $C$DW$39        .dwtag  DW_TAG_member
     756                      .dwattr $C$DW$39, DW_AT_type(*$C$DW$T$19)
     757                      .dwattr $C$DW$39, DW_AT_name("GPIO10")
     758                      .dwattr $C$DW$39, DW_AT_TI_symbol_name("_GPIO10")
     759                      .dwattr $C$DW$39, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x02)
     760                      .dwattr $C$DW$39, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     761                      .dwattr $C$DW$39, DW_AT_accessibility(DW_ACCESS_public)
     762              $C$DW$40        .dwtag  DW_TAG_member
     763                      .dwattr $C$DW$40, DW_AT_type(*$C$DW$T$19)
     764                      .dwattr $C$DW$40, DW_AT_name("GPIO11")
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:31 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0496010                           PAGE   16

     765                      .dwattr $C$DW$40, DW_AT_TI_symbol_name("_GPIO11")
     766                      .dwattr $C$DW$40, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x02)
     767                      .dwattr $C$DW$40, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     768                      .dwattr $C$DW$40, DW_AT_accessibility(DW_ACCESS_public)
     769              $C$DW$41        .dwtag  DW_TAG_member
     770                      .dwattr $C$DW$41, DW_AT_type(*$C$DW$T$19)
     771                      .dwattr $C$DW$41, DW_AT_name("GPIO12")
     772                      .dwattr $C$DW$41, DW_AT_TI_symbol_name("_GPIO12")
     773                      .dwattr $C$DW$41, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x02)
     774                      .dwattr $C$DW$41, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     775                      .dwattr $C$DW$41, DW_AT_accessibility(DW_ACCESS_public)
     776              $C$DW$42        .dwtag  DW_TAG_member
     777                      .dwattr $C$DW$42, DW_AT_type(*$C$DW$T$19)
     778                      .dwattr $C$DW$42, DW_AT_name("GPIO13")
     779                      .dwattr $C$DW$42, DW_AT_TI_symbol_name("_GPIO13")
     780                      .dwattr $C$DW$42, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x02)
     781                      .dwattr $C$DW$42, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     782                      .dwattr $C$DW$42, DW_AT_accessibility(DW_ACCESS_public)
     783              $C$DW$43        .dwtag  DW_TAG_member
     784                      .dwattr $C$DW$43, DW_AT_type(*$C$DW$T$19)
     785                      .dwattr $C$DW$43, DW_AT_name("GPIO14")
     786                      .dwattr $C$DW$43, DW_AT_TI_symbol_name("_GPIO14")
     787                      .dwattr $C$DW$43, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x02)
     788                      .dwattr $C$DW$43, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     789                      .dwattr $C$DW$43, DW_AT_accessibility(DW_ACCESS_public)
     790              $C$DW$44        .dwtag  DW_TAG_member
     791                      .dwattr $C$DW$44, DW_AT_type(*$C$DW$T$19)
     792                      .dwattr $C$DW$44, DW_AT_name("GPIO15")
     793                      .dwattr $C$DW$44, DW_AT_TI_symbol_name("_GPIO15")
     794                      .dwattr $C$DW$44, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x02)
     795                      .dwattr $C$DW$44, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     796                      .dwattr $C$DW$44, DW_AT_accessibility(DW_ACCESS_public)
     797                      .dwendtag $C$DW$T$20
     798              
     799              
     800              $C$DW$T$22      .dwtag  DW_TAG_union_type
     801                      .dwattr $C$DW$T$22, DW_AT_name("GPA1_REG")
     802                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x02)
     803              $C$DW$45        .dwtag  DW_TAG_member
     804                      .dwattr $C$DW$45, DW_AT_type(*$C$DW$T$21)
     805                      .dwattr $C$DW$45, DW_AT_name("all")
     806                      .dwattr $C$DW$45, DW_AT_TI_symbol_name("_all")
     807                      .dwattr $C$DW$45, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     808                      .dwattr $C$DW$45, DW_AT_accessibility(DW_ACCESS_public)
     809              $C$DW$46        .dwtag  DW_TAG_member
     810                      .dwattr $C$DW$46, DW_AT_type(*$C$DW$T$20)
     811                      .dwattr $C$DW$46, DW_AT_name("bit")
     812                      .dwattr $C$DW$46, DW_AT_TI_symbol_name("_bit")
     813                      .dwattr $C$DW$46, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     814                      .dwattr $C$DW$46, DW_AT_accessibility(DW_ACCESS_public)
     815                      .dwendtag $C$DW$T$22
     816              
     817              
     818              $C$DW$T$23      .dwtag  DW_TAG_structure_type
     819                      .dwattr $C$DW$T$23, DW_AT_name("GPA2_BITS")
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:31 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0496010                           PAGE   17

     820                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x02)
     821              $C$DW$47        .dwtag  DW_TAG_member
     822                      .dwattr $C$DW$47, DW_AT_type(*$C$DW$T$19)
     823                      .dwattr $C$DW$47, DW_AT_name("GPIO16")
     824                      .dwattr $C$DW$47, DW_AT_TI_symbol_name("_GPIO16")
     825                      .dwattr $C$DW$47, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x02)
     826                      .dwattr $C$DW$47, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     827                      .dwattr $C$DW$47, DW_AT_accessibility(DW_ACCESS_public)
     828              $C$DW$48        .dwtag  DW_TAG_member
     829                      .dwattr $C$DW$48, DW_AT_type(*$C$DW$T$19)
     830                      .dwattr $C$DW$48, DW_AT_name("GPIO17")
     831                      .dwattr $C$DW$48, DW_AT_TI_symbol_name("_GPIO17")
     832                      .dwattr $C$DW$48, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x02)
     833                      .dwattr $C$DW$48, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     834                      .dwattr $C$DW$48, DW_AT_accessibility(DW_ACCESS_public)
     835              $C$DW$49        .dwtag  DW_TAG_member
     836                      .dwattr $C$DW$49, DW_AT_type(*$C$DW$T$19)
     837                      .dwattr $C$DW$49, DW_AT_name("GPIO18")
     838                      .dwattr $C$DW$49, DW_AT_TI_symbol_name("_GPIO18")
     839                      .dwattr $C$DW$49, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x02)
     840                      .dwattr $C$DW$49, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     841                      .dwattr $C$DW$49, DW_AT_accessibility(DW_ACCESS_public)
     842              $C$DW$50        .dwtag  DW_TAG_member
     843                      .dwattr $C$DW$50, DW_AT_type(*$C$DW$T$19)
     844                      .dwattr $C$DW$50, DW_AT_name("GPIO19")
     845                      .dwattr $C$DW$50, DW_AT_TI_symbol_name("_GPIO19")
     846                      .dwattr $C$DW$50, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x02)
     847                      .dwattr $C$DW$50, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     848                      .dwattr $C$DW$50, DW_AT_accessibility(DW_ACCESS_public)
     849              $C$DW$51        .dwtag  DW_TAG_member
     850                      .dwattr $C$DW$51, DW_AT_type(*$C$DW$T$19)
     851                      .dwattr $C$DW$51, DW_AT_name("GPIO20")
     852                      .dwattr $C$DW$51, DW_AT_TI_symbol_name("_GPIO20")
     853                      .dwattr $C$DW$51, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x02)
     854                      .dwattr $C$DW$51, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     855                      .dwattr $C$DW$51, DW_AT_accessibility(DW_ACCESS_public)
     856              $C$DW$52        .dwtag  DW_TAG_member
     857                      .dwattr $C$DW$52, DW_AT_type(*$C$DW$T$19)
     858                      .dwattr $C$DW$52, DW_AT_name("GPIO21")
     859                      .dwattr $C$DW$52, DW_AT_TI_symbol_name("_GPIO21")
     860                      .dwattr $C$DW$52, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x02)
     861                      .dwattr $C$DW$52, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     862                      .dwattr $C$DW$52, DW_AT_accessibility(DW_ACCESS_public)
     863              $C$DW$53        .dwtag  DW_TAG_member
     864                      .dwattr $C$DW$53, DW_AT_type(*$C$DW$T$19)
     865                      .dwattr $C$DW$53, DW_AT_name("GPIO22")
     866                      .dwattr $C$DW$53, DW_AT_TI_symbol_name("_GPIO22")
     867                      .dwattr $C$DW$53, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x02)
     868                      .dwattr $C$DW$53, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     869                      .dwattr $C$DW$53, DW_AT_accessibility(DW_ACCESS_public)
     870              $C$DW$54        .dwtag  DW_TAG_member
     871                      .dwattr $C$DW$54, DW_AT_type(*$C$DW$T$19)
     872                      .dwattr $C$DW$54, DW_AT_name("GPIO23")
     873                      .dwattr $C$DW$54, DW_AT_TI_symbol_name("_GPIO23")
     874                      .dwattr $C$DW$54, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x02)
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:31 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0496010                           PAGE   18

     875                      .dwattr $C$DW$54, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     876                      .dwattr $C$DW$54, DW_AT_accessibility(DW_ACCESS_public)
     877              $C$DW$55        .dwtag  DW_TAG_member
     878                      .dwattr $C$DW$55, DW_AT_type(*$C$DW$T$19)
     879                      .dwattr $C$DW$55, DW_AT_name("GPIO24")
     880                      .dwattr $C$DW$55, DW_AT_TI_symbol_name("_GPIO24")
     881                      .dwattr $C$DW$55, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x02)
     882                      .dwattr $C$DW$55, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     883                      .dwattr $C$DW$55, DW_AT_accessibility(DW_ACCESS_public)
     884              $C$DW$56        .dwtag  DW_TAG_member
     885                      .dwattr $C$DW$56, DW_AT_type(*$C$DW$T$19)
     886                      .dwattr $C$DW$56, DW_AT_name("GPIO25")
     887                      .dwattr $C$DW$56, DW_AT_TI_symbol_name("_GPIO25")
     888                      .dwattr $C$DW$56, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x02)
     889                      .dwattr $C$DW$56, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     890                      .dwattr $C$DW$56, DW_AT_accessibility(DW_ACCESS_public)
     891              $C$DW$57        .dwtag  DW_TAG_member
     892                      .dwattr $C$DW$57, DW_AT_type(*$C$DW$T$19)
     893                      .dwattr $C$DW$57, DW_AT_name("GPIO26")
     894                      .dwattr $C$DW$57, DW_AT_TI_symbol_name("_GPIO26")
     895                      .dwattr $C$DW$57, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x02)
     896                      .dwattr $C$DW$57, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     897                      .dwattr $C$DW$57, DW_AT_accessibility(DW_ACCESS_public)
     898              $C$DW$58        .dwtag  DW_TAG_member
     899                      .dwattr $C$DW$58, DW_AT_type(*$C$DW$T$19)
     900                      .dwattr $C$DW$58, DW_AT_name("GPIO27")
     901                      .dwattr $C$DW$58, DW_AT_TI_symbol_name("_GPIO27")
     902                      .dwattr $C$DW$58, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x02)
     903                      .dwattr $C$DW$58, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     904                      .dwattr $C$DW$58, DW_AT_accessibility(DW_ACCESS_public)
     905              $C$DW$59        .dwtag  DW_TAG_member
     906                      .dwattr $C$DW$59, DW_AT_type(*$C$DW$T$19)
     907                      .dwattr $C$DW$59, DW_AT_name("GPIO28")
     908                      .dwattr $C$DW$59, DW_AT_TI_symbol_name("_GPIO28")
     909                      .dwattr $C$DW$59, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x02)
     910                      .dwattr $C$DW$59, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     911                      .dwattr $C$DW$59, DW_AT_accessibility(DW_ACCESS_public)
     912              $C$DW$60        .dwtag  DW_TAG_member
     913                      .dwattr $C$DW$60, DW_AT_type(*$C$DW$T$19)
     914                      .dwattr $C$DW$60, DW_AT_name("GPIO29")
     915                      .dwattr $C$DW$60, DW_AT_TI_symbol_name("_GPIO29")
     916                      .dwattr $C$DW$60, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x02)
     917                      .dwattr $C$DW$60, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     918                      .dwattr $C$DW$60, DW_AT_accessibility(DW_ACCESS_public)
     919              $C$DW$61        .dwtag  DW_TAG_member
     920                      .dwattr $C$DW$61, DW_AT_type(*$C$DW$T$19)
     921                      .dwattr $C$DW$61, DW_AT_name("GPIO30")
     922                      .dwattr $C$DW$61, DW_AT_TI_symbol_name("_GPIO30")
     923                      .dwattr $C$DW$61, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x02)
     924                      .dwattr $C$DW$61, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     925                      .dwattr $C$DW$61, DW_AT_accessibility(DW_ACCESS_public)
     926              $C$DW$62        .dwtag  DW_TAG_member
     927                      .dwattr $C$DW$62, DW_AT_type(*$C$DW$T$19)
     928                      .dwattr $C$DW$62, DW_AT_name("GPIO31")
     929                      .dwattr $C$DW$62, DW_AT_TI_symbol_name("_GPIO31")
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:31 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0496010                           PAGE   19

     930                      .dwattr $C$DW$62, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x02)
     931                      .dwattr $C$DW$62, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     932                      .dwattr $C$DW$62, DW_AT_accessibility(DW_ACCESS_public)
     933                      .dwendtag $C$DW$T$23
     934              
     935              
     936              $C$DW$T$24      .dwtag  DW_TAG_union_type
     937                      .dwattr $C$DW$T$24, DW_AT_name("GPA2_REG")
     938                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x02)
     939              $C$DW$63        .dwtag  DW_TAG_member
     940                      .dwattr $C$DW$63, DW_AT_type(*$C$DW$T$21)
     941                      .dwattr $C$DW$63, DW_AT_name("all")
     942                      .dwattr $C$DW$63, DW_AT_TI_symbol_name("_all")
     943                      .dwattr $C$DW$63, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     944                      .dwattr $C$DW$63, DW_AT_accessibility(DW_ACCESS_public)
     945              $C$DW$64        .dwtag  DW_TAG_member
     946                      .dwattr $C$DW$64, DW_AT_type(*$C$DW$T$23)
     947                      .dwattr $C$DW$64, DW_AT_name("bit")
     948                      .dwattr $C$DW$64, DW_AT_TI_symbol_name("_bit")
     949                      .dwattr $C$DW$64, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     950                      .dwattr $C$DW$64, DW_AT_accessibility(DW_ACCESS_public)
     951                      .dwendtag $C$DW$T$24
     952              
     953              
     954              $C$DW$T$25      .dwtag  DW_TAG_structure_type
     955                      .dwattr $C$DW$T$25, DW_AT_name("GPACTRL_BITS")
     956                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x02)
     957              $C$DW$65        .dwtag  DW_TAG_member
     958                      .dwattr $C$DW$65, DW_AT_type(*$C$DW$T$19)
     959                      .dwattr $C$DW$65, DW_AT_name("QUALPRD0")
     960                      .dwattr $C$DW$65, DW_AT_TI_symbol_name("_QUALPRD0")
     961                      .dwattr $C$DW$65, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x08)
     962                      .dwattr $C$DW$65, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     963                      .dwattr $C$DW$65, DW_AT_accessibility(DW_ACCESS_public)
     964              $C$DW$66        .dwtag  DW_TAG_member
     965                      .dwattr $C$DW$66, DW_AT_type(*$C$DW$T$19)
     966                      .dwattr $C$DW$66, DW_AT_name("QUALPRD1")
     967                      .dwattr $C$DW$66, DW_AT_TI_symbol_name("_QUALPRD1")
     968                      .dwattr $C$DW$66, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x08)
     969                      .dwattr $C$DW$66, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     970                      .dwattr $C$DW$66, DW_AT_accessibility(DW_ACCESS_public)
     971              $C$DW$67        .dwtag  DW_TAG_member
     972                      .dwattr $C$DW$67, DW_AT_type(*$C$DW$T$19)
     973                      .dwattr $C$DW$67, DW_AT_name("QUALPRD2")
     974                      .dwattr $C$DW$67, DW_AT_TI_symbol_name("_QUALPRD2")
     975                      .dwattr $C$DW$67, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x08)
     976                      .dwattr $C$DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     977                      .dwattr $C$DW$67, DW_AT_accessibility(DW_ACCESS_public)
     978              $C$DW$68        .dwtag  DW_TAG_member
     979                      .dwattr $C$DW$68, DW_AT_type(*$C$DW$T$19)
     980                      .dwattr $C$DW$68, DW_AT_name("QUALPRD3")
     981                      .dwattr $C$DW$68, DW_AT_TI_symbol_name("_QUALPRD3")
     982                      .dwattr $C$DW$68, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x08)
     983                      .dwattr $C$DW$68, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     984                      .dwattr $C$DW$68, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:31 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0496010                           PAGE   20

     985                      .dwendtag $C$DW$T$25
     986              
     987              
     988              $C$DW$T$26      .dwtag  DW_TAG_union_type
     989                      .dwattr $C$DW$T$26, DW_AT_name("GPACTRL_REG")
     990                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x02)
     991              $C$DW$69        .dwtag  DW_TAG_member
     992                      .dwattr $C$DW$69, DW_AT_type(*$C$DW$T$21)
     993                      .dwattr $C$DW$69, DW_AT_name("all")
     994                      .dwattr $C$DW$69, DW_AT_TI_symbol_name("_all")
     995                      .dwattr $C$DW$69, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     996                      .dwattr $C$DW$69, DW_AT_accessibility(DW_ACCESS_public)
     997              $C$DW$70        .dwtag  DW_TAG_member
     998                      .dwattr $C$DW$70, DW_AT_type(*$C$DW$T$25)
     999                      .dwattr $C$DW$70, DW_AT_name("bit")
    1000                      .dwattr $C$DW$70, DW_AT_TI_symbol_name("_bit")
    1001                      .dwattr $C$DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1002                      .dwattr $C$DW$70, DW_AT_accessibility(DW_ACCESS_public)
    1003                      .dwendtag $C$DW$T$26
    1004              
    1005              
    1006              $C$DW$T$27      .dwtag  DW_TAG_structure_type
    1007                      .dwattr $C$DW$T$27, DW_AT_name("GPADAT_BITS")
    1008                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x02)
    1009              $C$DW$71        .dwtag  DW_TAG_member
    1010                      .dwattr $C$DW$71, DW_AT_type(*$C$DW$T$19)
    1011                      .dwattr $C$DW$71, DW_AT_name("GPIO0")
    1012                      .dwattr $C$DW$71, DW_AT_TI_symbol_name("_GPIO0")
    1013                      .dwattr $C$DW$71, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    1014                      .dwattr $C$DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1015                      .dwattr $C$DW$71, DW_AT_accessibility(DW_ACCESS_public)
    1016              $C$DW$72        .dwtag  DW_TAG_member
    1017                      .dwattr $C$DW$72, DW_AT_type(*$C$DW$T$19)
    1018                      .dwattr $C$DW$72, DW_AT_name("GPIO1")
    1019                      .dwattr $C$DW$72, DW_AT_TI_symbol_name("_GPIO1")
    1020                      .dwattr $C$DW$72, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    1021                      .dwattr $C$DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1022                      .dwattr $C$DW$72, DW_AT_accessibility(DW_ACCESS_public)
    1023              $C$DW$73        .dwtag  DW_TAG_member
    1024                      .dwattr $C$DW$73, DW_AT_type(*$C$DW$T$19)
    1025                      .dwattr $C$DW$73, DW_AT_name("GPIO2")
    1026                      .dwattr $C$DW$73, DW_AT_TI_symbol_name("_GPIO2")
    1027                      .dwattr $C$DW$73, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    1028                      .dwattr $C$DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1029                      .dwattr $C$DW$73, DW_AT_accessibility(DW_ACCESS_public)
    1030              $C$DW$74        .dwtag  DW_TAG_member
    1031                      .dwattr $C$DW$74, DW_AT_type(*$C$DW$T$19)
    1032                      .dwattr $C$DW$74, DW_AT_name("GPIO3")
    1033                      .dwattr $C$DW$74, DW_AT_TI_symbol_name("_GPIO3")
    1034                      .dwattr $C$DW$74, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    1035                      .dwattr $C$DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1036                      .dwattr $C$DW$74, DW_AT_accessibility(DW_ACCESS_public)
    1037              $C$DW$75        .dwtag  DW_TAG_member
    1038                      .dwattr $C$DW$75, DW_AT_type(*$C$DW$T$19)
    1039                      .dwattr $C$DW$75, DW_AT_name("GPIO4")
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:31 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0496010                           PAGE   21

    1040                      .dwattr $C$DW$75, DW_AT_TI_symbol_name("_GPIO4")
    1041                      .dwattr $C$DW$75, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    1042                      .dwattr $C$DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1043                      .dwattr $C$DW$75, DW_AT_accessibility(DW_ACCESS_public)
    1044              $C$DW$76        .dwtag  DW_TAG_member
    1045                      .dwattr $C$DW$76, DW_AT_type(*$C$DW$T$19)
    1046                      .dwattr $C$DW$76, DW_AT_name("GPIO5")
    1047                      .dwattr $C$DW$76, DW_AT_TI_symbol_name("_GPIO5")
    1048                      .dwattr $C$DW$76, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    1049                      .dwattr $C$DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1050                      .dwattr $C$DW$76, DW_AT_accessibility(DW_ACCESS_public)
    1051              $C$DW$77        .dwtag  DW_TAG_member
    1052                      .dwattr $C$DW$77, DW_AT_type(*$C$DW$T$19)
    1053                      .dwattr $C$DW$77, DW_AT_name("GPIO6")
    1054                      .dwattr $C$DW$77, DW_AT_TI_symbol_name("_GPIO6")
    1055                      .dwattr $C$DW$77, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    1056                      .dwattr $C$DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1057                      .dwattr $C$DW$77, DW_AT_accessibility(DW_ACCESS_public)
    1058              $C$DW$78        .dwtag  DW_TAG_member
    1059                      .dwattr $C$DW$78, DW_AT_type(*$C$DW$T$19)
    1060                      .dwattr $C$DW$78, DW_AT_name("GPIO7")
    1061                      .dwattr $C$DW$78, DW_AT_TI_symbol_name("_GPIO7")
    1062                      .dwattr $C$DW$78, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    1063                      .dwattr $C$DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1064                      .dwattr $C$DW$78, DW_AT_accessibility(DW_ACCESS_public)
    1065              $C$DW$79        .dwtag  DW_TAG_member
    1066                      .dwattr $C$DW$79, DW_AT_type(*$C$DW$T$19)
    1067                      .dwattr $C$DW$79, DW_AT_name("GPIO8")
    1068                      .dwattr $C$DW$79, DW_AT_TI_symbol_name("_GPIO8")
    1069                      .dwattr $C$DW$79, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
    1070                      .dwattr $C$DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1071                      .dwattr $C$DW$79, DW_AT_accessibility(DW_ACCESS_public)
    1072              $C$DW$80        .dwtag  DW_TAG_member
    1073                      .dwattr $C$DW$80, DW_AT_type(*$C$DW$T$19)
    1074                      .dwattr $C$DW$80, DW_AT_name("GPIO9")
    1075                      .dwattr $C$DW$80, DW_AT_TI_symbol_name("_GPIO9")
    1076                      .dwattr $C$DW$80, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    1077                      .dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1078                      .dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
    1079              $C$DW$81        .dwtag  DW_TAG_member
    1080                      .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$19)
    1081                      .dwattr $C$DW$81, DW_AT_name("GPIO10")
    1082                      .dwattr $C$DW$81, DW_AT_TI_symbol_name("_GPIO10")
    1083                      .dwattr $C$DW$81, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
    1084                      .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1085                      .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
    1086              $C$DW$82        .dwtag  DW_TAG_member
    1087                      .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$19)
    1088                      .dwattr $C$DW$82, DW_AT_name("GPIO11")
    1089                      .dwattr $C$DW$82, DW_AT_TI_symbol_name("_GPIO11")
    1090                      .dwattr $C$DW$82, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
    1091                      .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1092                      .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
    1093              $C$DW$83        .dwtag  DW_TAG_member
    1094                      .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:31 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0496010                           PAGE   22

    1095                      .dwattr $C$DW$83, DW_AT_name("GPIO12")
    1096                      .dwattr $C$DW$83, DW_AT_TI_symbol_name("_GPIO12")
    1097                      .dwattr $C$DW$83, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
    1098                      .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1099                      .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
    1100              $C$DW$84        .dwtag  DW_TAG_member
    1101                      .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$19)
    1102                      .dwattr $C$DW$84, DW_AT_name("GPIO13")
    1103                      .dwattr $C$DW$84, DW_AT_TI_symbol_name("_GPIO13")
    1104                      .dwattr $C$DW$84, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
    1105                      .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1106                      .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
    1107              $C$DW$85        .dwtag  DW_TAG_member
    1108                      .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$19)
    1109                      .dwattr $C$DW$85, DW_AT_name("GPIO14")
    1110                      .dwattr $C$DW$85, DW_AT_TI_symbol_name("_GPIO14")
    1111                      .dwattr $C$DW$85, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
    1112                      .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1113                      .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
    1114              $C$DW$86        .dwtag  DW_TAG_member
    1115                      .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$19)
    1116                      .dwattr $C$DW$86, DW_AT_name("GPIO15")
    1117                      .dwattr $C$DW$86, DW_AT_TI_symbol_name("_GPIO15")
    1118                      .dwattr $C$DW$86, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    1119                      .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1120                      .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
    1121              $C$DW$87        .dwtag  DW_TAG_member
    1122                      .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$19)
    1123                      .dwattr $C$DW$87, DW_AT_name("GPIO16")
    1124                      .dwattr $C$DW$87, DW_AT_TI_symbol_name("_GPIO16")
    1125                      .dwattr $C$DW$87, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    1126                      .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1127                      .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
    1128              $C$DW$88        .dwtag  DW_TAG_member
    1129                      .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$19)
    1130                      .dwattr $C$DW$88, DW_AT_name("GPIO17")
    1131                      .dwattr $C$DW$88, DW_AT_TI_symbol_name("_GPIO17")
    1132                      .dwattr $C$DW$88, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    1133                      .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1134                      .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
    1135              $C$DW$89        .dwtag  DW_TAG_member
    1136                      .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$19)
    1137                      .dwattr $C$DW$89, DW_AT_name("GPIO18")
    1138                      .dwattr $C$DW$89, DW_AT_TI_symbol_name("_GPIO18")
    1139                      .dwattr $C$DW$89, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    1140                      .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1141                      .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
    1142              $C$DW$90        .dwtag  DW_TAG_member
    1143                      .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$19)
    1144                      .dwattr $C$DW$90, DW_AT_name("GPIO19")
    1145                      .dwattr $C$DW$90, DW_AT_TI_symbol_name("_GPIO19")
    1146                      .dwattr $C$DW$90, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    1147                      .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1148                      .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
    1149              $C$DW$91        .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:31 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0496010                           PAGE   23

    1150                      .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$19)
    1151                      .dwattr $C$DW$91, DW_AT_name("GPIO20")
    1152                      .dwattr $C$DW$91, DW_AT_TI_symbol_name("_GPIO20")
    1153                      .dwattr $C$DW$91, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    1154                      .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1155                      .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
    1156              $C$DW$92        .dwtag  DW_TAG_member
    1157                      .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$19)
    1158                      .dwattr $C$DW$92, DW_AT_name("GPIO21")
    1159                      .dwattr $C$DW$92, DW_AT_TI_symbol_name("_GPIO21")
    1160                      .dwattr $C$DW$92, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    1161                      .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1162                      .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
    1163              $C$DW$93        .dwtag  DW_TAG_member
    1164                      .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$19)
    1165                      .dwattr $C$DW$93, DW_AT_name("GPIO22")
    1166                      .dwattr $C$DW$93, DW_AT_TI_symbol_name("_GPIO22")
    1167                      .dwattr $C$DW$93, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    1168                      .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1169                      .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
    1170              $C$DW$94        .dwtag  DW_TAG_member
    1171                      .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$19)
    1172                      .dwattr $C$DW$94, DW_AT_name("GPIO23")
    1173                      .dwattr $C$DW$94, DW_AT_TI_symbol_name("_GPIO23")
    1174                      .dwattr $C$DW$94, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    1175                      .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1176                      .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
    1177              $C$DW$95        .dwtag  DW_TAG_member
    1178                      .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$19)
    1179                      .dwattr $C$DW$95, DW_AT_name("GPIO24")
    1180                      .dwattr $C$DW$95, DW_AT_TI_symbol_name("_GPIO24")
    1181                      .dwattr $C$DW$95, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
    1182                      .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1183                      .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
    1184              $C$DW$96        .dwtag  DW_TAG_member
    1185                      .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$19)
    1186                      .dwattr $C$DW$96, DW_AT_name("GPIO25")
    1187                      .dwattr $C$DW$96, DW_AT_TI_symbol_name("_GPIO25")
    1188                      .dwattr $C$DW$96, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    1189                      .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1190                      .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
    1191              $C$DW$97        .dwtag  DW_TAG_member
    1192                      .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$19)
    1193                      .dwattr $C$DW$97, DW_AT_name("GPIO26")
    1194                      .dwattr $C$DW$97, DW_AT_TI_symbol_name("_GPIO26")
    1195                      .dwattr $C$DW$97, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
    1196                      .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1197                      .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
    1198              $C$DW$98        .dwtag  DW_TAG_member
    1199                      .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$19)
    1200                      .dwattr $C$DW$98, DW_AT_name("GPIO27")
    1201                      .dwattr $C$DW$98, DW_AT_TI_symbol_name("_GPIO27")
    1202                      .dwattr $C$DW$98, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
    1203                      .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1204                      .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:31 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0496010                           PAGE   24

    1205              $C$DW$99        .dwtag  DW_TAG_member
    1206                      .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$19)
    1207                      .dwattr $C$DW$99, DW_AT_name("GPIO28")
    1208                      .dwattr $C$DW$99, DW_AT_TI_symbol_name("_GPIO28")
    1209                      .dwattr $C$DW$99, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
    1210                      .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1211                      .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
    1212              $C$DW$100       .dwtag  DW_TAG_member
    1213                      .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$19)
    1214                      .dwattr $C$DW$100, DW_AT_name("GPIO29")
    1215                      .dwattr $C$DW$100, DW_AT_TI_symbol_name("_GPIO29")
    1216                      .dwattr $C$DW$100, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
    1217                      .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1218                      .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
    1219              $C$DW$101       .dwtag  DW_TAG_member
    1220                      .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$19)
    1221                      .dwattr $C$DW$101, DW_AT_name("GPIO30")
    1222                      .dwattr $C$DW$101, DW_AT_TI_symbol_name("_GPIO30")
    1223                      .dwattr $C$DW$101, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
    1224                      .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1225                      .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
    1226              $C$DW$102       .dwtag  DW_TAG_member
    1227                      .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$19)
    1228                      .dwattr $C$DW$102, DW_AT_name("GPIO31")
    1229                      .dwattr $C$DW$102, DW_AT_TI_symbol_name("_GPIO31")
    1230                      .dwattr $C$DW$102, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    1231                      .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1232                      .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
    1233                      .dwendtag $C$DW$T$27
    1234              
    1235              
    1236              $C$DW$T$28      .dwtag  DW_TAG_union_type
    1237                      .dwattr $C$DW$T$28, DW_AT_name("GPADAT_REG")
    1238                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x02)
    1239              $C$DW$103       .dwtag  DW_TAG_member
    1240                      .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$21)
    1241                      .dwattr $C$DW$103, DW_AT_name("all")
    1242                      .dwattr $C$DW$103, DW_AT_TI_symbol_name("_all")
    1243                      .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1244                      .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
    1245              $C$DW$104       .dwtag  DW_TAG_member
    1246                      .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$27)
    1247                      .dwattr $C$DW$104, DW_AT_name("bit")
    1248                      .dwattr $C$DW$104, DW_AT_TI_symbol_name("_bit")
    1249                      .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1250                      .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
    1251                      .dwendtag $C$DW$T$28
    1252              
    1253              
    1254              $C$DW$T$29      .dwtag  DW_TAG_structure_type
    1255                      .dwattr $C$DW$T$29, DW_AT_name("GPB1_BITS")
    1256                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x02)
    1257              $C$DW$105       .dwtag  DW_TAG_member
    1258                      .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$19)
    1259                      .dwattr $C$DW$105, DW_AT_name("GPIO32")
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:31 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0496010                           PAGE   25

    1260                      .dwattr $C$DW$105, DW_AT_TI_symbol_name("_GPIO32")
    1261                      .dwattr $C$DW$105, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x02)
    1262                      .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1263                      .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
    1264              $C$DW$106       .dwtag  DW_TAG_member
    1265                      .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$19)
    1266                      .dwattr $C$DW$106, DW_AT_name("GPIO33")
    1267                      .dwattr $C$DW$106, DW_AT_TI_symbol_name("_GPIO33")
    1268                      .dwattr $C$DW$106, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x02)
    1269                      .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1270                      .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    1271              $C$DW$107       .dwtag  DW_TAG_member
    1272                      .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$19)
    1273                      .dwattr $C$DW$107, DW_AT_name("GPIO34")
    1274                      .dwattr $C$DW$107, DW_AT_TI_symbol_name("_GPIO34")
    1275                      .dwattr $C$DW$107, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x02)
    1276                      .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1277                      .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
    1278              $C$DW$108       .dwtag  DW_TAG_member
    1279                      .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$19)
    1280                      .dwattr $C$DW$108, DW_AT_name("GPIO35")
    1281                      .dwattr $C$DW$108, DW_AT_TI_symbol_name("_GPIO35")
    1282                      .dwattr $C$DW$108, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x02)
    1283                      .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1284                      .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    1285              $C$DW$109       .dwtag  DW_TAG_member
    1286                      .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$19)
    1287                      .dwattr $C$DW$109, DW_AT_name("GPIO36")
    1288                      .dwattr $C$DW$109, DW_AT_TI_symbol_name("_GPIO36")
    1289                      .dwattr $C$DW$109, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x02)
    1290                      .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1291                      .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    1292              $C$DW$110       .dwtag  DW_TAG_member
    1293                      .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$19)
    1294                      .dwattr $C$DW$110, DW_AT_name("GPIO37")
    1295                      .dwattr $C$DW$110, DW_AT_TI_symbol_name("_GPIO37")
    1296                      .dwattr $C$DW$110, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x02)
    1297                      .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1298                      .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    1299              $C$DW$111       .dwtag  DW_TAG_member
    1300                      .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$19)
    1301                      .dwattr $C$DW$111, DW_AT_name("GPIO38")
    1302                      .dwattr $C$DW$111, DW_AT_TI_symbol_name("_GPIO38")
    1303                      .dwattr $C$DW$111, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x02)
    1304                      .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1305                      .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    1306              $C$DW$112       .dwtag  DW_TAG_member
    1307                      .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$19)
    1308                      .dwattr $C$DW$112, DW_AT_name("GPIO39")
    1309                      .dwattr $C$DW$112, DW_AT_TI_symbol_name("_GPIO39")
    1310                      .dwattr $C$DW$112, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x02)
    1311                      .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1312                      .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    1313              $C$DW$113       .dwtag  DW_TAG_member
    1314                      .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:31 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0496010                           PAGE   26

    1315                      .dwattr $C$DW$113, DW_AT_name("GPIO40")
    1316                      .dwattr $C$DW$113, DW_AT_TI_symbol_name("_GPIO40")
    1317                      .dwattr $C$DW$113, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x02)
    1318                      .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1319                      .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    1320              $C$DW$114       .dwtag  DW_TAG_member
    1321                      .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$19)
    1322                      .dwattr $C$DW$114, DW_AT_name("GPIO41")
    1323                      .dwattr $C$DW$114, DW_AT_TI_symbol_name("_GPIO41")
    1324                      .dwattr $C$DW$114, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x02)
    1325                      .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1326                      .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    1327              $C$DW$115       .dwtag  DW_TAG_member
    1328                      .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$19)
    1329                      .dwattr $C$DW$115, DW_AT_name("GPIO42")
    1330                      .dwattr $C$DW$115, DW_AT_TI_symbol_name("_GPIO42")
    1331                      .dwattr $C$DW$115, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x02)
    1332                      .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1333                      .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    1334              $C$DW$116       .dwtag  DW_TAG_member
    1335                      .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$19)
    1336                      .dwattr $C$DW$116, DW_AT_name("GPIO43")
    1337                      .dwattr $C$DW$116, DW_AT_TI_symbol_name("_GPIO43")
    1338                      .dwattr $C$DW$116, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x02)
    1339                      .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1340                      .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    1341              $C$DW$117       .dwtag  DW_TAG_member
    1342                      .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$19)
    1343                      .dwattr $C$DW$117, DW_AT_name("GPIO44")
    1344                      .dwattr $C$DW$117, DW_AT_TI_symbol_name("_GPIO44")
    1345                      .dwattr $C$DW$117, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x02)
    1346                      .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1347                      .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    1348              $C$DW$118       .dwtag  DW_TAG_member
    1349                      .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$19)
    1350                      .dwattr $C$DW$118, DW_AT_name("GPIO45")
    1351                      .dwattr $C$DW$118, DW_AT_TI_symbol_name("_GPIO45")
    1352                      .dwattr $C$DW$118, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x02)
    1353                      .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1354                      .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    1355              $C$DW$119       .dwtag  DW_TAG_member
    1356                      .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$19)
    1357                      .dwattr $C$DW$119, DW_AT_name("GPIO46")
    1358                      .dwattr $C$DW$119, DW_AT_TI_symbol_name("_GPIO46")
    1359                      .dwattr $C$DW$119, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x02)
    1360                      .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1361                      .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    1362              $C$DW$120       .dwtag  DW_TAG_member
    1363                      .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$19)
    1364                      .dwattr $C$DW$120, DW_AT_name("GPIO47")
    1365                      .dwattr $C$DW$120, DW_AT_TI_symbol_name("_GPIO47")
    1366                      .dwattr $C$DW$120, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x02)
    1367                      .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1368                      .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    1369                      .dwendtag $C$DW$T$29
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:31 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0496010                           PAGE   27

    1370              
    1371              
    1372              $C$DW$T$30      .dwtag  DW_TAG_union_type
    1373                      .dwattr $C$DW$T$30, DW_AT_name("GPB1_REG")
    1374                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x02)
    1375              $C$DW$121       .dwtag  DW_TAG_member
    1376                      .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$21)
    1377                      .dwattr $C$DW$121, DW_AT_name("all")
    1378                      .dwattr $C$DW$121, DW_AT_TI_symbol_name("_all")
    1379                      .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1380                      .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    1381              $C$DW$122       .dwtag  DW_TAG_member
    1382                      .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$29)
    1383                      .dwattr $C$DW$122, DW_AT_name("bit")
    1384                      .dwattr $C$DW$122, DW_AT_TI_symbol_name("_bit")
    1385                      .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1386                      .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    1387                      .dwendtag $C$DW$T$30
    1388              
    1389              
    1390              $C$DW$T$31      .dwtag  DW_TAG_structure_type
    1391                      .dwattr $C$DW$T$31, DW_AT_name("GPB2_BITS")
    1392                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x02)
    1393              $C$DW$123       .dwtag  DW_TAG_member
    1394                      .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$19)
    1395                      .dwattr $C$DW$123, DW_AT_name("GPIO48")
    1396                      .dwattr $C$DW$123, DW_AT_TI_symbol_name("_GPIO48")
    1397                      .dwattr $C$DW$123, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x02)
    1398                      .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1399                      .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    1400              $C$DW$124       .dwtag  DW_TAG_member
    1401                      .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$19)
    1402                      .dwattr $C$DW$124, DW_AT_name("GPIO49")
    1403                      .dwattr $C$DW$124, DW_AT_TI_symbol_name("_GPIO49")
    1404                      .dwattr $C$DW$124, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x02)
    1405                      .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1406                      .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    1407              $C$DW$125       .dwtag  DW_TAG_member
    1408                      .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$19)
    1409                      .dwattr $C$DW$125, DW_AT_name("GPIO50")
    1410                      .dwattr $C$DW$125, DW_AT_TI_symbol_name("_GPIO50")
    1411                      .dwattr $C$DW$125, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x02)
    1412                      .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1413                      .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    1414              $C$DW$126       .dwtag  DW_TAG_member
    1415                      .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$19)
    1416                      .dwattr $C$DW$126, DW_AT_name("GPIO51")
    1417                      .dwattr $C$DW$126, DW_AT_TI_symbol_name("_GPIO51")
    1418                      .dwattr $C$DW$126, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x02)
    1419                      .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1420                      .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    1421              $C$DW$127       .dwtag  DW_TAG_member
    1422                      .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$19)
    1423                      .dwattr $C$DW$127, DW_AT_name("GPIO52")
    1424                      .dwattr $C$DW$127, DW_AT_TI_symbol_name("_GPIO52")
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:31 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0496010                           PAGE   28

    1425                      .dwattr $C$DW$127, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x02)
    1426                      .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1427                      .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    1428              $C$DW$128       .dwtag  DW_TAG_member
    1429                      .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$19)
    1430                      .dwattr $C$DW$128, DW_AT_name("GPIO53")
    1431                      .dwattr $C$DW$128, DW_AT_TI_symbol_name("_GPIO53")
    1432                      .dwattr $C$DW$128, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x02)
    1433                      .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1434                      .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    1435              $C$DW$129       .dwtag  DW_TAG_member
    1436                      .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$19)
    1437                      .dwattr $C$DW$129, DW_AT_name("GPIO54")
    1438                      .dwattr $C$DW$129, DW_AT_TI_symbol_name("_GPIO54")
    1439                      .dwattr $C$DW$129, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x02)
    1440                      .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1441                      .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    1442              $C$DW$130       .dwtag  DW_TAG_member
    1443                      .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$19)
    1444                      .dwattr $C$DW$130, DW_AT_name("GPIO55")
    1445                      .dwattr $C$DW$130, DW_AT_TI_symbol_name("_GPIO55")
    1446                      .dwattr $C$DW$130, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x02)
    1447                      .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1448                      .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    1449              $C$DW$131       .dwtag  DW_TAG_member
    1450                      .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$19)
    1451                      .dwattr $C$DW$131, DW_AT_name("GPIO56")
    1452                      .dwattr $C$DW$131, DW_AT_TI_symbol_name("_GPIO56")
    1453                      .dwattr $C$DW$131, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x02)
    1454                      .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1455                      .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    1456              $C$DW$132       .dwtag  DW_TAG_member
    1457                      .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$19)
    1458                      .dwattr $C$DW$132, DW_AT_name("GPIO57")
    1459                      .dwattr $C$DW$132, DW_AT_TI_symbol_name("_GPIO57")
    1460                      .dwattr $C$DW$132, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x02)
    1461                      .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1462                      .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    1463              $C$DW$133       .dwtag  DW_TAG_member
    1464                      .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$19)
    1465                      .dwattr $C$DW$133, DW_AT_name("GPIO58")
    1466                      .dwattr $C$DW$133, DW_AT_TI_symbol_name("_GPIO58")
    1467                      .dwattr $C$DW$133, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x02)
    1468                      .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1469                      .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    1470              $C$DW$134       .dwtag  DW_TAG_member
    1471                      .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$19)
    1472                      .dwattr $C$DW$134, DW_AT_name("GPIO59")
    1473                      .dwattr $C$DW$134, DW_AT_TI_symbol_name("_GPIO59")
    1474                      .dwattr $C$DW$134, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x02)
    1475                      .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1476                      .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    1477              $C$DW$135       .dwtag  DW_TAG_member
    1478                      .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$19)
    1479                      .dwattr $C$DW$135, DW_AT_name("GPIO60")
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:31 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0496010                           PAGE   29

    1480                      .dwattr $C$DW$135, DW_AT_TI_symbol_name("_GPIO60")
    1481                      .dwattr $C$DW$135, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x02)
    1482                      .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1483                      .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    1484              $C$DW$136       .dwtag  DW_TAG_member
    1485                      .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$19)
    1486                      .dwattr $C$DW$136, DW_AT_name("GPIO61")
    1487                      .dwattr $C$DW$136, DW_AT_TI_symbol_name("_GPIO61")
    1488                      .dwattr $C$DW$136, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x02)
    1489                      .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1490                      .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    1491              $C$DW$137       .dwtag  DW_TAG_member
    1492                      .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$19)
    1493                      .dwattr $C$DW$137, DW_AT_name("GPIO62")
    1494                      .dwattr $C$DW$137, DW_AT_TI_symbol_name("_GPIO62")
    1495                      .dwattr $C$DW$137, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x02)
    1496                      .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1497                      .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    1498              $C$DW$138       .dwtag  DW_TAG_member
    1499                      .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$19)
    1500                      .dwattr $C$DW$138, DW_AT_name("GPIO63")
    1501                      .dwattr $C$DW$138, DW_AT_TI_symbol_name("_GPIO63")
    1502                      .dwattr $C$DW$138, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x02)
    1503                      .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1504                      .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    1505                      .dwendtag $C$DW$T$31
    1506              
    1507              
    1508              $C$DW$T$32      .dwtag  DW_TAG_union_type
    1509                      .dwattr $C$DW$T$32, DW_AT_name("GPB2_REG")
    1510                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x02)
    1511              $C$DW$139       .dwtag  DW_TAG_member
    1512                      .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$21)
    1513                      .dwattr $C$DW$139, DW_AT_name("all")
    1514                      .dwattr $C$DW$139, DW_AT_TI_symbol_name("_all")
    1515                      .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1516                      .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    1517              $C$DW$140       .dwtag  DW_TAG_member
    1518                      .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$31)
    1519                      .dwattr $C$DW$140, DW_AT_name("bit")
    1520                      .dwattr $C$DW$140, DW_AT_TI_symbol_name("_bit")
    1521                      .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1522                      .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    1523                      .dwendtag $C$DW$T$32
    1524              
    1525              
    1526              $C$DW$T$33      .dwtag  DW_TAG_structure_type
    1527                      .dwattr $C$DW$T$33, DW_AT_name("GPBCTRL_BITS")
    1528                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x02)
    1529              $C$DW$141       .dwtag  DW_TAG_member
    1530                      .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$19)
    1531                      .dwattr $C$DW$141, DW_AT_name("QUALPRD0")
    1532                      .dwattr $C$DW$141, DW_AT_TI_symbol_name("_QUALPRD0")
    1533                      .dwattr $C$DW$141, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x08)
    1534                      .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:31 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0496010                           PAGE   30

    1535                      .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    1536              $C$DW$142       .dwtag  DW_TAG_member
    1537                      .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$19)
    1538                      .dwattr $C$DW$142, DW_AT_name("QUALPRD1")
    1539                      .dwattr $C$DW$142, DW_AT_TI_symbol_name("_QUALPRD1")
    1540                      .dwattr $C$DW$142, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x08)
    1541                      .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1542                      .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    1543              $C$DW$143       .dwtag  DW_TAG_member
    1544                      .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$19)
    1545                      .dwattr $C$DW$143, DW_AT_name("QUALPRD2")
    1546                      .dwattr $C$DW$143, DW_AT_TI_symbol_name("_QUALPRD2")
    1547                      .dwattr $C$DW$143, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x08)
    1548                      .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1549                      .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    1550              $C$DW$144       .dwtag  DW_TAG_member
    1551                      .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$19)
    1552                      .dwattr $C$DW$144, DW_AT_name("QUALPRD3")
    1553                      .dwattr $C$DW$144, DW_AT_TI_symbol_name("_QUALPRD3")
    1554                      .dwattr $C$DW$144, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x08)
    1555                      .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1556                      .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    1557                      .dwendtag $C$DW$T$33
    1558              
    1559              
    1560              $C$DW$T$34      .dwtag  DW_TAG_union_type
    1561                      .dwattr $C$DW$T$34, DW_AT_name("GPBCTRL_REG")
    1562                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x02)
    1563              $C$DW$145       .dwtag  DW_TAG_member
    1564                      .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$21)
    1565                      .dwattr $C$DW$145, DW_AT_name("all")
    1566                      .dwattr $C$DW$145, DW_AT_TI_symbol_name("_all")
    1567                      .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1568                      .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    1569              $C$DW$146       .dwtag  DW_TAG_member
    1570                      .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$33)
    1571                      .dwattr $C$DW$146, DW_AT_name("bit")
    1572                      .dwattr $C$DW$146, DW_AT_TI_symbol_name("_bit")
    1573                      .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1574                      .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
    1575                      .dwendtag $C$DW$T$34
    1576              
    1577              
    1578              $C$DW$T$35      .dwtag  DW_TAG_structure_type
    1579                      .dwattr $C$DW$T$35, DW_AT_name("GPBDAT_BITS")
    1580                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x02)
    1581              $C$DW$147       .dwtag  DW_TAG_member
    1582                      .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$19)
    1583                      .dwattr $C$DW$147, DW_AT_name("GPIO32")
    1584                      .dwattr $C$DW$147, DW_AT_TI_symbol_name("_GPIO32")
    1585                      .dwattr $C$DW$147, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    1586                      .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1587                      .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
    1588              $C$DW$148       .dwtag  DW_TAG_member
    1589                      .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:31 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0496010                           PAGE   31

    1590                      .dwattr $C$DW$148, DW_AT_name("GPIO33")
    1591                      .dwattr $C$DW$148, DW_AT_TI_symbol_name("_GPIO33")
    1592                      .dwattr $C$DW$148, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    1593                      .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1594                      .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    1595              $C$DW$149       .dwtag  DW_TAG_member
    1596                      .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$19)
    1597                      .dwattr $C$DW$149, DW_AT_name("GPIO34")
    1598                      .dwattr $C$DW$149, DW_AT_TI_symbol_name("_GPIO34")
    1599                      .dwattr $C$DW$149, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    1600                      .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1601                      .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    1602              $C$DW$150       .dwtag  DW_TAG_member
    1603                      .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$19)
    1604                      .dwattr $C$DW$150, DW_AT_name("GPIO35")
    1605                      .dwattr $C$DW$150, DW_AT_TI_symbol_name("_GPIO35")
    1606                      .dwattr $C$DW$150, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    1607                      .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1608                      .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
    1609              $C$DW$151       .dwtag  DW_TAG_member
    1610                      .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$19)
    1611                      .dwattr $C$DW$151, DW_AT_name("GPIO36")
    1612                      .dwattr $C$DW$151, DW_AT_TI_symbol_name("_GPIO36")
    1613                      .dwattr $C$DW$151, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    1614                      .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1615                      .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    1616              $C$DW$152       .dwtag  DW_TAG_member
    1617                      .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$19)
    1618                      .dwattr $C$DW$152, DW_AT_name("GPIO37")
    1619                      .dwattr $C$DW$152, DW_AT_TI_symbol_name("_GPIO37")
    1620                      .dwattr $C$DW$152, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    1621                      .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1622                      .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    1623              $C$DW$153       .dwtag  DW_TAG_member
    1624                      .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$19)
    1625                      .dwattr $C$DW$153, DW_AT_name("GPIO38")
    1626                      .dwattr $C$DW$153, DW_AT_TI_symbol_name("_GPIO38")
    1627                      .dwattr $C$DW$153, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    1628                      .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1629                      .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    1630              $C$DW$154       .dwtag  DW_TAG_member
    1631                      .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$19)
    1632                      .dwattr $C$DW$154, DW_AT_name("GPIO39")
    1633                      .dwattr $C$DW$154, DW_AT_TI_symbol_name("_GPIO39")
    1634                      .dwattr $C$DW$154, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    1635                      .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1636                      .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
    1637              $C$DW$155       .dwtag  DW_TAG_member
    1638                      .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$19)
    1639                      .dwattr $C$DW$155, DW_AT_name("GPIO40")
    1640                      .dwattr $C$DW$155, DW_AT_TI_symbol_name("_GPIO40")
    1641                      .dwattr $C$DW$155, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
    1642                      .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1643                      .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
    1644              $C$DW$156       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:31 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0496010                           PAGE   32

    1645                      .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$19)
    1646                      .dwattr $C$DW$156, DW_AT_name("GPIO41")
    1647                      .dwattr $C$DW$156, DW_AT_TI_symbol_name("_GPIO41")
    1648                      .dwattr $C$DW$156, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    1649                      .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1650                      .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    1651              $C$DW$157       .dwtag  DW_TAG_member
    1652                      .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$19)
    1653                      .dwattr $C$DW$157, DW_AT_name("GPIO42")
    1654                      .dwattr $C$DW$157, DW_AT_TI_symbol_name("_GPIO42")
    1655                      .dwattr $C$DW$157, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
    1656                      .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1657                      .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    1658              $C$DW$158       .dwtag  DW_TAG_member
    1659                      .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$19)
    1660                      .dwattr $C$DW$158, DW_AT_name("GPIO43")
    1661                      .dwattr $C$DW$158, DW_AT_TI_symbol_name("_GPIO43")
    1662                      .dwattr $C$DW$158, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
    1663                      .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1664                      .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    1665              $C$DW$159       .dwtag  DW_TAG_member
    1666                      .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$19)
    1667                      .dwattr $C$DW$159, DW_AT_name("GPIO44")
    1668                      .dwattr $C$DW$159, DW_AT_TI_symbol_name("_GPIO44")
    1669                      .dwattr $C$DW$159, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
    1670                      .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1671                      .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    1672              $C$DW$160       .dwtag  DW_TAG_member
    1673                      .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$19)
    1674                      .dwattr $C$DW$160, DW_AT_name("GPIO45")
    1675                      .dwattr $C$DW$160, DW_AT_TI_symbol_name("_GPIO45")
    1676                      .dwattr $C$DW$160, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
    1677                      .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1678                      .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    1679              $C$DW$161       .dwtag  DW_TAG_member
    1680                      .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$19)
    1681                      .dwattr $C$DW$161, DW_AT_name("GPIO46")
    1682                      .dwattr $C$DW$161, DW_AT_TI_symbol_name("_GPIO46")
    1683                      .dwattr $C$DW$161, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
    1684                      .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1685                      .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    1686              $C$DW$162       .dwtag  DW_TAG_member
    1687                      .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$19)
    1688                      .dwattr $C$DW$162, DW_AT_name("GPIO47")
    1689                      .dwattr $C$DW$162, DW_AT_TI_symbol_name("_GPIO47")
    1690                      .dwattr $C$DW$162, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    1691                      .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1692                      .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    1693              $C$DW$163       .dwtag  DW_TAG_member
    1694                      .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$19)
    1695                      .dwattr $C$DW$163, DW_AT_name("GPIO48")
    1696                      .dwattr $C$DW$163, DW_AT_TI_symbol_name("_GPIO48")
    1697                      .dwattr $C$DW$163, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    1698                      .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1699                      .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:31 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0496010                           PAGE   33

    1700              $C$DW$164       .dwtag  DW_TAG_member
    1701                      .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$19)
    1702                      .dwattr $C$DW$164, DW_AT_name("GPIO49")
    1703                      .dwattr $C$DW$164, DW_AT_TI_symbol_name("_GPIO49")
    1704                      .dwattr $C$DW$164, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    1705                      .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1706                      .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    1707              $C$DW$165       .dwtag  DW_TAG_member
    1708                      .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$19)
    1709                      .dwattr $C$DW$165, DW_AT_name("GPIO50")
    1710                      .dwattr $C$DW$165, DW_AT_TI_symbol_name("_GPIO50")
    1711                      .dwattr $C$DW$165, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    1712                      .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1713                      .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    1714              $C$DW$166       .dwtag  DW_TAG_member
    1715                      .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$19)
    1716                      .dwattr $C$DW$166, DW_AT_name("GPIO51")
    1717                      .dwattr $C$DW$166, DW_AT_TI_symbol_name("_GPIO51")
    1718                      .dwattr $C$DW$166, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    1719                      .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1720                      .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    1721              $C$DW$167       .dwtag  DW_TAG_member
    1722                      .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$19)
    1723                      .dwattr $C$DW$167, DW_AT_name("GPIO52")
    1724                      .dwattr $C$DW$167, DW_AT_TI_symbol_name("_GPIO52")
    1725                      .dwattr $C$DW$167, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    1726                      .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1727                      .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    1728              $C$DW$168       .dwtag  DW_TAG_member
    1729                      .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$19)
    1730                      .dwattr $C$DW$168, DW_AT_name("GPIO53")
    1731                      .dwattr $C$DW$168, DW_AT_TI_symbol_name("_GPIO53")
    1732                      .dwattr $C$DW$168, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    1733                      .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1734                      .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    1735              $C$DW$169       .dwtag  DW_TAG_member
    1736                      .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$19)
    1737                      .dwattr $C$DW$169, DW_AT_name("GPIO54")
    1738                      .dwattr $C$DW$169, DW_AT_TI_symbol_name("_GPIO54")
    1739                      .dwattr $C$DW$169, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    1740                      .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1741                      .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    1742              $C$DW$170       .dwtag  DW_TAG_member
    1743                      .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$19)
    1744                      .dwattr $C$DW$170, DW_AT_name("GPIO55")
    1745                      .dwattr $C$DW$170, DW_AT_TI_symbol_name("_GPIO55")
    1746                      .dwattr $C$DW$170, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    1747                      .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1748                      .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    1749              $C$DW$171       .dwtag  DW_TAG_member
    1750                      .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$19)
    1751                      .dwattr $C$DW$171, DW_AT_name("GPIO56")
    1752                      .dwattr $C$DW$171, DW_AT_TI_symbol_name("_GPIO56")
    1753                      .dwattr $C$DW$171, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
    1754                      .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:31 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0496010                           PAGE   34

    1755                      .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    1756              $C$DW$172       .dwtag  DW_TAG_member
    1757                      .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$19)
    1758                      .dwattr $C$DW$172, DW_AT_name("GPIO57")
    1759                      .dwattr $C$DW$172, DW_AT_TI_symbol_name("_GPIO57")
    1760                      .dwattr $C$DW$172, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    1761                      .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1762                      .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    1763              $C$DW$173       .dwtag  DW_TAG_member
    1764                      .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$19)
    1765                      .dwattr $C$DW$173, DW_AT_name("GPIO58")
    1766                      .dwattr $C$DW$173, DW_AT_TI_symbol_name("_GPIO58")
    1767                      .dwattr $C$DW$173, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
    1768                      .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1769                      .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
    1770              $C$DW$174       .dwtag  DW_TAG_member
    1771                      .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$19)
    1772                      .dwattr $C$DW$174, DW_AT_name("GPIO59")
    1773                      .dwattr $C$DW$174, DW_AT_TI_symbol_name("_GPIO59")
    1774                      .dwattr $C$DW$174, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
    1775                      .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1776                      .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
    1777              $C$DW$175       .dwtag  DW_TAG_member
    1778                      .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$19)
    1779                      .dwattr $C$DW$175, DW_AT_name("GPIO60")
    1780                      .dwattr $C$DW$175, DW_AT_TI_symbol_name("_GPIO60")
    1781                      .dwattr $C$DW$175, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
    1782                      .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1783                      .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
    1784              $C$DW$176       .dwtag  DW_TAG_member
    1785                      .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$19)
    1786                      .dwattr $C$DW$176, DW_AT_name("GPIO61")
    1787                      .dwattr $C$DW$176, DW_AT_TI_symbol_name("_GPIO61")
    1788                      .dwattr $C$DW$176, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
    1789                      .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1790                      .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
    1791              $C$DW$177       .dwtag  DW_TAG_member
    1792                      .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$19)
    1793                      .dwattr $C$DW$177, DW_AT_name("GPIO62")
    1794                      .dwattr $C$DW$177, DW_AT_TI_symbol_name("_GPIO62")
    1795                      .dwattr $C$DW$177, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
    1796                      .dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1797                      .dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
    1798              $C$DW$178       .dwtag  DW_TAG_member
    1799                      .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$19)
    1800                      .dwattr $C$DW$178, DW_AT_name("GPIO63")
    1801                      .dwattr $C$DW$178, DW_AT_TI_symbol_name("_GPIO63")
    1802                      .dwattr $C$DW$178, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    1803                      .dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1804                      .dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
    1805                      .dwendtag $C$DW$T$35
    1806              
    1807              
    1808              $C$DW$T$36      .dwtag  DW_TAG_union_type
    1809                      .dwattr $C$DW$T$36, DW_AT_name("GPBDAT_REG")
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:31 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0496010                           PAGE   35

    1810                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x02)
    1811              $C$DW$179       .dwtag  DW_TAG_member
    1812                      .dwattr $C$DW$179, DW_AT_type(*$C$DW$T$21)
    1813                      .dwattr $C$DW$179, DW_AT_name("all")
    1814                      .dwattr $C$DW$179, DW_AT_TI_symbol_name("_all")
    1815                      .dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1816                      .dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
    1817              $C$DW$180       .dwtag  DW_TAG_member
    1818                      .dwattr $C$DW$180, DW_AT_type(*$C$DW$T$35)
    1819                      .dwattr $C$DW$180, DW_AT_name("bit")
    1820                      .dwattr $C$DW$180, DW_AT_TI_symbol_name("_bit")
    1821                      .dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1822                      .dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
    1823                      .dwendtag $C$DW$T$36
    1824              
    1825              
    1826              $C$DW$T$37      .dwtag  DW_TAG_structure_type
    1827                      .dwattr $C$DW$T$37, DW_AT_name("GPC1_BITS")
    1828                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x02)
