TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:06 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0465610                           PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v6.2.7 *
       3              ;* Date/Time created: Thu Jul 02 08:31:06 2015                 *
       4              ;***************************************************************
       5                      .compiler_opts --diag_wrap=off --float_support=fpu32 --hll_source=on --mem_model:code=flat --mem_mode
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("../cntrlI2C/I2Ccore.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v6.2.7 Copyright (c) 1996-2014 Texas I
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("D:\ActiveProject\EKT5\PKMT_NONBIOS\InvertorCntrl\ISPprg")
      13              $C$DW$1 .dwtag  DW_TAG_variable, DW_AT_name("I2caRegs")
      14                      .dwattr $C$DW$1, DW_AT_TI_symbol_name("_I2caRegs")
      15                      .dwattr $C$DW$1, DW_AT_type(*$C$DW$T$74)

     743 000000b2               .sect   ".text"
     744                      .clink
     745                      .global _Idle_I2C
     746              
     747              $C$DW$46        .dwtag  DW_TAG_subprogram, DW_AT_name("Idle_I2C")
     748                      .dwattr $C$DW$46, DW_AT_low_pc(_Idle_I2C)
     749                      .dwattr $C$DW$46, DW_AT_high_pc(0x00)
     750                      .dwattr $C$DW$46, DW_AT_TI_symbol_name("_Idle_I2C")
     751                      .dwattr $C$DW$46, DW_AT_external
     752                      .dwattr $C$DW$46, DW_AT_type(*$C$DW$T$5)
     753                      .dwattr $C$DW$46, DW_AT_TI_begin_file("../cntrlI2C/I2Ccore.c")
     754                      .dwattr $C$DW$46, DW_AT_TI_begin_line(0x1b7)
     755                      .dwattr $C$DW$46, DW_AT_TI_begin_column(0x06)
     756                      .dwattr $C$DW$46, DW_AT_TI_max_frame_size(-2)
     757                      .dwpsn  file "../cntrlI2C/I2Ccore.c",line 439,column 20,is_stmt,address _Idle_I2C
     758              
     759                      .dwfde $C$DW$CIE, _Idle_I2C
     760              
     761              ;***************************************************************
     762              ;* FNAME: _Idle_I2C                     FR SIZE:   0           *
     763              ;*                                                             *
     764              ;* FUNCTION ENVIRONMENT                                        *
     765              ;*                                                             *
     766              ;* FUNCTION PROPERTIES                                         *
     767              ;*                            0 Parameter,  0 Auto,  0 SOE     *
     768              ;***************************************************************
     769              
     770 000000b2       _Idle_I2C:
     771                      .dwcfi  cfa_offset, -2
     772                      .dwcfi  save_reg_to_mem, 26, 0
     773                      .dwcfi  save_reg_to_reg, 78, 26
     774                      .dwpsn  file "../cntrlI2C/I2Ccore.c",line 443,column 2,is_stmt
     775 000000b2 761F!         MOVW      DP,#_I2caRegs+9       ; [CPU_U] 
         000000b3 0000 
     776 000000b4 CC09!         AND       AL,@_I2caRegs+9,#0x0800 ; [CPU_] |443| 
         000000b5 0800 
     777 000000b6 FFCA          LSR       AL,11                 ; [CPU_] |443| 
     778 000000b7 5201          CMPB      AL,#1                 ; [CPU_] |443| 
     779 000000b8 ED03          BF        $C$L16,NEQ            ; [CPU_] |443| 
     780                      ; branchcc occurs ; [] |443| 
     781                      .dwpsn  file "../cntrlI2C/I2Ccore.c",line 444,column 3,is_stmt
     782 000000b9 9A01          MOVB      AL,#1                 ; [CPU_] |444| 
     783 000000ba 6F06          B         $C$L18,UNC            ; [CPU_] |444| 
     784                      ; branch occurs ; [] |444| 
     785 000000bb       $C$L16:    
     786                      .dwpsn  file "../cntrlI2C/I2Ccore.c",line 446,column 3,is_stmt
     787 000000bb 4502!         TBIT      @_I2caRegs+2,#5       ; [CPU_] |446| 
     788 000000bc EF03          BF        $C$L17,NTC            ; [CPU_] |446| 
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:06 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0465610                           PAGE   16

     789                      ; branchcc occurs ; [] |446| 
     790                      .dwpsn  file "../cntrlI2C/I2Ccore.c",line 447,column 4,is_stmt
     791 000000bd 1A02!         OR        @_I2caRegs+2,#0x0020  ; [CPU_] |447| 
         000000be 0020 
     792 000000bf       $C$L17:    
     793                      .dwpsn  file "../cntrlI2C/I2Ccore.c",line 448,column 3,is_stmt
     794 000000bf 9A00          MOVB      AL,#0                 ; [CPU_] |448| 
     795 000000c0       $C$L18:    
     796                      .dwpsn  file "../cntrlI2C/I2Ccore.c",line 450,column 1,is_stmt
     797              $C$DW$47        .dwtag  DW_TAG_TI_branch
     798                      .dwattr $C$DW$47, DW_AT_low_pc(0x00)
     799                      .dwattr $C$DW$47, DW_AT_TI_return
     800 000000c0 0006          LRETR     ; [CPU_] 
     801                      ; return occurs ; [] 
     802                      .dwattr $C$DW$46, DW_AT_TI_end_file("../cntrlI2C/I2Ccore.c")
     803                      .dwattr $C$DW$46, DW_AT_TI_end_line(0x1c2)
     804                      .dwattr $C$DW$46, DW_AT_TI_end_column(0x01)
     805                      .dwendentry
     806                      .dwendtag $C$DW$46
     807              
     808              ;**************************************************************
     809              ;* UNDEFINED EXTERNAL REFERENCES                              *
     810              ;**************************************************************
     811                      .global _I2caRegs
     812                      .global _GpioCtrlRegs
     813              
     814              ;***************************************************************
     815              ;* TYPE INFORMATION                                            *
     816              ;***************************************************************
     817              
     818              $C$DW$T$20      .dwtag  DW_TAG_structure_type
     819                      .dwattr $C$DW$T$20, DW_AT_name("GPA1_BITS")
     820                      .dwattr $C$DW$T$20, DW_AT_byte_size(0x02)
     821              $C$DW$48        .dwtag  DW_TAG_member
     822                      .dwattr $C$DW$48, DW_AT_type(*$C$DW$T$19)
     823                      .dwattr $C$DW$48, DW_AT_name("GPIO0")
     824                      .dwattr $C$DW$48, DW_AT_TI_symbol_name("_GPIO0")
     825                      .dwattr $C$DW$48, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x02)
     826                      .dwattr $C$DW$48, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     827                      .dwattr $C$DW$48, DW_AT_accessibility(DW_ACCESS_public)
     828              $C$DW$49        .dwtag  DW_TAG_member
     829                      .dwattr $C$DW$49, DW_AT_type(*$C$DW$T$19)
     830                      .dwattr $C$DW$49, DW_AT_name("GPIO1")
     831                      .dwattr $C$DW$49, DW_AT_TI_symbol_name("_GPIO1")
     832                      .dwattr $C$DW$49, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x02)
     833                      .dwattr $C$DW$49, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     834                      .dwattr $C$DW$49, DW_AT_accessibility(DW_ACCESS_public)
     835              $C$DW$50        .dwtag  DW_TAG_member
     836                      .dwattr $C$DW$50, DW_AT_type(*$C$DW$T$19)
     837                      .dwattr $C$DW$50, DW_AT_name("GPIO2")
     838                      .dwattr $C$DW$50, DW_AT_TI_symbol_name("_GPIO2")
     839                      .dwattr $C$DW$50, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x02)
     840                      .dwattr $C$DW$50, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     841                      .dwattr $C$DW$50, DW_AT_accessibility(DW_ACCESS_public)
     842              $C$DW$51        .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:06 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0465610                           PAGE   17

     843                      .dwattr $C$DW$51, DW_AT_type(*$C$DW$T$19)
     844                      .dwattr $C$DW$51, DW_AT_name("GPIO3")
     845                      .dwattr $C$DW$51, DW_AT_TI_symbol_name("_GPIO3")
     846                      .dwattr $C$DW$51, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x02)
     847                      .dwattr $C$DW$51, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     848                      .dwattr $C$DW$51, DW_AT_accessibility(DW_ACCESS_public)
     849              $C$DW$52        .dwtag  DW_TAG_member
     850                      .dwattr $C$DW$52, DW_AT_type(*$C$DW$T$19)
     851                      .dwattr $C$DW$52, DW_AT_name("GPIO4")
     852                      .dwattr $C$DW$52, DW_AT_TI_symbol_name("_GPIO4")
     853                      .dwattr $C$DW$52, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x02)
     854                      .dwattr $C$DW$52, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     855                      .dwattr $C$DW$52, DW_AT_accessibility(DW_ACCESS_public)
     856              $C$DW$53        .dwtag  DW_TAG_member
     857                      .dwattr $C$DW$53, DW_AT_type(*$C$DW$T$19)
     858                      .dwattr $C$DW$53, DW_AT_name("GPIO5")
     859                      .dwattr $C$DW$53, DW_AT_TI_symbol_name("_GPIO5")
     860                      .dwattr $C$DW$53, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x02)
     861                      .dwattr $C$DW$53, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     862                      .dwattr $C$DW$53, DW_AT_accessibility(DW_ACCESS_public)
     863              $C$DW$54        .dwtag  DW_TAG_member
     864                      .dwattr $C$DW$54, DW_AT_type(*$C$DW$T$19)
     865                      .dwattr $C$DW$54, DW_AT_name("GPIO6")
     866                      .dwattr $C$DW$54, DW_AT_TI_symbol_name("_GPIO6")
     867                      .dwattr $C$DW$54, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x02)
     868                      .dwattr $C$DW$54, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     869                      .dwattr $C$DW$54, DW_AT_accessibility(DW_ACCESS_public)
     870              $C$DW$55        .dwtag  DW_TAG_member
     871                      .dwattr $C$DW$55, DW_AT_type(*$C$DW$T$19)
     872                      .dwattr $C$DW$55, DW_AT_name("GPIO7")
     873                      .dwattr $C$DW$55, DW_AT_TI_symbol_name("_GPIO7")
     874                      .dwattr $C$DW$55, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x02)
     875                      .dwattr $C$DW$55, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     876                      .dwattr $C$DW$55, DW_AT_accessibility(DW_ACCESS_public)
     877              $C$DW$56        .dwtag  DW_TAG_member
     878                      .dwattr $C$DW$56, DW_AT_type(*$C$DW$T$19)
     879                      .dwattr $C$DW$56, DW_AT_name("GPIO8")
     880                      .dwattr $C$DW$56, DW_AT_TI_symbol_name("_GPIO8")
     881                      .dwattr $C$DW$56, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x02)
     882                      .dwattr $C$DW$56, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     883                      .dwattr $C$DW$56, DW_AT_accessibility(DW_ACCESS_public)
     884              $C$DW$57        .dwtag  DW_TAG_member
     885                      .dwattr $C$DW$57, DW_AT_type(*$C$DW$T$19)
     886                      .dwattr $C$DW$57, DW_AT_name("GPIO9")
     887                      .dwattr $C$DW$57, DW_AT_TI_symbol_name("_GPIO9")
     888                      .dwattr $C$DW$57, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x02)
     889                      .dwattr $C$DW$57, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     890                      .dwattr $C$DW$57, DW_AT_accessibility(DW_ACCESS_public)
     891              $C$DW$58        .dwtag  DW_TAG_member
     892                      .dwattr $C$DW$58, DW_AT_type(*$C$DW$T$19)
     893                      .dwattr $C$DW$58, DW_AT_name("GPIO10")
     894                      .dwattr $C$DW$58, DW_AT_TI_symbol_name("_GPIO10")
     895                      .dwattr $C$DW$58, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x02)
     896                      .dwattr $C$DW$58, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     897                      .dwattr $C$DW$58, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:06 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0465610                           PAGE   18

     898              $C$DW$59        .dwtag  DW_TAG_member
     899                      .dwattr $C$DW$59, DW_AT_type(*$C$DW$T$19)
     900                      .dwattr $C$DW$59, DW_AT_name("GPIO11")
     901                      .dwattr $C$DW$59, DW_AT_TI_symbol_name("_GPIO11")
     902                      .dwattr $C$DW$59, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x02)
     903                      .dwattr $C$DW$59, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     904                      .dwattr $C$DW$59, DW_AT_accessibility(DW_ACCESS_public)
     905              $C$DW$60        .dwtag  DW_TAG_member
     906                      .dwattr $C$DW$60, DW_AT_type(*$C$DW$T$19)
     907                      .dwattr $C$DW$60, DW_AT_name("GPIO12")
     908                      .dwattr $C$DW$60, DW_AT_TI_symbol_name("_GPIO12")
     909                      .dwattr $C$DW$60, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x02)
     910                      .dwattr $C$DW$60, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     911                      .dwattr $C$DW$60, DW_AT_accessibility(DW_ACCESS_public)
     912              $C$DW$61        .dwtag  DW_TAG_member
     913                      .dwattr $C$DW$61, DW_AT_type(*$C$DW$T$19)
     914                      .dwattr $C$DW$61, DW_AT_name("GPIO13")
     915                      .dwattr $C$DW$61, DW_AT_TI_symbol_name("_GPIO13")
     916                      .dwattr $C$DW$61, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x02)
     917                      .dwattr $C$DW$61, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     918                      .dwattr $C$DW$61, DW_AT_accessibility(DW_ACCESS_public)
     919              $C$DW$62        .dwtag  DW_TAG_member
     920                      .dwattr $C$DW$62, DW_AT_type(*$C$DW$T$19)
     921                      .dwattr $C$DW$62, DW_AT_name("GPIO14")
     922                      .dwattr $C$DW$62, DW_AT_TI_symbol_name("_GPIO14")
     923                      .dwattr $C$DW$62, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x02)
     924                      .dwattr $C$DW$62, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     925                      .dwattr $C$DW$62, DW_AT_accessibility(DW_ACCESS_public)
     926              $C$DW$63        .dwtag  DW_TAG_member
     927                      .dwattr $C$DW$63, DW_AT_type(*$C$DW$T$19)
     928                      .dwattr $C$DW$63, DW_AT_name("GPIO15")
     929                      .dwattr $C$DW$63, DW_AT_TI_symbol_name("_GPIO15")
     930                      .dwattr $C$DW$63, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x02)
     931                      .dwattr $C$DW$63, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     932                      .dwattr $C$DW$63, DW_AT_accessibility(DW_ACCESS_public)
     933                      .dwendtag $C$DW$T$20
     934              
     935              
     936              $C$DW$T$22      .dwtag  DW_TAG_union_type
     937                      .dwattr $C$DW$T$22, DW_AT_name("GPA1_REG")
     938                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x02)
     939              $C$DW$64        .dwtag  DW_TAG_member
     940                      .dwattr $C$DW$64, DW_AT_type(*$C$DW$T$21)
     941                      .dwattr $C$DW$64, DW_AT_name("all")
     942                      .dwattr $C$DW$64, DW_AT_TI_symbol_name("_all")
     943                      .dwattr $C$DW$64, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     944                      .dwattr $C$DW$64, DW_AT_accessibility(DW_ACCESS_public)
     945              $C$DW$65        .dwtag  DW_TAG_member
     946                      .dwattr $C$DW$65, DW_AT_type(*$C$DW$T$20)
     947                      .dwattr $C$DW$65, DW_AT_name("bit")
     948                      .dwattr $C$DW$65, DW_AT_TI_symbol_name("_bit")
     949                      .dwattr $C$DW$65, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     950                      .dwattr $C$DW$65, DW_AT_accessibility(DW_ACCESS_public)
     951                      .dwendtag $C$DW$T$22
     952              
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:06 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0465610                           PAGE   19

     953              
     954              $C$DW$T$23      .dwtag  DW_TAG_structure_type
     955                      .dwattr $C$DW$T$23, DW_AT_name("GPA2_BITS")
     956                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x02)
     957              $C$DW$66        .dwtag  DW_TAG_member
     958                      .dwattr $C$DW$66, DW_AT_type(*$C$DW$T$19)
     959                      .dwattr $C$DW$66, DW_AT_name("GPIO16")
     960                      .dwattr $C$DW$66, DW_AT_TI_symbol_name("_GPIO16")
     961                      .dwattr $C$DW$66, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x02)
     962                      .dwattr $C$DW$66, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     963                      .dwattr $C$DW$66, DW_AT_accessibility(DW_ACCESS_public)
     964              $C$DW$67        .dwtag  DW_TAG_member
     965                      .dwattr $C$DW$67, DW_AT_type(*$C$DW$T$19)
     966                      .dwattr $C$DW$67, DW_AT_name("GPIO17")
     967                      .dwattr $C$DW$67, DW_AT_TI_symbol_name("_GPIO17")
     968                      .dwattr $C$DW$67, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x02)
     969                      .dwattr $C$DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     970                      .dwattr $C$DW$67, DW_AT_accessibility(DW_ACCESS_public)
     971              $C$DW$68        .dwtag  DW_TAG_member
     972                      .dwattr $C$DW$68, DW_AT_type(*$C$DW$T$19)
     973                      .dwattr $C$DW$68, DW_AT_name("GPIO18")
     974                      .dwattr $C$DW$68, DW_AT_TI_symbol_name("_GPIO18")
     975                      .dwattr $C$DW$68, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x02)
     976                      .dwattr $C$DW$68, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     977                      .dwattr $C$DW$68, DW_AT_accessibility(DW_ACCESS_public)
     978              $C$DW$69        .dwtag  DW_TAG_member
     979                      .dwattr $C$DW$69, DW_AT_type(*$C$DW$T$19)
     980                      .dwattr $C$DW$69, DW_AT_name("GPIO19")
     981                      .dwattr $C$DW$69, DW_AT_TI_symbol_name("_GPIO19")
     982                      .dwattr $C$DW$69, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x02)
     983                      .dwattr $C$DW$69, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     984                      .dwattr $C$DW$69, DW_AT_accessibility(DW_ACCESS_public)
     985              $C$DW$70        .dwtag  DW_TAG_member
     986                      .dwattr $C$DW$70, DW_AT_type(*$C$DW$T$19)
     987                      .dwattr $C$DW$70, DW_AT_name("GPIO20")
     988                      .dwattr $C$DW$70, DW_AT_TI_symbol_name("_GPIO20")
     989                      .dwattr $C$DW$70, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x02)
     990                      .dwattr $C$DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     991                      .dwattr $C$DW$70, DW_AT_accessibility(DW_ACCESS_public)
     992              $C$DW$71        .dwtag  DW_TAG_member
     993                      .dwattr $C$DW$71, DW_AT_type(*$C$DW$T$19)
     994                      .dwattr $C$DW$71, DW_AT_name("GPIO21")
     995                      .dwattr $C$DW$71, DW_AT_TI_symbol_name("_GPIO21")
     996                      .dwattr $C$DW$71, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x02)
     997                      .dwattr $C$DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     998                      .dwattr $C$DW$71, DW_AT_accessibility(DW_ACCESS_public)
     999              $C$DW$72        .dwtag  DW_TAG_member
    1000                      .dwattr $C$DW$72, DW_AT_type(*$C$DW$T$19)
    1001                      .dwattr $C$DW$72, DW_AT_name("GPIO22")
    1002                      .dwattr $C$DW$72, DW_AT_TI_symbol_name("_GPIO22")
    1003                      .dwattr $C$DW$72, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x02)
    1004                      .dwattr $C$DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1005                      .dwattr $C$DW$72, DW_AT_accessibility(DW_ACCESS_public)
    1006              $C$DW$73        .dwtag  DW_TAG_member
    1007                      .dwattr $C$DW$73, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:06 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0465610                           PAGE   20

    1008                      .dwattr $C$DW$73, DW_AT_name("GPIO23")
    1009                      .dwattr $C$DW$73, DW_AT_TI_symbol_name("_GPIO23")
    1010                      .dwattr $C$DW$73, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x02)
    1011                      .dwattr $C$DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1012                      .dwattr $C$DW$73, DW_AT_accessibility(DW_ACCESS_public)
    1013              $C$DW$74        .dwtag  DW_TAG_member
    1014                      .dwattr $C$DW$74, DW_AT_type(*$C$DW$T$19)
    1015                      .dwattr $C$DW$74, DW_AT_name("GPIO24")
    1016                      .dwattr $C$DW$74, DW_AT_TI_symbol_name("_GPIO24")
    1017                      .dwattr $C$DW$74, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x02)
    1018                      .dwattr $C$DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1019                      .dwattr $C$DW$74, DW_AT_accessibility(DW_ACCESS_public)
    1020              $C$DW$75        .dwtag  DW_TAG_member
    1021                      .dwattr $C$DW$75, DW_AT_type(*$C$DW$T$19)
    1022                      .dwattr $C$DW$75, DW_AT_name("GPIO25")
    1023                      .dwattr $C$DW$75, DW_AT_TI_symbol_name("_GPIO25")
    1024                      .dwattr $C$DW$75, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x02)
    1025                      .dwattr $C$DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1026                      .dwattr $C$DW$75, DW_AT_accessibility(DW_ACCESS_public)
    1027              $C$DW$76        .dwtag  DW_TAG_member
    1028                      .dwattr $C$DW$76, DW_AT_type(*$C$DW$T$19)
    1029                      .dwattr $C$DW$76, DW_AT_name("GPIO26")
    1030                      .dwattr $C$DW$76, DW_AT_TI_symbol_name("_GPIO26")
    1031                      .dwattr $C$DW$76, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x02)
    1032                      .dwattr $C$DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1033                      .dwattr $C$DW$76, DW_AT_accessibility(DW_ACCESS_public)
    1034              $C$DW$77        .dwtag  DW_TAG_member
    1035                      .dwattr $C$DW$77, DW_AT_type(*$C$DW$T$19)
    1036                      .dwattr $C$DW$77, DW_AT_name("GPIO27")
    1037                      .dwattr $C$DW$77, DW_AT_TI_symbol_name("_GPIO27")
    1038                      .dwattr $C$DW$77, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x02)
    1039                      .dwattr $C$DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1040                      .dwattr $C$DW$77, DW_AT_accessibility(DW_ACCESS_public)
    1041              $C$DW$78        .dwtag  DW_TAG_member
    1042                      .dwattr $C$DW$78, DW_AT_type(*$C$DW$T$19)
    1043                      .dwattr $C$DW$78, DW_AT_name("GPIO28")
    1044                      .dwattr $C$DW$78, DW_AT_TI_symbol_name("_GPIO28")
    1045                      .dwattr $C$DW$78, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x02)
    1046                      .dwattr $C$DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1047                      .dwattr $C$DW$78, DW_AT_accessibility(DW_ACCESS_public)
    1048              $C$DW$79        .dwtag  DW_TAG_member
    1049                      .dwattr $C$DW$79, DW_AT_type(*$C$DW$T$19)
    1050                      .dwattr $C$DW$79, DW_AT_name("GPIO29")
    1051                      .dwattr $C$DW$79, DW_AT_TI_symbol_name("_GPIO29")
    1052                      .dwattr $C$DW$79, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x02)
    1053                      .dwattr $C$DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1054                      .dwattr $C$DW$79, DW_AT_accessibility(DW_ACCESS_public)
    1055              $C$DW$80        .dwtag  DW_TAG_member
    1056                      .dwattr $C$DW$80, DW_AT_type(*$C$DW$T$19)
    1057                      .dwattr $C$DW$80, DW_AT_name("GPIO30")
    1058                      .dwattr $C$DW$80, DW_AT_TI_symbol_name("_GPIO30")
    1059                      .dwattr $C$DW$80, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x02)
    1060                      .dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1061                      .dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
    1062              $C$DW$81        .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:06 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0465610                           PAGE   21

    1063                      .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$19)
    1064                      .dwattr $C$DW$81, DW_AT_name("GPIO31")
    1065                      .dwattr $C$DW$81, DW_AT_TI_symbol_name("_GPIO31")
    1066                      .dwattr $C$DW$81, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x02)
    1067                      .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1068                      .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
    1069                      .dwendtag $C$DW$T$23
    1070              
    1071              
    1072              $C$DW$T$24      .dwtag  DW_TAG_union_type
    1073                      .dwattr $C$DW$T$24, DW_AT_name("GPA2_REG")
    1074                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x02)
    1075              $C$DW$82        .dwtag  DW_TAG_member
    1076                      .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$21)
    1077                      .dwattr $C$DW$82, DW_AT_name("all")
    1078                      .dwattr $C$DW$82, DW_AT_TI_symbol_name("_all")
    1079                      .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1080                      .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
    1081              $C$DW$83        .dwtag  DW_TAG_member
    1082                      .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$23)
    1083                      .dwattr $C$DW$83, DW_AT_name("bit")
    1084                      .dwattr $C$DW$83, DW_AT_TI_symbol_name("_bit")
    1085                      .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1086                      .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
    1087                      .dwendtag $C$DW$T$24
    1088              
    1089              
    1090              $C$DW$T$25      .dwtag  DW_TAG_structure_type
    1091                      .dwattr $C$DW$T$25, DW_AT_name("GPACTRL_BITS")
    1092                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x02)
    1093              $C$DW$84        .dwtag  DW_TAG_member
    1094                      .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$19)
    1095                      .dwattr $C$DW$84, DW_AT_name("QUALPRD0")
    1096                      .dwattr $C$DW$84, DW_AT_TI_symbol_name("_QUALPRD0")
    1097                      .dwattr $C$DW$84, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x08)
    1098                      .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1099                      .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
    1100              $C$DW$85        .dwtag  DW_TAG_member
    1101                      .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$19)
    1102                      .dwattr $C$DW$85, DW_AT_name("QUALPRD1")
    1103                      .dwattr $C$DW$85, DW_AT_TI_symbol_name("_QUALPRD1")
    1104                      .dwattr $C$DW$85, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x08)
    1105                      .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1106                      .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
    1107              $C$DW$86        .dwtag  DW_TAG_member
    1108                      .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$19)
    1109                      .dwattr $C$DW$86, DW_AT_name("QUALPRD2")
    1110                      .dwattr $C$DW$86, DW_AT_TI_symbol_name("_QUALPRD2")
    1111                      .dwattr $C$DW$86, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x08)
    1112                      .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1113                      .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
    1114              $C$DW$87        .dwtag  DW_TAG_member
    1115                      .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$19)
    1116                      .dwattr $C$DW$87, DW_AT_name("QUALPRD3")
    1117                      .dwattr $C$DW$87, DW_AT_TI_symbol_name("_QUALPRD3")
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:06 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0465610                           PAGE   22

    1118                      .dwattr $C$DW$87, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x08)
    1119                      .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1120                      .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
    1121                      .dwendtag $C$DW$T$25
    1122              
    1123              
    1124              $C$DW$T$26      .dwtag  DW_TAG_union_type
    1125                      .dwattr $C$DW$T$26, DW_AT_name("GPACTRL_REG")
    1126                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x02)
    1127              $C$DW$88        .dwtag  DW_TAG_member
    1128                      .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$21)
    1129                      .dwattr $C$DW$88, DW_AT_name("all")
    1130                      .dwattr $C$DW$88, DW_AT_TI_symbol_name("_all")
    1131                      .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1132                      .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
    1133              $C$DW$89        .dwtag  DW_TAG_member
    1134                      .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$25)
    1135                      .dwattr $C$DW$89, DW_AT_name("bit")
    1136                      .dwattr $C$DW$89, DW_AT_TI_symbol_name("_bit")
    1137                      .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1138                      .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
    1139                      .dwendtag $C$DW$T$26
    1140              
    1141              
    1142              $C$DW$T$27      .dwtag  DW_TAG_structure_type
    1143                      .dwattr $C$DW$T$27, DW_AT_name("GPADAT_BITS")
    1144                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x02)
    1145              $C$DW$90        .dwtag  DW_TAG_member
    1146                      .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$19)
    1147                      .dwattr $C$DW$90, DW_AT_name("GPIO0")
    1148                      .dwattr $C$DW$90, DW_AT_TI_symbol_name("_GPIO0")
    1149                      .dwattr $C$DW$90, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    1150                      .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1151                      .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
    1152              $C$DW$91        .dwtag  DW_TAG_member
    1153                      .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$19)
    1154                      .dwattr $C$DW$91, DW_AT_name("GPIO1")
    1155                      .dwattr $C$DW$91, DW_AT_TI_symbol_name("_GPIO1")
    1156                      .dwattr $C$DW$91, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    1157                      .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1158                      .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
    1159              $C$DW$92        .dwtag  DW_TAG_member
    1160                      .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$19)
    1161                      .dwattr $C$DW$92, DW_AT_name("GPIO2")
    1162                      .dwattr $C$DW$92, DW_AT_TI_symbol_name("_GPIO2")
    1163                      .dwattr $C$DW$92, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    1164                      .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1165                      .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
    1166              $C$DW$93        .dwtag  DW_TAG_member
    1167                      .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$19)
    1168                      .dwattr $C$DW$93, DW_AT_name("GPIO3")
    1169                      .dwattr $C$DW$93, DW_AT_TI_symbol_name("_GPIO3")
    1170                      .dwattr $C$DW$93, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    1171                      .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1172                      .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:06 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0465610                           PAGE   23

    1173              $C$DW$94        .dwtag  DW_TAG_member
    1174                      .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$19)
    1175                      .dwattr $C$DW$94, DW_AT_name("GPIO4")
    1176                      .dwattr $C$DW$94, DW_AT_TI_symbol_name("_GPIO4")
    1177                      .dwattr $C$DW$94, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    1178                      .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1179                      .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
    1180              $C$DW$95        .dwtag  DW_TAG_member
    1181                      .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$19)
    1182                      .dwattr $C$DW$95, DW_AT_name("GPIO5")
    1183                      .dwattr $C$DW$95, DW_AT_TI_symbol_name("_GPIO5")
    1184                      .dwattr $C$DW$95, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    1185                      .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1186                      .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
    1187              $C$DW$96        .dwtag  DW_TAG_member
    1188                      .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$19)
    1189                      .dwattr $C$DW$96, DW_AT_name("GPIO6")
    1190                      .dwattr $C$DW$96, DW_AT_TI_symbol_name("_GPIO6")
    1191                      .dwattr $C$DW$96, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    1192                      .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1193                      .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
    1194              $C$DW$97        .dwtag  DW_TAG_member
    1195                      .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$19)
    1196                      .dwattr $C$DW$97, DW_AT_name("GPIO7")
    1197                      .dwattr $C$DW$97, DW_AT_TI_symbol_name("_GPIO7")
    1198                      .dwattr $C$DW$97, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    1199                      .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1200                      .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
    1201              $C$DW$98        .dwtag  DW_TAG_member
    1202                      .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$19)
    1203                      .dwattr $C$DW$98, DW_AT_name("GPIO8")
    1204                      .dwattr $C$DW$98, DW_AT_TI_symbol_name("_GPIO8")
    1205                      .dwattr $C$DW$98, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
    1206                      .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1207                      .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
    1208              $C$DW$99        .dwtag  DW_TAG_member
    1209                      .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$19)
    1210                      .dwattr $C$DW$99, DW_AT_name("GPIO9")
    1211                      .dwattr $C$DW$99, DW_AT_TI_symbol_name("_GPIO9")
    1212                      .dwattr $C$DW$99, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    1213                      .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1214                      .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
    1215              $C$DW$100       .dwtag  DW_TAG_member
    1216                      .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$19)
    1217                      .dwattr $C$DW$100, DW_AT_name("GPIO10")
    1218                      .dwattr $C$DW$100, DW_AT_TI_symbol_name("_GPIO10")
    1219                      .dwattr $C$DW$100, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
    1220                      .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1221                      .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
    1222              $C$DW$101       .dwtag  DW_TAG_member
    1223                      .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$19)
    1224                      .dwattr $C$DW$101, DW_AT_name("GPIO11")
    1225                      .dwattr $C$DW$101, DW_AT_TI_symbol_name("_GPIO11")
    1226                      .dwattr $C$DW$101, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
    1227                      .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:06 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0465610                           PAGE   24

    1228                      .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
    1229              $C$DW$102       .dwtag  DW_TAG_member
    1230                      .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$19)
    1231                      .dwattr $C$DW$102, DW_AT_name("GPIO12")
    1232                      .dwattr $C$DW$102, DW_AT_TI_symbol_name("_GPIO12")
    1233                      .dwattr $C$DW$102, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
    1234                      .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1235                      .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
    1236              $C$DW$103       .dwtag  DW_TAG_member
    1237                      .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$19)
    1238                      .dwattr $C$DW$103, DW_AT_name("GPIO13")
    1239                      .dwattr $C$DW$103, DW_AT_TI_symbol_name("_GPIO13")
    1240                      .dwattr $C$DW$103, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
    1241                      .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1242                      .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
    1243              $C$DW$104       .dwtag  DW_TAG_member
    1244                      .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$19)
    1245                      .dwattr $C$DW$104, DW_AT_name("GPIO14")
    1246                      .dwattr $C$DW$104, DW_AT_TI_symbol_name("_GPIO14")
    1247                      .dwattr $C$DW$104, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
    1248                      .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1249                      .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
    1250              $C$DW$105       .dwtag  DW_TAG_member
    1251                      .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$19)
    1252                      .dwattr $C$DW$105, DW_AT_name("GPIO15")
    1253                      .dwattr $C$DW$105, DW_AT_TI_symbol_name("_GPIO15")
    1254                      .dwattr $C$DW$105, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    1255                      .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1256                      .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
    1257              $C$DW$106       .dwtag  DW_TAG_member
    1258                      .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$19)
    1259                      .dwattr $C$DW$106, DW_AT_name("GPIO16")
    1260                      .dwattr $C$DW$106, DW_AT_TI_symbol_name("_GPIO16")
    1261                      .dwattr $C$DW$106, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    1262                      .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1263                      .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    1264              $C$DW$107       .dwtag  DW_TAG_member
    1265                      .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$19)
    1266                      .dwattr $C$DW$107, DW_AT_name("GPIO17")
    1267                      .dwattr $C$DW$107, DW_AT_TI_symbol_name("_GPIO17")
    1268                      .dwattr $C$DW$107, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    1269                      .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1270                      .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
    1271              $C$DW$108       .dwtag  DW_TAG_member
    1272                      .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$19)
    1273                      .dwattr $C$DW$108, DW_AT_name("GPIO18")
    1274                      .dwattr $C$DW$108, DW_AT_TI_symbol_name("_GPIO18")
    1275                      .dwattr $C$DW$108, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    1276                      .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1277                      .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    1278              $C$DW$109       .dwtag  DW_TAG_member
    1279                      .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$19)
    1280                      .dwattr $C$DW$109, DW_AT_name("GPIO19")
    1281                      .dwattr $C$DW$109, DW_AT_TI_symbol_name("_GPIO19")
    1282                      .dwattr $C$DW$109, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:06 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0465610                           PAGE   25

    1283                      .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1284                      .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    1285              $C$DW$110       .dwtag  DW_TAG_member
    1286                      .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$19)
    1287                      .dwattr $C$DW$110, DW_AT_name("GPIO20")
    1288                      .dwattr $C$DW$110, DW_AT_TI_symbol_name("_GPIO20")
    1289                      .dwattr $C$DW$110, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    1290                      .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1291                      .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    1292              $C$DW$111       .dwtag  DW_TAG_member
    1293                      .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$19)
    1294                      .dwattr $C$DW$111, DW_AT_name("GPIO21")
    1295                      .dwattr $C$DW$111, DW_AT_TI_symbol_name("_GPIO21")
    1296                      .dwattr $C$DW$111, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    1297                      .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1298                      .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    1299              $C$DW$112       .dwtag  DW_TAG_member
    1300                      .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$19)
    1301                      .dwattr $C$DW$112, DW_AT_name("GPIO22")
    1302                      .dwattr $C$DW$112, DW_AT_TI_symbol_name("_GPIO22")
    1303                      .dwattr $C$DW$112, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    1304                      .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1305                      .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    1306              $C$DW$113       .dwtag  DW_TAG_member
    1307                      .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$19)
    1308                      .dwattr $C$DW$113, DW_AT_name("GPIO23")
    1309                      .dwattr $C$DW$113, DW_AT_TI_symbol_name("_GPIO23")
    1310                      .dwattr $C$DW$113, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    1311                      .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1312                      .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    1313              $C$DW$114       .dwtag  DW_TAG_member
    1314                      .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$19)
    1315                      .dwattr $C$DW$114, DW_AT_name("GPIO24")
    1316                      .dwattr $C$DW$114, DW_AT_TI_symbol_name("_GPIO24")
    1317                      .dwattr $C$DW$114, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
    1318                      .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1319                      .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    1320              $C$DW$115       .dwtag  DW_TAG_member
    1321                      .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$19)
    1322                      .dwattr $C$DW$115, DW_AT_name("GPIO25")
    1323                      .dwattr $C$DW$115, DW_AT_TI_symbol_name("_GPIO25")
    1324                      .dwattr $C$DW$115, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    1325                      .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1326                      .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    1327              $C$DW$116       .dwtag  DW_TAG_member
    1328                      .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$19)
    1329                      .dwattr $C$DW$116, DW_AT_name("GPIO26")
    1330                      .dwattr $C$DW$116, DW_AT_TI_symbol_name("_GPIO26")
    1331                      .dwattr $C$DW$116, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
    1332                      .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1333                      .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    1334              $C$DW$117       .dwtag  DW_TAG_member
    1335                      .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$19)
    1336                      .dwattr $C$DW$117, DW_AT_name("GPIO27")
    1337                      .dwattr $C$DW$117, DW_AT_TI_symbol_name("_GPIO27")
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:06 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0465610                           PAGE   26

    1338                      .dwattr $C$DW$117, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
    1339                      .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1340                      .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    1341              $C$DW$118       .dwtag  DW_TAG_member
    1342                      .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$19)
    1343                      .dwattr $C$DW$118, DW_AT_name("GPIO28")
    1344                      .dwattr $C$DW$118, DW_AT_TI_symbol_name("_GPIO28")
    1345                      .dwattr $C$DW$118, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
    1346                      .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1347                      .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    1348              $C$DW$119       .dwtag  DW_TAG_member
    1349                      .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$19)
    1350                      .dwattr $C$DW$119, DW_AT_name("GPIO29")
    1351                      .dwattr $C$DW$119, DW_AT_TI_symbol_name("_GPIO29")
    1352                      .dwattr $C$DW$119, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
    1353                      .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1354                      .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    1355              $C$DW$120       .dwtag  DW_TAG_member
    1356                      .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$19)
    1357                      .dwattr $C$DW$120, DW_AT_name("GPIO30")
    1358                      .dwattr $C$DW$120, DW_AT_TI_symbol_name("_GPIO30")
    1359                      .dwattr $C$DW$120, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
    1360                      .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1361                      .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    1362              $C$DW$121       .dwtag  DW_TAG_member
    1363                      .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$19)
    1364                      .dwattr $C$DW$121, DW_AT_name("GPIO31")
    1365                      .dwattr $C$DW$121, DW_AT_TI_symbol_name("_GPIO31")
    1366                      .dwattr $C$DW$121, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    1367                      .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1368                      .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    1369                      .dwendtag $C$DW$T$27
    1370              
    1371              
    1372              $C$DW$T$28      .dwtag  DW_TAG_union_type
    1373                      .dwattr $C$DW$T$28, DW_AT_name("GPADAT_REG")
    1374                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x02)
    1375              $C$DW$122       .dwtag  DW_TAG_member
    1376                      .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$21)
    1377                      .dwattr $C$DW$122, DW_AT_name("all")
    1378                      .dwattr $C$DW$122, DW_AT_TI_symbol_name("_all")
    1379                      .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1380                      .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    1381              $C$DW$123       .dwtag  DW_TAG_member
    1382                      .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$27)
    1383                      .dwattr $C$DW$123, DW_AT_name("bit")
    1384                      .dwattr $C$DW$123, DW_AT_TI_symbol_name("_bit")
    1385                      .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1386                      .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    1387                      .dwendtag $C$DW$T$28
    1388              
    1389              
    1390              $C$DW$T$29      .dwtag  DW_TAG_structure_type
    1391                      .dwattr $C$DW$T$29, DW_AT_name("GPB1_BITS")
    1392                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x02)
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:06 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0465610                           PAGE   27

    1393              $C$DW$124       .dwtag  DW_TAG_member
    1394                      .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$19)
    1395                      .dwattr $C$DW$124, DW_AT_name("GPIO32")
    1396                      .dwattr $C$DW$124, DW_AT_TI_symbol_name("_GPIO32")
    1397                      .dwattr $C$DW$124, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x02)
    1398                      .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1399                      .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    1400              $C$DW$125       .dwtag  DW_TAG_member
    1401                      .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$19)
    1402                      .dwattr $C$DW$125, DW_AT_name("GPIO33")
    1403                      .dwattr $C$DW$125, DW_AT_TI_symbol_name("_GPIO33")
    1404                      .dwattr $C$DW$125, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x02)
    1405                      .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1406                      .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    1407              $C$DW$126       .dwtag  DW_TAG_member
    1408                      .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$19)
    1409                      .dwattr $C$DW$126, DW_AT_name("GPIO34")
    1410                      .dwattr $C$DW$126, DW_AT_TI_symbol_name("_GPIO34")
    1411                      .dwattr $C$DW$126, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x02)
    1412                      .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1413                      .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    1414              $C$DW$127       .dwtag  DW_TAG_member
    1415                      .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$19)
    1416                      .dwattr $C$DW$127, DW_AT_name("GPIO35")
    1417                      .dwattr $C$DW$127, DW_AT_TI_symbol_name("_GPIO35")
    1418                      .dwattr $C$DW$127, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x02)
    1419                      .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1420                      .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    1421              $C$DW$128       .dwtag  DW_TAG_member
    1422                      .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$19)
    1423                      .dwattr $C$DW$128, DW_AT_name("GPIO36")
    1424                      .dwattr $C$DW$128, DW_AT_TI_symbol_name("_GPIO36")
    1425                      .dwattr $C$DW$128, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x02)
    1426                      .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1427                      .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    1428              $C$DW$129       .dwtag  DW_TAG_member
    1429                      .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$19)
    1430                      .dwattr $C$DW$129, DW_AT_name("GPIO37")
    1431                      .dwattr $C$DW$129, DW_AT_TI_symbol_name("_GPIO37")
    1432                      .dwattr $C$DW$129, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x02)
    1433                      .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1434                      .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    1435              $C$DW$130       .dwtag  DW_TAG_member
    1436                      .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$19)
    1437                      .dwattr $C$DW$130, DW_AT_name("GPIO38")
    1438                      .dwattr $C$DW$130, DW_AT_TI_symbol_name("_GPIO38")
    1439                      .dwattr $C$DW$130, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x02)
    1440                      .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1441                      .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    1442              $C$DW$131       .dwtag  DW_TAG_member
    1443                      .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$19)
    1444                      .dwattr $C$DW$131, DW_AT_name("GPIO39")
    1445                      .dwattr $C$DW$131, DW_AT_TI_symbol_name("_GPIO39")
    1446                      .dwattr $C$DW$131, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x02)
    1447                      .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:06 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0465610                           PAGE   28

    1448                      .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    1449              $C$DW$132       .dwtag  DW_TAG_member
    1450                      .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$19)
    1451                      .dwattr $C$DW$132, DW_AT_name("GPIO40")
    1452                      .dwattr $C$DW$132, DW_AT_TI_symbol_name("_GPIO40")
    1453                      .dwattr $C$DW$132, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x02)
    1454                      .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1455                      .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    1456              $C$DW$133       .dwtag  DW_TAG_member
    1457                      .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$19)
    1458                      .dwattr $C$DW$133, DW_AT_name("GPIO41")
    1459                      .dwattr $C$DW$133, DW_AT_TI_symbol_name("_GPIO41")
    1460                      .dwattr $C$DW$133, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x02)
    1461                      .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1462                      .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    1463              $C$DW$134       .dwtag  DW_TAG_member
    1464                      .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$19)
    1465                      .dwattr $C$DW$134, DW_AT_name("GPIO42")
    1466                      .dwattr $C$DW$134, DW_AT_TI_symbol_name("_GPIO42")
    1467                      .dwattr $C$DW$134, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x02)
    1468                      .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1469                      .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    1470              $C$DW$135       .dwtag  DW_TAG_member
    1471                      .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$19)
    1472                      .dwattr $C$DW$135, DW_AT_name("GPIO43")
    1473                      .dwattr $C$DW$135, DW_AT_TI_symbol_name("_GPIO43")
    1474                      .dwattr $C$DW$135, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x02)
    1475                      .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1476                      .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    1477              $C$DW$136       .dwtag  DW_TAG_member
    1478                      .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$19)
    1479                      .dwattr $C$DW$136, DW_AT_name("GPIO44")
    1480                      .dwattr $C$DW$136, DW_AT_TI_symbol_name("_GPIO44")
    1481                      .dwattr $C$DW$136, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x02)
    1482                      .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1483                      .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    1484              $C$DW$137       .dwtag  DW_TAG_member
    1485                      .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$19)
    1486                      .dwattr $C$DW$137, DW_AT_name("GPIO45")
    1487                      .dwattr $C$DW$137, DW_AT_TI_symbol_name("_GPIO45")
    1488                      .dwattr $C$DW$137, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x02)
    1489                      .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1490                      .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    1491              $C$DW$138       .dwtag  DW_TAG_member
    1492                      .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$19)
    1493                      .dwattr $C$DW$138, DW_AT_name("GPIO46")
    1494                      .dwattr $C$DW$138, DW_AT_TI_symbol_name("_GPIO46")
    1495                      .dwattr $C$DW$138, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x02)
    1496                      .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1497                      .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    1498              $C$DW$139       .dwtag  DW_TAG_member
    1499                      .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$19)
    1500                      .dwattr $C$DW$139, DW_AT_name("GPIO47")
    1501                      .dwattr $C$DW$139, DW_AT_TI_symbol_name("_GPIO47")
    1502                      .dwattr $C$DW$139, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x02)
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:06 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0465610                           PAGE   29

    1503                      .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1504                      .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    1505                      .dwendtag $C$DW$T$29
    1506              
    1507              
    1508              $C$DW$T$30      .dwtag  DW_TAG_union_type
    1509                      .dwattr $C$DW$T$30, DW_AT_name("GPB1_REG")
    1510                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x02)
    1511              $C$DW$140       .dwtag  DW_TAG_member
    1512                      .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$21)
    1513                      .dwattr $C$DW$140, DW_AT_name("all")
    1514                      .dwattr $C$DW$140, DW_AT_TI_symbol_name("_all")
    1515                      .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1516                      .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    1517              $C$DW$141       .dwtag  DW_TAG_member
    1518                      .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$29)
    1519                      .dwattr $C$DW$141, DW_AT_name("bit")
    1520                      .dwattr $C$DW$141, DW_AT_TI_symbol_name("_bit")
    1521                      .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1522                      .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    1523                      .dwendtag $C$DW$T$30
    1524              
    1525              
    1526              $C$DW$T$31      .dwtag  DW_TAG_structure_type
    1527                      .dwattr $C$DW$T$31, DW_AT_name("GPB2_BITS")
    1528                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x02)
    1529              $C$DW$142       .dwtag  DW_TAG_member
    1530                      .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$19)
    1531                      .dwattr $C$DW$142, DW_AT_name("GPIO48")
    1532                      .dwattr $C$DW$142, DW_AT_TI_symbol_name("_GPIO48")
    1533                      .dwattr $C$DW$142, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x02)
    1534                      .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1535                      .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    1536              $C$DW$143       .dwtag  DW_TAG_member
    1537                      .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$19)
    1538                      .dwattr $C$DW$143, DW_AT_name("GPIO49")
    1539                      .dwattr $C$DW$143, DW_AT_TI_symbol_name("_GPIO49")
    1540                      .dwattr $C$DW$143, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x02)
    1541                      .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1542                      .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    1543              $C$DW$144       .dwtag  DW_TAG_member
    1544                      .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$19)
    1545                      .dwattr $C$DW$144, DW_AT_name("GPIO50")
    1546                      .dwattr $C$DW$144, DW_AT_TI_symbol_name("_GPIO50")
    1547                      .dwattr $C$DW$144, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x02)
    1548                      .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1549                      .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    1550              $C$DW$145       .dwtag  DW_TAG_member
    1551                      .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$19)
    1552                      .dwattr $C$DW$145, DW_AT_name("GPIO51")
    1553                      .dwattr $C$DW$145, DW_AT_TI_symbol_name("_GPIO51")
    1554                      .dwattr $C$DW$145, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x02)
    1555                      .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1556                      .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    1557              $C$DW$146       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:06 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0465610                           PAGE   30

    1558                      .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$19)
    1559                      .dwattr $C$DW$146, DW_AT_name("GPIO52")
    1560                      .dwattr $C$DW$146, DW_AT_TI_symbol_name("_GPIO52")
    1561                      .dwattr $C$DW$146, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x02)
    1562                      .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1563                      .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
    1564              $C$DW$147       .dwtag  DW_TAG_member
    1565                      .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$19)
    1566                      .dwattr $C$DW$147, DW_AT_name("GPIO53")
    1567                      .dwattr $C$DW$147, DW_AT_TI_symbol_name("_GPIO53")
    1568                      .dwattr $C$DW$147, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x02)
    1569                      .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1570                      .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
    1571              $C$DW$148       .dwtag  DW_TAG_member
    1572                      .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$19)
    1573                      .dwattr $C$DW$148, DW_AT_name("GPIO54")
    1574                      .dwattr $C$DW$148, DW_AT_TI_symbol_name("_GPIO54")
    1575                      .dwattr $C$DW$148, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x02)
    1576                      .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1577                      .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    1578              $C$DW$149       .dwtag  DW_TAG_member
    1579                      .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$19)
    1580                      .dwattr $C$DW$149, DW_AT_name("GPIO55")
    1581                      .dwattr $C$DW$149, DW_AT_TI_symbol_name("_GPIO55")
    1582                      .dwattr $C$DW$149, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x02)
    1583                      .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1584                      .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    1585              $C$DW$150       .dwtag  DW_TAG_member
    1586                      .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$19)
    1587                      .dwattr $C$DW$150, DW_AT_name("GPIO56")
    1588                      .dwattr $C$DW$150, DW_AT_TI_symbol_name("_GPIO56")
    1589                      .dwattr $C$DW$150, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x02)
    1590                      .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1591                      .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
    1592              $C$DW$151       .dwtag  DW_TAG_member
    1593                      .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$19)
    1594                      .dwattr $C$DW$151, DW_AT_name("GPIO57")
    1595                      .dwattr $C$DW$151, DW_AT_TI_symbol_name("_GPIO57")
    1596                      .dwattr $C$DW$151, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x02)
    1597                      .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1598                      .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    1599              $C$DW$152       .dwtag  DW_TAG_member
    1600                      .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$19)
    1601                      .dwattr $C$DW$152, DW_AT_name("GPIO58")
    1602                      .dwattr $C$DW$152, DW_AT_TI_symbol_name("_GPIO58")
    1603                      .dwattr $C$DW$152, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x02)
    1604                      .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1605                      .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    1606              $C$DW$153       .dwtag  DW_TAG_member
    1607                      .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$19)
    1608                      .dwattr $C$DW$153, DW_AT_name("GPIO59")
    1609                      .dwattr $C$DW$153, DW_AT_TI_symbol_name("_GPIO59")
    1610                      .dwattr $C$DW$153, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x02)
    1611                      .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1612                      .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:06 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0465610                           PAGE   31

    1613              $C$DW$154       .dwtag  DW_TAG_member
    1614                      .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$19)
    1615                      .dwattr $C$DW$154, DW_AT_name("GPIO60")
    1616                      .dwattr $C$DW$154, DW_AT_TI_symbol_name("_GPIO60")
    1617                      .dwattr $C$DW$154, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x02)
    1618                      .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1619                      .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
    1620              $C$DW$155       .dwtag  DW_TAG_member
    1621                      .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$19)
    1622                      .dwattr $C$DW$155, DW_AT_name("GPIO61")
    1623                      .dwattr $C$DW$155, DW_AT_TI_symbol_name("_GPIO61")
    1624                      .dwattr $C$DW$155, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x02)
    1625                      .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1626                      .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
    1627              $C$DW$156       .dwtag  DW_TAG_member
    1628                      .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$19)
    1629                      .dwattr $C$DW$156, DW_AT_name("GPIO62")
    1630                      .dwattr $C$DW$156, DW_AT_TI_symbol_name("_GPIO62")
    1631                      .dwattr $C$DW$156, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x02)
    1632                      .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1633                      .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    1634              $C$DW$157       .dwtag  DW_TAG_member
    1635                      .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$19)
    1636                      .dwattr $C$DW$157, DW_AT_name("GPIO63")
    1637                      .dwattr $C$DW$157, DW_AT_TI_symbol_name("_GPIO63")
    1638                      .dwattr $C$DW$157, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x02)
    1639                      .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1640                      .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    1641                      .dwendtag $C$DW$T$31
    1642              
    1643              
    1644              $C$DW$T$32      .dwtag  DW_TAG_union_type
    1645                      .dwattr $C$DW$T$32, DW_AT_name("GPB2_REG")
    1646                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x02)
    1647              $C$DW$158       .dwtag  DW_TAG_member
    1648                      .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$21)
    1649                      .dwattr $C$DW$158, DW_AT_name("all")
    1650                      .dwattr $C$DW$158, DW_AT_TI_symbol_name("_all")
    1651                      .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1652                      .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    1653              $C$DW$159       .dwtag  DW_TAG_member
    1654                      .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$31)
    1655                      .dwattr $C$DW$159, DW_AT_name("bit")
    1656                      .dwattr $C$DW$159, DW_AT_TI_symbol_name("_bit")
    1657                      .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1658                      .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    1659                      .dwendtag $C$DW$T$32
    1660              
    1661              
    1662              $C$DW$T$33      .dwtag  DW_TAG_structure_type
    1663                      .dwattr $C$DW$T$33, DW_AT_name("GPBCTRL_BITS")
    1664                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x02)
    1665              $C$DW$160       .dwtag  DW_TAG_member
    1666                      .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$19)
    1667                      .dwattr $C$DW$160, DW_AT_name("QUALPRD0")
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:06 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0465610                           PAGE   32

    1668                      .dwattr $C$DW$160, DW_AT_TI_symbol_name("_QUALPRD0")
    1669                      .dwattr $C$DW$160, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x08)
    1670                      .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1671                      .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    1672              $C$DW$161       .dwtag  DW_TAG_member
    1673                      .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$19)
    1674                      .dwattr $C$DW$161, DW_AT_name("QUALPRD1")
    1675                      .dwattr $C$DW$161, DW_AT_TI_symbol_name("_QUALPRD1")
    1676                      .dwattr $C$DW$161, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x08)
    1677                      .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1678                      .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    1679              $C$DW$162       .dwtag  DW_TAG_member
    1680                      .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$19)
    1681                      .dwattr $C$DW$162, DW_AT_name("QUALPRD2")
    1682                      .dwattr $C$DW$162, DW_AT_TI_symbol_name("_QUALPRD2")
    1683                      .dwattr $C$DW$162, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x08)
    1684                      .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1685                      .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    1686              $C$DW$163       .dwtag  DW_TAG_member
    1687                      .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$19)
    1688                      .dwattr $C$DW$163, DW_AT_name("QUALPRD3")
    1689                      .dwattr $C$DW$163, DW_AT_TI_symbol_name("_QUALPRD3")
    1690                      .dwattr $C$DW$163, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x08)
    1691                      .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1692                      .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    1693                      .dwendtag $C$DW$T$33
    1694              
    1695              
    1696              $C$DW$T$34      .dwtag  DW_TAG_union_type
    1697                      .dwattr $C$DW$T$34, DW_AT_name("GPBCTRL_REG")
    1698                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x02)
    1699              $C$DW$164       .dwtag  DW_TAG_member
    1700                      .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$21)
    1701                      .dwattr $C$DW$164, DW_AT_name("all")
    1702                      .dwattr $C$DW$164, DW_AT_TI_symbol_name("_all")
    1703                      .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1704                      .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    1705              $C$DW$165       .dwtag  DW_TAG_member
    1706                      .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$33)
    1707                      .dwattr $C$DW$165, DW_AT_name("bit")
    1708                      .dwattr $C$DW$165, DW_AT_TI_symbol_name("_bit")
    1709                      .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1710                      .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    1711                      .dwendtag $C$DW$T$34
    1712              
    1713              
    1714              $C$DW$T$35      .dwtag  DW_TAG_structure_type
    1715                      .dwattr $C$DW$T$35, DW_AT_name("GPBDAT_BITS")
    1716                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x02)
    1717              $C$DW$166       .dwtag  DW_TAG_member
    1718                      .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$19)
    1719                      .dwattr $C$DW$166, DW_AT_name("GPIO32")
    1720                      .dwattr $C$DW$166, DW_AT_TI_symbol_name("_GPIO32")
    1721                      .dwattr $C$DW$166, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    1722                      .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:06 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0465610                           PAGE   33

    1723                      .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    1724              $C$DW$167       .dwtag  DW_TAG_member
    1725                      .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$19)
    1726                      .dwattr $C$DW$167, DW_AT_name("GPIO33")
    1727                      .dwattr $C$DW$167, DW_AT_TI_symbol_name("_GPIO33")
    1728                      .dwattr $C$DW$167, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    1729                      .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1730                      .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    1731              $C$DW$168       .dwtag  DW_TAG_member
    1732                      .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$19)
    1733                      .dwattr $C$DW$168, DW_AT_name("GPIO34")
    1734                      .dwattr $C$DW$168, DW_AT_TI_symbol_name("_GPIO34")
    1735                      .dwattr $C$DW$168, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    1736                      .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1737                      .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    1738              $C$DW$169       .dwtag  DW_TAG_member
    1739                      .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$19)
    1740                      .dwattr $C$DW$169, DW_AT_name("GPIO35")
    1741                      .dwattr $C$DW$169, DW_AT_TI_symbol_name("_GPIO35")
    1742                      .dwattr $C$DW$169, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    1743                      .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1744                      .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    1745              $C$DW$170       .dwtag  DW_TAG_member
    1746                      .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$19)
    1747                      .dwattr $C$DW$170, DW_AT_name("GPIO36")
    1748                      .dwattr $C$DW$170, DW_AT_TI_symbol_name("_GPIO36")
    1749                      .dwattr $C$DW$170, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    1750                      .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1751                      .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    1752              $C$DW$171       .dwtag  DW_TAG_member
    1753                      .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$19)
    1754                      .dwattr $C$DW$171, DW_AT_name("GPIO37")
    1755                      .dwattr $C$DW$171, DW_AT_TI_symbol_name("_GPIO37")
    1756                      .dwattr $C$DW$171, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    1757                      .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1758                      .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    1759              $C$DW$172       .dwtag  DW_TAG_member
    1760                      .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$19)
    1761                      .dwattr $C$DW$172, DW_AT_name("GPIO38")
    1762                      .dwattr $C$DW$172, DW_AT_TI_symbol_name("_GPIO38")
    1763                      .dwattr $C$DW$172, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    1764                      .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1765                      .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    1766              $C$DW$173       .dwtag  DW_TAG_member
    1767                      .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$19)
    1768                      .dwattr $C$DW$173, DW_AT_name("GPIO39")
    1769                      .dwattr $C$DW$173, DW_AT_TI_symbol_name("_GPIO39")
    1770                      .dwattr $C$DW$173, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    1771                      .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1772                      .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
    1773              $C$DW$174       .dwtag  DW_TAG_member
    1774                      .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$19)
    1775                      .dwattr $C$DW$174, DW_AT_name("GPIO40")
    1776                      .dwattr $C$DW$174, DW_AT_TI_symbol_name("_GPIO40")
    1777                      .dwattr $C$DW$174, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:06 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0465610                           PAGE   34

    1778                      .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1779                      .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
    1780              $C$DW$175       .dwtag  DW_TAG_member
    1781                      .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$19)
    1782                      .dwattr $C$DW$175, DW_AT_name("GPIO41")
    1783                      .dwattr $C$DW$175, DW_AT_TI_symbol_name("_GPIO41")
    1784                      .dwattr $C$DW$175, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    1785                      .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1786                      .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
    1787              $C$DW$176       .dwtag  DW_TAG_member
    1788                      .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$19)
    1789                      .dwattr $C$DW$176, DW_AT_name("GPIO42")
    1790                      .dwattr $C$DW$176, DW_AT_TI_symbol_name("_GPIO42")
    1791                      .dwattr $C$DW$176, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
    1792                      .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1793                      .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
    1794              $C$DW$177       .dwtag  DW_TAG_member
    1795                      .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$19)
    1796                      .dwattr $C$DW$177, DW_AT_name("GPIO43")
    1797                      .dwattr $C$DW$177, DW_AT_TI_symbol_name("_GPIO43")
    1798                      .dwattr $C$DW$177, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
    1799                      .dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1800                      .dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
    1801              $C$DW$178       .dwtag  DW_TAG_member
    1802                      .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$19)
    1803                      .dwattr $C$DW$178, DW_AT_name("GPIO44")
    1804                      .dwattr $C$DW$178, DW_AT_TI_symbol_name("_GPIO44")
    1805                      .dwattr $C$DW$178, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
    1806                      .dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1807                      .dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
    1808              $C$DW$179       .dwtag  DW_TAG_member
    1809                      .dwattr $C$DW$179, DW_AT_type(*$C$DW$T$19)
    1810                      .dwattr $C$DW$179, DW_AT_name("GPIO45")
    1811                      .dwattr $C$DW$179, DW_AT_TI_symbol_name("_GPIO45")
    1812                      .dwattr $C$DW$179, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
    1813                      .dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1814                      .dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
    1815              $C$DW$180       .dwtag  DW_TAG_member
    1816                      .dwattr $C$DW$180, DW_AT_type(*$C$DW$T$19)
    1817                      .dwattr $C$DW$180, DW_AT_name("GPIO46")
    1818                      .dwattr $C$DW$180, DW_AT_TI_symbol_name("_GPIO46")
    1819                      .dwattr $C$DW$180, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
    1820                      .dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1821                      .dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
    1822              $C$DW$181       .dwtag  DW_TAG_member
    1823                      .dwattr $C$DW$181, DW_AT_type(*$C$DW$T$19)
    1824                      .dwattr $C$DW$181, DW_AT_name("GPIO47")
    1825                      .dwattr $C$DW$181, DW_AT_TI_symbol_name("_GPIO47")
    1826                      .dwattr $C$DW$181, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    1827                      .dwattr $C$DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1828                      .dwattr $C$DW$181, DW_AT_accessibility(DW_ACCESS_public)
    1829              $C$DW$182       .dwtag  DW_TAG_member
    1830                      .dwattr $C$DW$182, DW_AT_type(*$C$DW$T$19)
    1831                      .dwattr $C$DW$182, DW_AT_name("GPIO48")
    1832                      .dwattr $C$DW$182, DW_AT_TI_symbol_name("_GPIO48")
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:06 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0465610                           PAGE   35

    1833                      .dwattr $C$DW$182, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    1834                      .dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1835                      .dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)
    1836              $C$DW$183       .dwtag  DW_TAG_member
    1837                      .dwattr $C$DW$183, DW_AT_type(*$C$DW$T$19)
    1838                      .dwattr $C$DW$183, DW_AT_name("GPIO49")
    1839                      .dwattr $C$DW$183, DW_AT_TI_symbol_name("_GPIO49")
    1840                      .dwattr $C$DW$183, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    1841                      .dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1842                      .dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
    1843              $C$DW$184       .dwtag  DW_TAG_member
    1844                      .dwattr $C$DW$184, DW_AT_type(*$C$DW$T$19)
    1845                      .dwattr $C$DW$184, DW_AT_name("GPIO50")
    1846                      .dwattr $C$DW$184, DW_AT_TI_symbol_name("_GPIO50")
    1847                      .dwattr $C$DW$184, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    1848                      .dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1849                      .dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
    1850              $C$DW$185       .dwtag  DW_TAG_member
    1851                      .dwattr $C$DW$185, DW_AT_type(*$C$DW$T$19)
    1852                      .dwattr $C$DW$185, DW_AT_name("GPIO51")
    1853                      .dwattr $C$DW$185, DW_AT_TI_symbol_name("_GPIO51")
    1854                      .dwattr $C$DW$185, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    1855                      .dwattr $C$DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1856                      .dwattr $C$DW$185, DW_AT_accessibility(DW_ACCESS_public)
    1857              $C$DW$186       .dwtag  DW_TAG_member
    1858                      .dwattr $C$DW$186, DW_AT_type(*$C$DW$T$19)
    1859                      .dwattr $C$DW$186, DW_AT_name("GPIO52")
    1860                      .dwattr $C$DW$186, DW_AT_TI_symbol_name("_GPIO52")
    1861                      .dwattr $C$DW$186, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    1862                      .dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1863                      .dwattr $C$DW$186, DW_AT_accessibility(DW_ACCESS_public)
    1864              $C$DW$187       .dwtag  DW_TAG_member
    1865                      .dwattr $C$DW$187, DW_AT_type(*$C$DW$T$19)
    1866                      .dwattr $C$DW$187, DW_AT_name("GPIO53")
    1867                      .dwattr $C$DW$187, DW_AT_TI_symbol_name("_GPIO53")
    1868                      .dwattr $C$DW$187, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    1869                      .dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1870                      .dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)
    1871              $C$DW$188       .dwtag  DW_TAG_member
    1872                      .dwattr $C$DW$188, DW_AT_type(*$C$DW$T$19)
    1873                      .dwattr $C$DW$188, DW_AT_name("GPIO54")
    1874                      .dwattr $C$DW$188, DW_AT_TI_symbol_name("_GPIO54")
    1875                      .dwattr $C$DW$188, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    1876                      .dwattr $C$DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1877                      .dwattr $C$DW$188, DW_AT_accessibility(DW_ACCESS_public)
    1878              $C$DW$189       .dwtag  DW_TAG_member
    1879                      .dwattr $C$DW$189, DW_AT_type(*$C$DW$T$19)
    1880                      .dwattr $C$DW$189, DW_AT_name("GPIO55")
    1881                      .dwattr $C$DW$189, DW_AT_TI_symbol_name("_GPIO55")
    1882                      .dwattr $C$DW$189, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    1883                      .dwattr $C$DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1884                      .dwattr $C$DW$189, DW_AT_accessibility(DW_ACCESS_public)
    1885              $C$DW$190       .dwtag  DW_TAG_member
    1886                      .dwattr $C$DW$190, DW_AT_type(*$C$DW$T$19)
    1887                      .dwattr $C$DW$190, DW_AT_name("GPIO56")
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:06 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0465610                           PAGE   36

    1888                      .dwattr $C$DW$190, DW_AT_TI_symbol_name("_GPIO56")
    1889                      .dwattr $C$DW$190, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
    1890                      .dwattr $C$DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1891                      .dwattr $C$DW$190, DW_AT_accessibility(DW_ACCESS_public)
    1892              $C$DW$191       .dwtag  DW_TAG_member
    1893                      .dwattr $C$DW$191, DW_AT_type(*$C$DW$T$19)
    1894                      .dwattr $C$DW$191, DW_AT_name("GPIO57")
    1895                      .dwattr $C$DW$191, DW_AT_TI_symbol_name("_GPIO57")
    1896                      .dwattr $C$DW$191, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    1897                      .dwattr $C$DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1898                      .dwattr $C$DW$191, DW_AT_accessibility(DW_ACCESS_public)
    1899              $C$DW$192       .dwtag  DW_TAG_member
    1900                      .dwattr $C$DW$192, DW_AT_type(*$C$DW$T$19)
    1901                      .dwattr $C$DW$192, DW_AT_name("GPIO58")
    1902                      .dwattr $C$DW$192, DW_AT_TI_symbol_name("_GPIO58")
    1903                      .dwattr $C$DW$192, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
    1904                      .dwattr $C$DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1905                      .dwattr $C$DW$192, DW_AT_accessibility(DW_ACCESS_public)
    1906              $C$DW$193       .dwtag  DW_TAG_member
    1907                      .dwattr $C$DW$193, DW_AT_type(*$C$DW$T$19)
    1908                      .dwattr $C$DW$193, DW_AT_name("GPIO59")
    1909                      .dwattr $C$DW$193, DW_AT_TI_symbol_name("_GPIO59")
    1910                      .dwattr $C$DW$193, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
    1911                      .dwattr $C$DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1912                      .dwattr $C$DW$193, DW_AT_accessibility(DW_ACCESS_public)
    1913              $C$DW$194       .dwtag  DW_TAG_member
    1914                      .dwattr $C$DW$194, DW_AT_type(*$C$DW$T$19)
    1915                      .dwattr $C$DW$194, DW_AT_name("GPIO60")
    1916                      .dwattr $C$DW$194, DW_AT_TI_symbol_name("_GPIO60")
    1917                      .dwattr $C$DW$194, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
    1918                      .dwattr $C$DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1919                      .dwattr $C$DW$194, DW_AT_accessibility(DW_ACCESS_public)
    1920              $C$DW$195       .dwtag  DW_TAG_member
    1921                      .dwattr $C$DW$195, DW_AT_type(*$C$DW$T$19)
    1922                      .dwattr $C$DW$195, DW_AT_name("GPIO61")
    1923                      .dwattr $C$DW$195, DW_AT_TI_symbol_name("_GPIO61")
    1924                      .dwattr $C$DW$195, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
    1925                      .dwattr $C$DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1926                      .dwattr $C$DW$195, DW_AT_accessibility(DW_ACCESS_public)
    1927              $C$DW$196       .dwtag  DW_TAG_member
    1928                      .dwattr $C$DW$196, DW_AT_type(*$C$DW$T$19)
    1929                      .dwattr $C$DW$196, DW_AT_name("GPIO62")
    1930                      .dwattr $C$DW$196, DW_AT_TI_symbol_name("_GPIO62")
    1931                      .dwattr $C$DW$196, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
    1932                      .dwattr $C$DW$196, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1933                      .dwattr $C$DW$196, DW_AT_accessibility(DW_ACCESS_public)
    1934              $C$DW$197       .dwtag  DW_TAG_member
    1935                      .dwattr $C$DW$197, DW_AT_type(*$C$DW$T$19)
    1936                      .dwattr $C$DW$197, DW_AT_name("GPIO63")
    1937                      .dwattr $C$DW$197, DW_AT_TI_symbol_name("_GPIO63")
    1938                      .dwattr $C$DW$197, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    1939                      .dwattr $C$DW$197, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1940                      .dwattr $C$DW$197, DW_AT_accessibility(DW_ACCESS_public)
    1941                      .dwendtag $C$DW$T$35
    1942              
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:06 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0465610                           PAGE   37

    1943              
    1944              $C$DW$T$36      .dwtag  DW_TAG_union_type
    1945                      .dwattr $C$DW$T$36, DW_AT_name("GPBDAT_REG")
    1946                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x02)
    1947              $C$DW$198       .dwtag  DW_TAG_member
    1948                      .dwattr $C$DW$198, DW_AT_type(*$C$DW$T$21)
    1949                      .dwattr $C$DW$198, DW_AT_name("all")
    1950                      .dwattr $C$DW$198, DW_AT_TI_symbol_name("_all")
    1951                      .dwattr $C$DW$198, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1952                      .dwattr $C$DW$198, DW_AT_accessibility(DW_ACCESS_public)
    1953              $C$DW$199       .dwtag  DW_TAG_member
    1954                      .dwattr $C$DW$199, DW_AT_type(*$C$DW$T$35)
    1955                      .dwattr $C$DW$199, DW_AT_name("bit")
    1956                      .dwattr $C$DW$199, DW_AT_TI_symbol_name("_bit")
    1957                      .dwattr $C$DW$199, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1958                      .dwattr $C$DW$199, DW_AT_accessibility(DW_ACCESS_public)
    1959                      .dwendtag $C$DW$T$36
    1960              
    1961              
    1962              $C$DW$T$37      .dwtag  DW_TAG_structure_type
    1963                      .dwattr $C$DW$T$37, DW_AT_name("GPC1_BITS")
