TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:12 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0612810                           PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v6.2.7 *
       3              ;* Date/Time created: Thu Jul 02 08:31:12 2015                 *
       4              ;***************************************************************
       5                      .compiler_opts --diag_wrap=off --float_support=fpu32 --hll_source=on --mem_model:code=flat --mem_mode
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("../UART/cntrlUART.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v6.2.7 Copyright (c) 1996-2014 Texas I
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("D:\ActiveProject\EKT5\PKMT_NONBIOS\InvertorCntrl\ISPprg")
      13              
      14              $C$DW$1 .dwtag  DW_TAG_subprogram, DW_AT_name("initUartBufer")
      15                      .dwattr $C$DW$1, DW_AT_TI_symbol_name("_initUartBufer")
      16                      .dwattr $C$DW$1, DW_AT_declaration

         000000b6 0000 
    1300 000000b7 1A0B!         OR        @_SciaRegs+11,#0x0020 ; [CPU_] |395| 
         000000b8 0020 
    1301                      .dwpsn  file "../UART/cntrlUART.c",line 400,column 1,is_stmt
    1302              $C$DW$63        .dwtag  DW_TAG_TI_branch
    1303                      .dwattr $C$DW$63, DW_AT_low_pc(0x00)
    1304                      .dwattr $C$DW$63, DW_AT_TI_return
    1305 000000b9 0006          LRETR     ; [CPU_] 
    1306                      ; return occurs ; [] 
    1307                      .dwattr $C$DW$62, DW_AT_TI_end_file("../UART/cntrlUART.c")
    1308                      .dwattr $C$DW$62, DW_AT_TI_end_line(0x190)
    1309                      .dwattr $C$DW$62, DW_AT_TI_end_column(0x01)
    1310                      .dwendentry
    1311                      .dwendtag $C$DW$62
    1312              
    1313 000000ba               .sect   ".text"
    1314                      .clink
    1315                      .global _disableSciRcInt
    1316              
    1317              $C$DW$64        .dwtag  DW_TAG_subprogram, DW_AT_name("disableSciRcInt")
    1318                      .dwattr $C$DW$64, DW_AT_low_pc(_disableSciRcInt)
    1319                      .dwattr $C$DW$64, DW_AT_high_pc(0x00)
    1320                      .dwattr $C$DW$64, DW_AT_TI_symbol_name("_disableSciRcInt")
    1321                      .dwattr $C$DW$64, DW_AT_external
    1322                      .dwattr $C$DW$64, DW_AT_TI_begin_file("../UART/cntrlUART.c")
    1323                      .dwattr $C$DW$64, DW_AT_TI_begin_line(0x192)
    1324                      .dwattr $C$DW$64, DW_AT_TI_begin_column(0x06)
    1325                      .dwattr $C$DW$64, DW_AT_TI_max_frame_size(-2)
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:12 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0612810                           PAGE   27

    1326                      .dwpsn  file "../UART/cntrlUART.c",line 403,column 1,is_stmt,address _disableSciRcInt
    1327              
    1328                      .dwfde $C$DW$CIE, _disableSciRcInt
    1329              
    1330              ;***************************************************************
    1331              ;* FNAME: _disableSciRcInt              FR SIZE:   0           *
    1332              ;*                                                             *
    1333              ;* FUNCTION ENVIRONMENT                                        *
    1334              ;*                                                             *
    1335              ;* FUNCTION PROPERTIES                                         *
    1336              ;*                            0 Parameter,  0 Auto,  0 SOE     *
    1337              ;***************************************************************
    1338              
    1339 000000ba       _disableSciRcInt:
    1340                      .dwcfi  cfa_offset, -2
    1341                      .dwcfi  save_reg_to_mem, 26, 0
    1342                      .dwcfi  save_reg_to_reg, 78, 26
    1343                      .dwpsn  file "../UART/cntrlUART.c",line 409,column 2,is_stmt
    1344 000000ba 761F!         MOVW      DP,#_SciaRegs+11      ; [CPU_U] 
         000000bb 0000 
    1345 000000bc 180B!         AND       @_SciaRegs+11,#0xffdf ; [CPU_] |409| 
         000000bd FFDF 
    1346                      .dwpsn  file "../UART/cntrlUART.c",line 413,column 1,is_stmt
    1347              $C$DW$65        .dwtag  DW_TAG_TI_branch
    1348                      .dwattr $C$DW$65, DW_AT_low_pc(0x00)
    1349                      .dwattr $C$DW$65, DW_AT_TI_return
    1350 000000be 0006          LRETR     ; [CPU_] 
    1351                      ; return occurs ; [] 
    1352                      .dwattr $C$DW$64, DW_AT_TI_end_file("../UART/cntrlUART.c")
    1353                      .dwattr $C$DW$64, DW_AT_TI_end_line(0x19d)
    1354                      .dwattr $C$DW$64, DW_AT_TI_end_column(0x01)
    1355                      .dwendentry
    1356                      .dwendtag $C$DW$64
    1357              
    1358              ;**************************************************************
    1359              ;* UNDEFINED EXTERNAL REFERENCES                              *
    1360              ;**************************************************************
    1361                      .global _initUartBufer
    1362                      .global _getTxBufForInt
    1363                      .global _testRcBuf
    1364                      .global _putRcBufFromInt
    1365                      .global _SciaRegs
    1366                      .global _ScicRegs
    1367                      .global _PieCtrlRegs
    1368                      .global _GpioCtrlRegs
    1369                      .global _PieVectTable
    1370              
    1371              ;***************************************************************
    1372              ;* TYPE INFORMATION                                            *
    1373              ;***************************************************************
    1374              
    1375              $C$DW$T$20      .dwtag  DW_TAG_structure_type
    1376                      .dwattr $C$DW$T$20, DW_AT_name("GPA1_BITS")
    1377                      .dwattr $C$DW$T$20, DW_AT_byte_size(0x02)
    1378              $C$DW$66        .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:12 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0612810                           PAGE   28

    1379                      .dwattr $C$DW$66, DW_AT_type(*$C$DW$T$19)
    1380                      .dwattr $C$DW$66, DW_AT_name("GPIO0")
    1381                      .dwattr $C$DW$66, DW_AT_TI_symbol_name("_GPIO0")
    1382                      .dwattr $C$DW$66, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x02)
    1383                      .dwattr $C$DW$66, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1384                      .dwattr $C$DW$66, DW_AT_accessibility(DW_ACCESS_public)
    1385              $C$DW$67        .dwtag  DW_TAG_member
    1386                      .dwattr $C$DW$67, DW_AT_type(*$C$DW$T$19)
    1387                      .dwattr $C$DW$67, DW_AT_name("GPIO1")
    1388                      .dwattr $C$DW$67, DW_AT_TI_symbol_name("_GPIO1")
    1389                      .dwattr $C$DW$67, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x02)
    1390                      .dwattr $C$DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1391                      .dwattr $C$DW$67, DW_AT_accessibility(DW_ACCESS_public)
    1392              $C$DW$68        .dwtag  DW_TAG_member
    1393                      .dwattr $C$DW$68, DW_AT_type(*$C$DW$T$19)
    1394                      .dwattr $C$DW$68, DW_AT_name("GPIO2")
    1395                      .dwattr $C$DW$68, DW_AT_TI_symbol_name("_GPIO2")
    1396                      .dwattr $C$DW$68, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x02)
    1397                      .dwattr $C$DW$68, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1398                      .dwattr $C$DW$68, DW_AT_accessibility(DW_ACCESS_public)
    1399              $C$DW$69        .dwtag  DW_TAG_member
    1400                      .dwattr $C$DW$69, DW_AT_type(*$C$DW$T$19)
    1401                      .dwattr $C$DW$69, DW_AT_name("GPIO3")
    1402                      .dwattr $C$DW$69, DW_AT_TI_symbol_name("_GPIO3")
    1403                      .dwattr $C$DW$69, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x02)
    1404                      .dwattr $C$DW$69, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1405                      .dwattr $C$DW$69, DW_AT_accessibility(DW_ACCESS_public)
    1406              $C$DW$70        .dwtag  DW_TAG_member
    1407                      .dwattr $C$DW$70, DW_AT_type(*$C$DW$T$19)
    1408                      .dwattr $C$DW$70, DW_AT_name("GPIO4")
    1409                      .dwattr $C$DW$70, DW_AT_TI_symbol_name("_GPIO4")
    1410                      .dwattr $C$DW$70, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x02)
    1411                      .dwattr $C$DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1412                      .dwattr $C$DW$70, DW_AT_accessibility(DW_ACCESS_public)
    1413              $C$DW$71        .dwtag  DW_TAG_member
    1414                      .dwattr $C$DW$71, DW_AT_type(*$C$DW$T$19)
    1415                      .dwattr $C$DW$71, DW_AT_name("GPIO5")
    1416                      .dwattr $C$DW$71, DW_AT_TI_symbol_name("_GPIO5")
    1417                      .dwattr $C$DW$71, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x02)
    1418                      .dwattr $C$DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1419                      .dwattr $C$DW$71, DW_AT_accessibility(DW_ACCESS_public)
    1420              $C$DW$72        .dwtag  DW_TAG_member
    1421                      .dwattr $C$DW$72, DW_AT_type(*$C$DW$T$19)
    1422                      .dwattr $C$DW$72, DW_AT_name("GPIO6")
    1423                      .dwattr $C$DW$72, DW_AT_TI_symbol_name("_GPIO6")
    1424                      .dwattr $C$DW$72, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x02)
    1425                      .dwattr $C$DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1426                      .dwattr $C$DW$72, DW_AT_accessibility(DW_ACCESS_public)
    1427              $C$DW$73        .dwtag  DW_TAG_member
    1428                      .dwattr $C$DW$73, DW_AT_type(*$C$DW$T$19)
    1429                      .dwattr $C$DW$73, DW_AT_name("GPIO7")
    1430                      .dwattr $C$DW$73, DW_AT_TI_symbol_name("_GPIO7")
    1431                      .dwattr $C$DW$73, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x02)
    1432                      .dwattr $C$DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1433                      .dwattr $C$DW$73, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:12 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0612810                           PAGE   29

    1434              $C$DW$74        .dwtag  DW_TAG_member
    1435                      .dwattr $C$DW$74, DW_AT_type(*$C$DW$T$19)
    1436                      .dwattr $C$DW$74, DW_AT_name("GPIO8")
    1437                      .dwattr $C$DW$74, DW_AT_TI_symbol_name("_GPIO8")
    1438                      .dwattr $C$DW$74, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x02)
    1439                      .dwattr $C$DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1440                      .dwattr $C$DW$74, DW_AT_accessibility(DW_ACCESS_public)
    1441              $C$DW$75        .dwtag  DW_TAG_member
    1442                      .dwattr $C$DW$75, DW_AT_type(*$C$DW$T$19)
    1443                      .dwattr $C$DW$75, DW_AT_name("GPIO9")
    1444                      .dwattr $C$DW$75, DW_AT_TI_symbol_name("_GPIO9")
    1445                      .dwattr $C$DW$75, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x02)
    1446                      .dwattr $C$DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1447                      .dwattr $C$DW$75, DW_AT_accessibility(DW_ACCESS_public)
    1448              $C$DW$76        .dwtag  DW_TAG_member
    1449                      .dwattr $C$DW$76, DW_AT_type(*$C$DW$T$19)
    1450                      .dwattr $C$DW$76, DW_AT_name("GPIO10")
    1451                      .dwattr $C$DW$76, DW_AT_TI_symbol_name("_GPIO10")
    1452                      .dwattr $C$DW$76, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x02)
    1453                      .dwattr $C$DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1454                      .dwattr $C$DW$76, DW_AT_accessibility(DW_ACCESS_public)
    1455              $C$DW$77        .dwtag  DW_TAG_member
    1456                      .dwattr $C$DW$77, DW_AT_type(*$C$DW$T$19)
    1457                      .dwattr $C$DW$77, DW_AT_name("GPIO11")
    1458                      .dwattr $C$DW$77, DW_AT_TI_symbol_name("_GPIO11")
    1459                      .dwattr $C$DW$77, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x02)
    1460                      .dwattr $C$DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1461                      .dwattr $C$DW$77, DW_AT_accessibility(DW_ACCESS_public)
    1462              $C$DW$78        .dwtag  DW_TAG_member
    1463                      .dwattr $C$DW$78, DW_AT_type(*$C$DW$T$19)
    1464                      .dwattr $C$DW$78, DW_AT_name("GPIO12")
    1465                      .dwattr $C$DW$78, DW_AT_TI_symbol_name("_GPIO12")
    1466                      .dwattr $C$DW$78, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x02)
    1467                      .dwattr $C$DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1468                      .dwattr $C$DW$78, DW_AT_accessibility(DW_ACCESS_public)
    1469              $C$DW$79        .dwtag  DW_TAG_member
    1470                      .dwattr $C$DW$79, DW_AT_type(*$C$DW$T$19)
    1471                      .dwattr $C$DW$79, DW_AT_name("GPIO13")
    1472                      .dwattr $C$DW$79, DW_AT_TI_symbol_name("_GPIO13")
    1473                      .dwattr $C$DW$79, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x02)
    1474                      .dwattr $C$DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1475                      .dwattr $C$DW$79, DW_AT_accessibility(DW_ACCESS_public)
    1476              $C$DW$80        .dwtag  DW_TAG_member
    1477                      .dwattr $C$DW$80, DW_AT_type(*$C$DW$T$19)
    1478                      .dwattr $C$DW$80, DW_AT_name("GPIO14")
    1479                      .dwattr $C$DW$80, DW_AT_TI_symbol_name("_GPIO14")
    1480                      .dwattr $C$DW$80, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x02)
    1481                      .dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1482                      .dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
    1483              $C$DW$81        .dwtag  DW_TAG_member
    1484                      .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$19)
    1485                      .dwattr $C$DW$81, DW_AT_name("GPIO15")
    1486                      .dwattr $C$DW$81, DW_AT_TI_symbol_name("_GPIO15")
    1487                      .dwattr $C$DW$81, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x02)
    1488                      .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:12 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0612810                           PAGE   30

    1489                      .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
    1490                      .dwendtag $C$DW$T$20
    1491              
    1492              
    1493              $C$DW$T$22      .dwtag  DW_TAG_union_type
    1494                      .dwattr $C$DW$T$22, DW_AT_name("GPA1_REG")
    1495                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x02)
    1496              $C$DW$82        .dwtag  DW_TAG_member
    1497                      .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$21)
    1498                      .dwattr $C$DW$82, DW_AT_name("all")
    1499                      .dwattr $C$DW$82, DW_AT_TI_symbol_name("_all")
    1500                      .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1501                      .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
    1502              $C$DW$83        .dwtag  DW_TAG_member
    1503                      .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$20)
    1504                      .dwattr $C$DW$83, DW_AT_name("bit")
    1505                      .dwattr $C$DW$83, DW_AT_TI_symbol_name("_bit")
    1506                      .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1507                      .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
    1508                      .dwendtag $C$DW$T$22
    1509              
    1510              
    1511              $C$DW$T$23      .dwtag  DW_TAG_structure_type
    1512                      .dwattr $C$DW$T$23, DW_AT_name("GPA2_BITS")
    1513                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x02)
    1514              $C$DW$84        .dwtag  DW_TAG_member
    1515                      .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$19)
    1516                      .dwattr $C$DW$84, DW_AT_name("GPIO16")
    1517                      .dwattr $C$DW$84, DW_AT_TI_symbol_name("_GPIO16")
    1518                      .dwattr $C$DW$84, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x02)
    1519                      .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1520                      .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
    1521              $C$DW$85        .dwtag  DW_TAG_member
    1522                      .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$19)
    1523                      .dwattr $C$DW$85, DW_AT_name("GPIO17")
    1524                      .dwattr $C$DW$85, DW_AT_TI_symbol_name("_GPIO17")
    1525                      .dwattr $C$DW$85, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x02)
    1526                      .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1527                      .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
    1528              $C$DW$86        .dwtag  DW_TAG_member
    1529                      .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$19)
    1530                      .dwattr $C$DW$86, DW_AT_name("GPIO18")
    1531                      .dwattr $C$DW$86, DW_AT_TI_symbol_name("_GPIO18")
    1532                      .dwattr $C$DW$86, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x02)
    1533                      .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1534                      .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
    1535              $C$DW$87        .dwtag  DW_TAG_member
    1536                      .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$19)
    1537                      .dwattr $C$DW$87, DW_AT_name("GPIO19")
    1538                      .dwattr $C$DW$87, DW_AT_TI_symbol_name("_GPIO19")
    1539                      .dwattr $C$DW$87, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x02)
    1540                      .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1541                      .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
    1542              $C$DW$88        .dwtag  DW_TAG_member
    1543                      .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:12 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0612810                           PAGE   31

    1544                      .dwattr $C$DW$88, DW_AT_name("GPIO20")
    1545                      .dwattr $C$DW$88, DW_AT_TI_symbol_name("_GPIO20")
    1546                      .dwattr $C$DW$88, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x02)
    1547                      .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1548                      .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
    1549              $C$DW$89        .dwtag  DW_TAG_member
    1550                      .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$19)
    1551                      .dwattr $C$DW$89, DW_AT_name("GPIO21")
    1552                      .dwattr $C$DW$89, DW_AT_TI_symbol_name("_GPIO21")
    1553                      .dwattr $C$DW$89, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x02)
    1554                      .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1555                      .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
    1556              $C$DW$90        .dwtag  DW_TAG_member
    1557                      .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$19)
    1558                      .dwattr $C$DW$90, DW_AT_name("GPIO22")
    1559                      .dwattr $C$DW$90, DW_AT_TI_symbol_name("_GPIO22")
    1560                      .dwattr $C$DW$90, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x02)
    1561                      .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1562                      .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
    1563              $C$DW$91        .dwtag  DW_TAG_member
    1564                      .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$19)
    1565                      .dwattr $C$DW$91, DW_AT_name("GPIO23")
    1566                      .dwattr $C$DW$91, DW_AT_TI_symbol_name("_GPIO23")
    1567                      .dwattr $C$DW$91, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x02)
    1568                      .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1569                      .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
    1570              $C$DW$92        .dwtag  DW_TAG_member
    1571                      .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$19)
    1572                      .dwattr $C$DW$92, DW_AT_name("GPIO24")
    1573                      .dwattr $C$DW$92, DW_AT_TI_symbol_name("_GPIO24")
    1574                      .dwattr $C$DW$92, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x02)
    1575                      .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1576                      .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
    1577              $C$DW$93        .dwtag  DW_TAG_member
    1578                      .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$19)
    1579                      .dwattr $C$DW$93, DW_AT_name("GPIO25")
    1580                      .dwattr $C$DW$93, DW_AT_TI_symbol_name("_GPIO25")
    1581                      .dwattr $C$DW$93, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x02)
    1582                      .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1583                      .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
    1584              $C$DW$94        .dwtag  DW_TAG_member
    1585                      .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$19)
    1586                      .dwattr $C$DW$94, DW_AT_name("GPIO26")
    1587                      .dwattr $C$DW$94, DW_AT_TI_symbol_name("_GPIO26")
    1588                      .dwattr $C$DW$94, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x02)
    1589                      .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1590                      .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
    1591              $C$DW$95        .dwtag  DW_TAG_member
    1592                      .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$19)
    1593                      .dwattr $C$DW$95, DW_AT_name("GPIO27")
    1594                      .dwattr $C$DW$95, DW_AT_TI_symbol_name("_GPIO27")
    1595                      .dwattr $C$DW$95, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x02)
    1596                      .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1597                      .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
    1598              $C$DW$96        .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:12 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0612810                           PAGE   32

    1599                      .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$19)
    1600                      .dwattr $C$DW$96, DW_AT_name("GPIO28")
    1601                      .dwattr $C$DW$96, DW_AT_TI_symbol_name("_GPIO28")
    1602                      .dwattr $C$DW$96, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x02)
    1603                      .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1604                      .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
    1605              $C$DW$97        .dwtag  DW_TAG_member
    1606                      .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$19)
    1607                      .dwattr $C$DW$97, DW_AT_name("GPIO29")
    1608                      .dwattr $C$DW$97, DW_AT_TI_symbol_name("_GPIO29")
    1609                      .dwattr $C$DW$97, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x02)
    1610                      .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1611                      .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
    1612              $C$DW$98        .dwtag  DW_TAG_member
    1613                      .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$19)
    1614                      .dwattr $C$DW$98, DW_AT_name("GPIO30")
    1615                      .dwattr $C$DW$98, DW_AT_TI_symbol_name("_GPIO30")
    1616                      .dwattr $C$DW$98, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x02)
    1617                      .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1618                      .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
    1619              $C$DW$99        .dwtag  DW_TAG_member
    1620                      .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$19)
    1621                      .dwattr $C$DW$99, DW_AT_name("GPIO31")
    1622                      .dwattr $C$DW$99, DW_AT_TI_symbol_name("_GPIO31")
    1623                      .dwattr $C$DW$99, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x02)
    1624                      .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1625                      .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
    1626                      .dwendtag $C$DW$T$23
    1627              
    1628              
    1629              $C$DW$T$24      .dwtag  DW_TAG_union_type
    1630                      .dwattr $C$DW$T$24, DW_AT_name("GPA2_REG")
    1631                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x02)
    1632              $C$DW$100       .dwtag  DW_TAG_member
    1633                      .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$21)
    1634                      .dwattr $C$DW$100, DW_AT_name("all")
    1635                      .dwattr $C$DW$100, DW_AT_TI_symbol_name("_all")
    1636                      .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1637                      .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
    1638              $C$DW$101       .dwtag  DW_TAG_member
    1639                      .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$23)
    1640                      .dwattr $C$DW$101, DW_AT_name("bit")
    1641                      .dwattr $C$DW$101, DW_AT_TI_symbol_name("_bit")
    1642                      .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1643                      .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
    1644                      .dwendtag $C$DW$T$24
    1645              
    1646              
    1647              $C$DW$T$25      .dwtag  DW_TAG_structure_type
    1648                      .dwattr $C$DW$T$25, DW_AT_name("GPACTRL_BITS")
    1649                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x02)
    1650              $C$DW$102       .dwtag  DW_TAG_member
    1651                      .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$19)
    1652                      .dwattr $C$DW$102, DW_AT_name("QUALPRD0")
    1653                      .dwattr $C$DW$102, DW_AT_TI_symbol_name("_QUALPRD0")
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:12 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0612810                           PAGE   33

    1654                      .dwattr $C$DW$102, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x08)
    1655                      .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1656                      .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
    1657              $C$DW$103       .dwtag  DW_TAG_member
    1658                      .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$19)
    1659                      .dwattr $C$DW$103, DW_AT_name("QUALPRD1")
    1660                      .dwattr $C$DW$103, DW_AT_TI_symbol_name("_QUALPRD1")
    1661                      .dwattr $C$DW$103, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x08)
    1662                      .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1663                      .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
    1664              $C$DW$104       .dwtag  DW_TAG_member
    1665                      .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$19)
    1666                      .dwattr $C$DW$104, DW_AT_name("QUALPRD2")
    1667                      .dwattr $C$DW$104, DW_AT_TI_symbol_name("_QUALPRD2")
    1668                      .dwattr $C$DW$104, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x08)
    1669                      .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1670                      .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
    1671              $C$DW$105       .dwtag  DW_TAG_member
    1672                      .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$19)
    1673                      .dwattr $C$DW$105, DW_AT_name("QUALPRD3")
    1674                      .dwattr $C$DW$105, DW_AT_TI_symbol_name("_QUALPRD3")
    1675                      .dwattr $C$DW$105, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x08)
    1676                      .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1677                      .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
    1678                      .dwendtag $C$DW$T$25
    1679              
    1680              
    1681              $C$DW$T$26      .dwtag  DW_TAG_union_type
    1682                      .dwattr $C$DW$T$26, DW_AT_name("GPACTRL_REG")
    1683                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x02)
    1684              $C$DW$106       .dwtag  DW_TAG_member
    1685                      .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$21)
    1686                      .dwattr $C$DW$106, DW_AT_name("all")
    1687                      .dwattr $C$DW$106, DW_AT_TI_symbol_name("_all")
    1688                      .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1689                      .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    1690              $C$DW$107       .dwtag  DW_TAG_member
    1691                      .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$25)
    1692                      .dwattr $C$DW$107, DW_AT_name("bit")
    1693                      .dwattr $C$DW$107, DW_AT_TI_symbol_name("_bit")
    1694                      .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1695                      .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
    1696                      .dwendtag $C$DW$T$26
    1697              
    1698              
    1699              $C$DW$T$27      .dwtag  DW_TAG_structure_type
    1700                      .dwattr $C$DW$T$27, DW_AT_name("GPADAT_BITS")
    1701                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x02)
    1702              $C$DW$108       .dwtag  DW_TAG_member
    1703                      .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$19)
    1704                      .dwattr $C$DW$108, DW_AT_name("GPIO0")
    1705                      .dwattr $C$DW$108, DW_AT_TI_symbol_name("_GPIO0")
    1706                      .dwattr $C$DW$108, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    1707                      .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1708                      .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:12 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0612810                           PAGE   34

    1709              $C$DW$109       .dwtag  DW_TAG_member
    1710                      .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$19)
    1711                      .dwattr $C$DW$109, DW_AT_name("GPIO1")
    1712                      .dwattr $C$DW$109, DW_AT_TI_symbol_name("_GPIO1")
    1713                      .dwattr $C$DW$109, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    1714                      .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1715                      .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    1716              $C$DW$110       .dwtag  DW_TAG_member
    1717                      .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$19)
    1718                      .dwattr $C$DW$110, DW_AT_name("GPIO2")
    1719                      .dwattr $C$DW$110, DW_AT_TI_symbol_name("_GPIO2")
    1720                      .dwattr $C$DW$110, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    1721                      .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1722                      .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    1723              $C$DW$111       .dwtag  DW_TAG_member
    1724                      .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$19)
    1725                      .dwattr $C$DW$111, DW_AT_name("GPIO3")
    1726                      .dwattr $C$DW$111, DW_AT_TI_symbol_name("_GPIO3")
    1727                      .dwattr $C$DW$111, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    1728                      .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1729                      .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    1730              $C$DW$112       .dwtag  DW_TAG_member
    1731                      .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$19)
    1732                      .dwattr $C$DW$112, DW_AT_name("GPIO4")
    1733                      .dwattr $C$DW$112, DW_AT_TI_symbol_name("_GPIO4")
    1734                      .dwattr $C$DW$112, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    1735                      .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1736                      .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    1737              $C$DW$113       .dwtag  DW_TAG_member
    1738                      .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$19)
    1739                      .dwattr $C$DW$113, DW_AT_name("GPIO5")
    1740                      .dwattr $C$DW$113, DW_AT_TI_symbol_name("_GPIO5")
    1741                      .dwattr $C$DW$113, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    1742                      .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1743                      .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    1744              $C$DW$114       .dwtag  DW_TAG_member
    1745                      .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$19)
    1746                      .dwattr $C$DW$114, DW_AT_name("GPIO6")
    1747                      .dwattr $C$DW$114, DW_AT_TI_symbol_name("_GPIO6")
    1748                      .dwattr $C$DW$114, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    1749                      .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1750                      .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    1751              $C$DW$115       .dwtag  DW_TAG_member
    1752                      .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$19)
    1753                      .dwattr $C$DW$115, DW_AT_name("GPIO7")
    1754                      .dwattr $C$DW$115, DW_AT_TI_symbol_name("_GPIO7")
    1755                      .dwattr $C$DW$115, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    1756                      .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1757                      .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    1758              $C$DW$116       .dwtag  DW_TAG_member
    1759                      .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$19)
    1760                      .dwattr $C$DW$116, DW_AT_name("GPIO8")
    1761                      .dwattr $C$DW$116, DW_AT_TI_symbol_name("_GPIO8")
    1762                      .dwattr $C$DW$116, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
    1763                      .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:12 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0612810                           PAGE   35

    1764                      .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    1765              $C$DW$117       .dwtag  DW_TAG_member
    1766                      .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$19)
    1767                      .dwattr $C$DW$117, DW_AT_name("GPIO9")
    1768                      .dwattr $C$DW$117, DW_AT_TI_symbol_name("_GPIO9")
    1769                      .dwattr $C$DW$117, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    1770                      .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1771                      .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    1772              $C$DW$118       .dwtag  DW_TAG_member
    1773                      .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$19)
    1774                      .dwattr $C$DW$118, DW_AT_name("GPIO10")
    1775                      .dwattr $C$DW$118, DW_AT_TI_symbol_name("_GPIO10")
    1776                      .dwattr $C$DW$118, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
    1777                      .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1778                      .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    1779              $C$DW$119       .dwtag  DW_TAG_member
    1780                      .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$19)
    1781                      .dwattr $C$DW$119, DW_AT_name("GPIO11")
    1782                      .dwattr $C$DW$119, DW_AT_TI_symbol_name("_GPIO11")
    1783                      .dwattr $C$DW$119, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
    1784                      .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1785                      .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    1786              $C$DW$120       .dwtag  DW_TAG_member
    1787                      .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$19)
    1788                      .dwattr $C$DW$120, DW_AT_name("GPIO12")
    1789                      .dwattr $C$DW$120, DW_AT_TI_symbol_name("_GPIO12")
    1790                      .dwattr $C$DW$120, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
    1791                      .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1792                      .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    1793              $C$DW$121       .dwtag  DW_TAG_member
    1794                      .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$19)
    1795                      .dwattr $C$DW$121, DW_AT_name("GPIO13")
    1796                      .dwattr $C$DW$121, DW_AT_TI_symbol_name("_GPIO13")
    1797                      .dwattr $C$DW$121, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
    1798                      .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1799                      .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    1800              $C$DW$122       .dwtag  DW_TAG_member
    1801                      .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$19)
    1802                      .dwattr $C$DW$122, DW_AT_name("GPIO14")
    1803                      .dwattr $C$DW$122, DW_AT_TI_symbol_name("_GPIO14")
    1804                      .dwattr $C$DW$122, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
    1805                      .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1806                      .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    1807              $C$DW$123       .dwtag  DW_TAG_member
    1808                      .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$19)
    1809                      .dwattr $C$DW$123, DW_AT_name("GPIO15")
    1810                      .dwattr $C$DW$123, DW_AT_TI_symbol_name("_GPIO15")
    1811                      .dwattr $C$DW$123, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    1812                      .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1813                      .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    1814              $C$DW$124       .dwtag  DW_TAG_member
    1815                      .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$19)
    1816                      .dwattr $C$DW$124, DW_AT_name("GPIO16")
    1817                      .dwattr $C$DW$124, DW_AT_TI_symbol_name("_GPIO16")
    1818                      .dwattr $C$DW$124, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:12 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0612810                           PAGE   36

    1819                      .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1820                      .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    1821              $C$DW$125       .dwtag  DW_TAG_member
    1822                      .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$19)
    1823                      .dwattr $C$DW$125, DW_AT_name("GPIO17")
    1824                      .dwattr $C$DW$125, DW_AT_TI_symbol_name("_GPIO17")
    1825                      .dwattr $C$DW$125, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    1826                      .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1827                      .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    1828              $C$DW$126       .dwtag  DW_TAG_member
    1829                      .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$19)
    1830                      .dwattr $C$DW$126, DW_AT_name("GPIO18")
    1831                      .dwattr $C$DW$126, DW_AT_TI_symbol_name("_GPIO18")
    1832                      .dwattr $C$DW$126, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    1833                      .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1834                      .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    1835              $C$DW$127       .dwtag  DW_TAG_member
    1836                      .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$19)
    1837                      .dwattr $C$DW$127, DW_AT_name("GPIO19")
    1838                      .dwattr $C$DW$127, DW_AT_TI_symbol_name("_GPIO19")
    1839                      .dwattr $C$DW$127, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    1840                      .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1841                      .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    1842              $C$DW$128       .dwtag  DW_TAG_member
    1843                      .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$19)
    1844                      .dwattr $C$DW$128, DW_AT_name("GPIO20")
    1845                      .dwattr $C$DW$128, DW_AT_TI_symbol_name("_GPIO20")
    1846                      .dwattr $C$DW$128, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    1847                      .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1848                      .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    1849              $C$DW$129       .dwtag  DW_TAG_member
    1850                      .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$19)
    1851                      .dwattr $C$DW$129, DW_AT_name("GPIO21")
    1852                      .dwattr $C$DW$129, DW_AT_TI_symbol_name("_GPIO21")
    1853                      .dwattr $C$DW$129, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    1854                      .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1855                      .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    1856              $C$DW$130       .dwtag  DW_TAG_member
    1857                      .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$19)
    1858                      .dwattr $C$DW$130, DW_AT_name("GPIO22")
    1859                      .dwattr $C$DW$130, DW_AT_TI_symbol_name("_GPIO22")
    1860                      .dwattr $C$DW$130, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    1861                      .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1862                      .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    1863              $C$DW$131       .dwtag  DW_TAG_member
    1864                      .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$19)
    1865                      .dwattr $C$DW$131, DW_AT_name("GPIO23")
    1866                      .dwattr $C$DW$131, DW_AT_TI_symbol_name("_GPIO23")
    1867                      .dwattr $C$DW$131, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    1868                      .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1869                      .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    1870              $C$DW$132       .dwtag  DW_TAG_member
    1871                      .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$19)
    1872                      .dwattr $C$DW$132, DW_AT_name("GPIO24")
    1873                      .dwattr $C$DW$132, DW_AT_TI_symbol_name("_GPIO24")
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:12 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0612810                           PAGE   37

    1874                      .dwattr $C$DW$132, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
    1875                      .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1876                      .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    1877              $C$DW$133       .dwtag  DW_TAG_member
    1878                      .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$19)
    1879                      .dwattr $C$DW$133, DW_AT_name("GPIO25")
    1880                      .dwattr $C$DW$133, DW_AT_TI_symbol_name("_GPIO25")
    1881                      .dwattr $C$DW$133, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    1882                      .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1883                      .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    1884              $C$DW$134       .dwtag  DW_TAG_member
    1885                      .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$19)
    1886                      .dwattr $C$DW$134, DW_AT_name("GPIO26")
    1887                      .dwattr $C$DW$134, DW_AT_TI_symbol_name("_GPIO26")
    1888                      .dwattr $C$DW$134, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
    1889                      .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1890                      .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    1891              $C$DW$135       .dwtag  DW_TAG_member
    1892                      .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$19)
    1893                      .dwattr $C$DW$135, DW_AT_name("GPIO27")
    1894                      .dwattr $C$DW$135, DW_AT_TI_symbol_name("_GPIO27")
    1895                      .dwattr $C$DW$135, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
    1896                      .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1897                      .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    1898              $C$DW$136       .dwtag  DW_TAG_member
    1899                      .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$19)
    1900                      .dwattr $C$DW$136, DW_AT_name("GPIO28")
    1901                      .dwattr $C$DW$136, DW_AT_TI_symbol_name("_GPIO28")
    1902                      .dwattr $C$DW$136, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
    1903                      .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1904                      .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    1905              $C$DW$137       .dwtag  DW_TAG_member
    1906                      .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$19)
    1907                      .dwattr $C$DW$137, DW_AT_name("GPIO29")
    1908                      .dwattr $C$DW$137, DW_AT_TI_symbol_name("_GPIO29")
    1909                      .dwattr $C$DW$137, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
    1910                      .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1911                      .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    1912              $C$DW$138       .dwtag  DW_TAG_member
    1913                      .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$19)
    1914                      .dwattr $C$DW$138, DW_AT_name("GPIO30")
    1915                      .dwattr $C$DW$138, DW_AT_TI_symbol_name("_GPIO30")
    1916                      .dwattr $C$DW$138, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
    1917                      .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1918                      .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    1919              $C$DW$139       .dwtag  DW_TAG_member
    1920                      .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$19)
    1921                      .dwattr $C$DW$139, DW_AT_name("GPIO31")
    1922                      .dwattr $C$DW$139, DW_AT_TI_symbol_name("_GPIO31")
    1923                      .dwattr $C$DW$139, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    1924                      .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1925                      .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    1926                      .dwendtag $C$DW$T$27
    1927              
    1928              
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:12 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0612810                           PAGE   38

    1929              $C$DW$T$28      .dwtag  DW_TAG_union_type
    1930                      .dwattr $C$DW$T$28, DW_AT_name("GPADAT_REG")
    1931                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x02)
    1932              $C$DW$140       .dwtag  DW_TAG_member
    1933                      .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$21)
    1934                      .dwattr $C$DW$140, DW_AT_name("all")
    1935                      .dwattr $C$DW$140, DW_AT_TI_symbol_name("_all")
    1936                      .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1937                      .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    1938              $C$DW$141       .dwtag  DW_TAG_member
    1939                      .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$27)
    1940                      .dwattr $C$DW$141, DW_AT_name("bit")
    1941                      .dwattr $C$DW$141, DW_AT_TI_symbol_name("_bit")
    1942                      .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1943                      .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    1944                      .dwendtag $C$DW$T$28
    1945              
    1946              
    1947              $C$DW$T$29      .dwtag  DW_TAG_structure_type
    1948                      .dwattr $C$DW$T$29, DW_AT_name("GPB1_BITS")
    1949                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x02)
    1950              $C$DW$142       .dwtag  DW_TAG_member
    1951                      .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$19)
    1952                      .dwattr $C$DW$142, DW_AT_name("GPIO32")
    1953                      .dwattr $C$DW$142, DW_AT_TI_symbol_name("_GPIO32")
    1954                      .dwattr $C$DW$142, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x02)
    1955                      .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1956                      .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    1957              $C$DW$143       .dwtag  DW_TAG_member
    1958                      .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$19)
    1959                      .dwattr $C$DW$143, DW_AT_name("GPIO33")
    1960                      .dwattr $C$DW$143, DW_AT_TI_symbol_name("_GPIO33")
    1961                      .dwattr $C$DW$143, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x02)
    1962                      .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1963                      .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    1964              $C$DW$144       .dwtag  DW_TAG_member
    1965                      .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$19)
    1966                      .dwattr $C$DW$144, DW_AT_name("GPIO34")
    1967                      .dwattr $C$DW$144, DW_AT_TI_symbol_name("_GPIO34")
    1968                      .dwattr $C$DW$144, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x02)
    1969                      .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1970                      .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    1971              $C$DW$145       .dwtag  DW_TAG_member
    1972                      .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$19)
    1973                      .dwattr $C$DW$145, DW_AT_name("GPIO35")
    1974                      .dwattr $C$DW$145, DW_AT_TI_symbol_name("_GPIO35")
    1975                      .dwattr $C$DW$145, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x02)
    1976                      .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1977                      .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    1978              $C$DW$146       .dwtag  DW_TAG_member
    1979                      .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$19)
    1980                      .dwattr $C$DW$146, DW_AT_name("GPIO36")
    1981                      .dwattr $C$DW$146, DW_AT_TI_symbol_name("_GPIO36")
    1982                      .dwattr $C$DW$146, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x02)
    1983                      .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:12 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0612810                           PAGE   39

    1984                      .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
    1985              $C$DW$147       .dwtag  DW_TAG_member
    1986                      .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$19)
    1987                      .dwattr $C$DW$147, DW_AT_name("GPIO37")
    1988                      .dwattr $C$DW$147, DW_AT_TI_symbol_name("_GPIO37")
    1989                      .dwattr $C$DW$147, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x02)
    1990                      .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1991                      .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
    1992              $C$DW$148       .dwtag  DW_TAG_member
    1993                      .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$19)
    1994                      .dwattr $C$DW$148, DW_AT_name("GPIO38")
    1995                      .dwattr $C$DW$148, DW_AT_TI_symbol_name("_GPIO38")
    1996                      .dwattr $C$DW$148, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x02)
    1997                      .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1998                      .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    1999              $C$DW$149       .dwtag  DW_TAG_member
    2000                      .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$19)
    2001                      .dwattr $C$DW$149, DW_AT_name("GPIO39")
    2002                      .dwattr $C$DW$149, DW_AT_TI_symbol_name("_GPIO39")
    2003                      .dwattr $C$DW$149, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x02)
    2004                      .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2005                      .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    2006              $C$DW$150       .dwtag  DW_TAG_member
    2007                      .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$19)
    2008                      .dwattr $C$DW$150, DW_AT_name("GPIO40")
    2009                      .dwattr $C$DW$150, DW_AT_TI_symbol_name("_GPIO40")
    2010                      .dwattr $C$DW$150, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x02)
    2011                      .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2012                      .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
    2013              $C$DW$151       .dwtag  DW_TAG_member
    2014                      .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$19)
    2015                      .dwattr $C$DW$151, DW_AT_name("GPIO41")
    2016                      .dwattr $C$DW$151, DW_AT_TI_symbol_name("_GPIO41")
    2017                      .dwattr $C$DW$151, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x02)
    2018                      .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2019                      .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    2020              $C$DW$152       .dwtag  DW_TAG_member
    2021                      .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$19)
    2022                      .dwattr $C$DW$152, DW_AT_name("GPIO42")
    2023                      .dwattr $C$DW$152, DW_AT_TI_symbol_name("_GPIO42")
    2024                      .dwattr $C$DW$152, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x02)
    2025                      .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2026                      .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    2027              $C$DW$153       .dwtag  DW_TAG_member
    2028                      .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$19)
    2029                      .dwattr $C$DW$153, DW_AT_name("GPIO43")
    2030                      .dwattr $C$DW$153, DW_AT_TI_symbol_name("_GPIO43")
    2031                      .dwattr $C$DW$153, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x02)
    2032                      .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2033                      .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    2034              $C$DW$154       .dwtag  DW_TAG_member
    2035                      .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$19)
    2036                      .dwattr $C$DW$154, DW_AT_name("GPIO44")
    2037                      .dwattr $C$DW$154, DW_AT_TI_symbol_name("_GPIO44")
    2038                      .dwattr $C$DW$154, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x02)
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:12 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0612810                           PAGE   40

    2039                      .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2040                      .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
    2041              $C$DW$155       .dwtag  DW_TAG_member
    2042                      .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$19)
    2043                      .dwattr $C$DW$155, DW_AT_name("GPIO45")
    2044                      .dwattr $C$DW$155, DW_AT_TI_symbol_name("_GPIO45")
    2045                      .dwattr $C$DW$155, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x02)
    2046                      .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2047                      .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
    2048              $C$DW$156       .dwtag  DW_TAG_member
    2049                      .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$19)
    2050                      .dwattr $C$DW$156, DW_AT_name("GPIO46")
    2051                      .dwattr $C$DW$156, DW_AT_TI_symbol_name("_GPIO46")
    2052                      .dwattr $C$DW$156, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x02)
    2053                      .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2054                      .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    2055              $C$DW$157       .dwtag  DW_TAG_member
    2056                      .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$19)
    2057                      .dwattr $C$DW$157, DW_AT_name("GPIO47")
    2058                      .dwattr $C$DW$157, DW_AT_TI_symbol_name("_GPIO47")
    2059                      .dwattr $C$DW$157, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x02)
    2060                      .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2061                      .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    2062                      .dwendtag $C$DW$T$29
    2063              
    2064              
    2065              $C$DW$T$30      .dwtag  DW_TAG_union_type
    2066                      .dwattr $C$DW$T$30, DW_AT_name("GPB1_REG")
    2067                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x02)
    2068              $C$DW$158       .dwtag  DW_TAG_member
    2069                      .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$21)
    2070                      .dwattr $C$DW$158, DW_AT_name("all")
    2071                      .dwattr $C$DW$158, DW_AT_TI_symbol_name("_all")
    2072                      .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2073                      .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    2074              $C$DW$159       .dwtag  DW_TAG_member
    2075                      .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$29)
    2076                      .dwattr $C$DW$159, DW_AT_name("bit")
    2077                      .dwattr $C$DW$159, DW_AT_TI_symbol_name("_bit")
    2078                      .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2079                      .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    2080                      .dwendtag $C$DW$T$30
    2081              
    2082              
    2083              $C$DW$T$31      .dwtag  DW_TAG_structure_type
    2084                      .dwattr $C$DW$T$31, DW_AT_name("GPB2_BITS")
    2085                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x02)
    2086              $C$DW$160       .dwtag  DW_TAG_member
    2087                      .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$19)
    2088                      .dwattr $C$DW$160, DW_AT_name("GPIO48")
    2089                      .dwattr $C$DW$160, DW_AT_TI_symbol_name("_GPIO48")
    2090                      .dwattr $C$DW$160, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x02)
    2091                      .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2092                      .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    2093              $C$DW$161       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:12 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0612810                           PAGE   41

    2094                      .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$19)
    2095                      .dwattr $C$DW$161, DW_AT_name("GPIO49")
    2096                      .dwattr $C$DW$161, DW_AT_TI_symbol_name("_GPIO49")
    2097                      .dwattr $C$DW$161, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x02)
    2098                      .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2099                      .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    2100              $C$DW$162       .dwtag  DW_TAG_member
    2101                      .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$19)
    2102                      .dwattr $C$DW$162, DW_AT_name("GPIO50")
    2103                      .dwattr $C$DW$162, DW_AT_TI_symbol_name("_GPIO50")
    2104                      .dwattr $C$DW$162, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x02)
    2105                      .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2106                      .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    2107              $C$DW$163       .dwtag  DW_TAG_member
    2108                      .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$19)
    2109                      .dwattr $C$DW$163, DW_AT_name("GPIO51")
    2110                      .dwattr $C$DW$163, DW_AT_TI_symbol_name("_GPIO51")
    2111                      .dwattr $C$DW$163, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x02)
    2112                      .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2113                      .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    2114              $C$DW$164       .dwtag  DW_TAG_member
    2115                      .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$19)
    2116                      .dwattr $C$DW$164, DW_AT_name("GPIO52")
    2117                      .dwattr $C$DW$164, DW_AT_TI_symbol_name("_GPIO52")
    2118                      .dwattr $C$DW$164, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x02)
    2119                      .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2120                      .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    2121              $C$DW$165       .dwtag  DW_TAG_member
    2122                      .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$19)
    2123                      .dwattr $C$DW$165, DW_AT_name("GPIO53")
    2124                      .dwattr $C$DW$165, DW_AT_TI_symbol_name("_GPIO53")
    2125                      .dwattr $C$DW$165, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x02)
    2126                      .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2127                      .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    2128              $C$DW$166       .dwtag  DW_TAG_member
    2129                      .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$19)
    2130                      .dwattr $C$DW$166, DW_AT_name("GPIO54")
    2131                      .dwattr $C$DW$166, DW_AT_TI_symbol_name("_GPIO54")
    2132                      .dwattr $C$DW$166, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x02)
    2133                      .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2134                      .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    2135              $C$DW$167       .dwtag  DW_TAG_member
    2136                      .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$19)
    2137                      .dwattr $C$DW$167, DW_AT_name("GPIO55")
    2138                      .dwattr $C$DW$167, DW_AT_TI_symbol_name("_GPIO55")
    2139                      .dwattr $C$DW$167, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x02)
    2140                      .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2141                      .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    2142              $C$DW$168       .dwtag  DW_TAG_member
    2143                      .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$19)
    2144                      .dwattr $C$DW$168, DW_AT_name("GPIO56")
    2145                      .dwattr $C$DW$168, DW_AT_TI_symbol_name("_GPIO56")
    2146                      .dwattr $C$DW$168, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x02)
    2147                      .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2148                      .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:12 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0612810                           PAGE   42

    2149              $C$DW$169       .dwtag  DW_TAG_member
    2150                      .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$19)
    2151                      .dwattr $C$DW$169, DW_AT_name("GPIO57")
    2152                      .dwattr $C$DW$169, DW_AT_TI_symbol_name("_GPIO57")
    2153                      .dwattr $C$DW$169, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x02)
    2154                      .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2155                      .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    2156              $C$DW$170       .dwtag  DW_TAG_member
    2157                      .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$19)
    2158                      .dwattr $C$DW$170, DW_AT_name("GPIO58")
    2159                      .dwattr $C$DW$170, DW_AT_TI_symbol_name("_GPIO58")
    2160                      .dwattr $C$DW$170, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x02)
    2161                      .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2162                      .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    2163              $C$DW$171       .dwtag  DW_TAG_member
    2164                      .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$19)
    2165                      .dwattr $C$DW$171, DW_AT_name("GPIO59")
    2166                      .dwattr $C$DW$171, DW_AT_TI_symbol_name("_GPIO59")
    2167                      .dwattr $C$DW$171, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x02)
    2168                      .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2169                      .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    2170              $C$DW$172       .dwtag  DW_TAG_member
    2171                      .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$19)
    2172                      .dwattr $C$DW$172, DW_AT_name("GPIO60")
    2173                      .dwattr $C$DW$172, DW_AT_TI_symbol_name("_GPIO60")
    2174                      .dwattr $C$DW$172, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x02)
    2175                      .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2176                      .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    2177              $C$DW$173       .dwtag  DW_TAG_member
    2178                      .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$19)
    2179                      .dwattr $C$DW$173, DW_AT_name("GPIO61")
    2180                      .dwattr $C$DW$173, DW_AT_TI_symbol_name("_GPIO61")
    2181                      .dwattr $C$DW$173, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x02)
    2182                      .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2183                      .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
    2184              $C$DW$174       .dwtag  DW_TAG_member
    2185                      .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$19)
    2186                      .dwattr $C$DW$174, DW_AT_name("GPIO62")
    2187                      .dwattr $C$DW$174, DW_AT_TI_symbol_name("_GPIO62")
    2188                      .dwattr $C$DW$174, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x02)
    2189                      .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2190                      .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
    2191              $C$DW$175       .dwtag  DW_TAG_member
    2192                      .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$19)
    2193                      .dwattr $C$DW$175, DW_AT_name("GPIO63")
    2194                      .dwattr $C$DW$175, DW_AT_TI_symbol_name("_GPIO63")
    2195                      .dwattr $C$DW$175, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x02)
    2196                      .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2197                      .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
    2198                      .dwendtag $C$DW$T$31
    2199              
    2200              
    2201              $C$DW$T$32      .dwtag  DW_TAG_union_type
    2202                      .dwattr $C$DW$T$32, DW_AT_name("GPB2_REG")
    2203                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x02)
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:12 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0612810                           PAGE   43

    2204              $C$DW$176       .dwtag  DW_TAG_member
    2205                      .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$21)
    2206                      .dwattr $C$DW$176, DW_AT_name("all")
    2207                      .dwattr $C$DW$176, DW_AT_TI_symbol_name("_all")
    2208                      .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2209                      .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
    2210              $C$DW$177       .dwtag  DW_TAG_member
    2211                      .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$31)
    2212                      .dwattr $C$DW$177, DW_AT_name("bit")
    2213                      .dwattr $C$DW$177, DW_AT_TI_symbol_name("_bit")
    2214                      .dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2215                      .dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
    2216                      .dwendtag $C$DW$T$32
    2217              
    2218              
    2219              $C$DW$T$33      .dwtag  DW_TAG_structure_type
    2220                      .dwattr $C$DW$T$33, DW_AT_name("GPBCTRL_BITS")
    2221                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x02)
    2222              $C$DW$178       .dwtag  DW_TAG_member
    2223                      .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$19)
    2224                      .dwattr $C$DW$178, DW_AT_name("QUALPRD0")
    2225                      .dwattr $C$DW$178, DW_AT_TI_symbol_name("_QUALPRD0")
    2226                      .dwattr $C$DW$178, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x08)
    2227                      .dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2228                      .dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
    2229              $C$DW$179       .dwtag  DW_TAG_member
    2230                      .dwattr $C$DW$179, DW_AT_type(*$C$DW$T$19)
    2231                      .dwattr $C$DW$179, DW_AT_name("QUALPRD1")
    2232                      .dwattr $C$DW$179, DW_AT_TI_symbol_name("_QUALPRD1")
    2233                      .dwattr $C$DW$179, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x08)
    2234                      .dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2235                      .dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
    2236              $C$DW$180       .dwtag  DW_TAG_member
    2237                      .dwattr $C$DW$180, DW_AT_type(*$C$DW$T$19)
    2238                      .dwattr $C$DW$180, DW_AT_name("QUALPRD2")
    2239                      .dwattr $C$DW$180, DW_AT_TI_symbol_name("_QUALPRD2")
    2240                      .dwattr $C$DW$180, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x08)
    2241                      .dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2242                      .dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
    2243              $C$DW$181       .dwtag  DW_TAG_member
    2244                      .dwattr $C$DW$181, DW_AT_type(*$C$DW$T$19)
    2245                      .dwattr $C$DW$181, DW_AT_name("QUALPRD3")
    2246                      .dwattr $C$DW$181, DW_AT_TI_symbol_name("_QUALPRD3")
    2247                      .dwattr $C$DW$181, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x08)
    2248                      .dwattr $C$DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2249                      .dwattr $C$DW$181, DW_AT_accessibility(DW_ACCESS_public)
    2250                      .dwendtag $C$DW$T$33
    2251              
    2252              
    2253              $C$DW$T$34      .dwtag  DW_TAG_union_type
    2254                      .dwattr $C$DW$T$34, DW_AT_name("GPBCTRL_REG")
    2255                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x02)
    2256              $C$DW$182       .dwtag  DW_TAG_member
    2257                      .dwattr $C$DW$182, DW_AT_type(*$C$DW$T$21)
    2258                      .dwattr $C$DW$182, DW_AT_name("all")
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:12 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0612810                           PAGE   44

    2259                      .dwattr $C$DW$182, DW_AT_TI_symbol_name("_all")
    2260                      .dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2261                      .dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)
    2262              $C$DW$183       .dwtag  DW_TAG_member
    2263                      .dwattr $C$DW$183, DW_AT_type(*$C$DW$T$33)
    2264                      .dwattr $C$DW$183, DW_AT_name("bit")
    2265                      .dwattr $C$DW$183, DW_AT_TI_symbol_name("_bit")
    2266                      .dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2267                      .dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
    2268                      .dwendtag $C$DW$T$34
    2269              
    2270              
    2271              $C$DW$T$35      .dwtag  DW_TAG_structure_type
    2272                      .dwattr $C$DW$T$35, DW_AT_name("GPBDAT_BITS")
    2273                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x02)
    2274              $C$DW$184       .dwtag  DW_TAG_member
    2275                      .dwattr $C$DW$184, DW_AT_type(*$C$DW$T$19)
    2276                      .dwattr $C$DW$184, DW_AT_name("GPIO32")
    2277                      .dwattr $C$DW$184, DW_AT_TI_symbol_name("_GPIO32")
    2278                      .dwattr $C$DW$184, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    2279                      .dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2280                      .dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
    2281              $C$DW$185       .dwtag  DW_TAG_member
    2282                      .dwattr $C$DW$185, DW_AT_type(*$C$DW$T$19)
    2283                      .dwattr $C$DW$185, DW_AT_name("GPIO33")
    2284                      .dwattr $C$DW$185, DW_AT_TI_symbol_name("_GPIO33")
    2285                      .dwattr $C$DW$185, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    2286                      .dwattr $C$DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2287                      .dwattr $C$DW$185, DW_AT_accessibility(DW_ACCESS_public)
    2288              $C$DW$186       .dwtag  DW_TAG_member
    2289                      .dwattr $C$DW$186, DW_AT_type(*$C$DW$T$19)
    2290                      .dwattr $C$DW$186, DW_AT_name("GPIO34")
    2291                      .dwattr $C$DW$186, DW_AT_TI_symbol_name("_GPIO34")
    2292                      .dwattr $C$DW$186, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    2293                      .dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2294                      .dwattr $C$DW$186, DW_AT_accessibility(DW_ACCESS_public)
    2295              $C$DW$187       .dwtag  DW_TAG_member
    2296                      .dwattr $C$DW$187, DW_AT_type(*$C$DW$T$19)
    2297                      .dwattr $C$DW$187, DW_AT_name("GPIO35")
    2298                      .dwattr $C$DW$187, DW_AT_TI_symbol_name("_GPIO35")
    2299                      .dwattr $C$DW$187, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    2300                      .dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2301                      .dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)
    2302              $C$DW$188       .dwtag  DW_TAG_member
    2303                      .dwattr $C$DW$188, DW_AT_type(*$C$DW$T$19)
    2304                      .dwattr $C$DW$188, DW_AT_name("GPIO36")
    2305                      .dwattr $C$DW$188, DW_AT_TI_symbol_name("_GPIO36")
    2306                      .dwattr $C$DW$188, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    2307                      .dwattr $C$DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2308                      .dwattr $C$DW$188, DW_AT_accessibility(DW_ACCESS_public)
    2309              $C$DW$189       .dwtag  DW_TAG_member
    2310                      .dwattr $C$DW$189, DW_AT_type(*$C$DW$T$19)
    2311                      .dwattr $C$DW$189, DW_AT_name("GPIO37")
    2312                      .dwattr $C$DW$189, DW_AT_TI_symbol_name("_GPIO37")
    2313                      .dwattr $C$DW$189, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:12 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0612810                           PAGE   45

    2314                      .dwattr $C$DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2315                      .dwattr $C$DW$189, DW_AT_accessibility(DW_ACCESS_public)
    2316              $C$DW$190       .dwtag  DW_TAG_member
    2317                      .dwattr $C$DW$190, DW_AT_type(*$C$DW$T$19)
    2318                      .dwattr $C$DW$190, DW_AT_name("GPIO38")
    2319                      .dwattr $C$DW$190, DW_AT_TI_symbol_name("_GPIO38")
    2320                      .dwattr $C$DW$190, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    2321                      .dwattr $C$DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2322                      .dwattr $C$DW$190, DW_AT_accessibility(DW_ACCESS_public)
    2323              $C$DW$191       .dwtag  DW_TAG_member
    2324                      .dwattr $C$DW$191, DW_AT_type(*$C$DW$T$19)
    2325                      .dwattr $C$DW$191, DW_AT_name("GPIO39")
    2326                      .dwattr $C$DW$191, DW_AT_TI_symbol_name("_GPIO39")
    2327                      .dwattr $C$DW$191, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    2328                      .dwattr $C$DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2329                      .dwattr $C$DW$191, DW_AT_accessibility(DW_ACCESS_public)
    2330              $C$DW$192       .dwtag  DW_TAG_member
    2331                      .dwattr $C$DW$192, DW_AT_type(*$C$DW$T$19)
    2332                      .dwattr $C$DW$192, DW_AT_name("GPIO40")
    2333                      .dwattr $C$DW$192, DW_AT_TI_symbol_name("_GPIO40")
    2334                      .dwattr $C$DW$192, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
    2335                      .dwattr $C$DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2336                      .dwattr $C$DW$192, DW_AT_accessibility(DW_ACCESS_public)
    2337              $C$DW$193       .dwtag  DW_TAG_member
    2338                      .dwattr $C$DW$193, DW_AT_type(*$C$DW$T$19)
    2339                      .dwattr $C$DW$193, DW_AT_name("GPIO41")
    2340                      .dwattr $C$DW$193, DW_AT_TI_symbol_name("_GPIO41")
    2341                      .dwattr $C$DW$193, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    2342                      .dwattr $C$DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2343                      .dwattr $C$DW$193, DW_AT_accessibility(DW_ACCESS_public)
    2344              $C$DW$194       .dwtag  DW_TAG_member
    2345                      .dwattr $C$DW$194, DW_AT_type(*$C$DW$T$19)
    2346                      .dwattr $C$DW$194, DW_AT_name("GPIO42")
    2347                      .dwattr $C$DW$194, DW_AT_TI_symbol_name("_GPIO42")
    2348                      .dwattr $C$DW$194, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
    2349                      .dwattr $C$DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2350                      .dwattr $C$DW$194, DW_AT_accessibility(DW_ACCESS_public)
    2351              $C$DW$195       .dwtag  DW_TAG_member
    2352                      .dwattr $C$DW$195, DW_AT_type(*$C$DW$T$19)
    2353                      .dwattr $C$DW$195, DW_AT_name("GPIO43")
    2354                      .dwattr $C$DW$195, DW_AT_TI_symbol_name("_GPIO43")
    2355                      .dwattr $C$DW$195, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
    2356                      .dwattr $C$DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2357                      .dwattr $C$DW$195, DW_AT_accessibility(DW_ACCESS_public)
    2358              $C$DW$196       .dwtag  DW_TAG_member
    2359                      .dwattr $C$DW$196, DW_AT_type(*$C$DW$T$19)
    2360                      .dwattr $C$DW$196, DW_AT_name("GPIO44")
    2361                      .dwattr $C$DW$196, DW_AT_TI_symbol_name("_GPIO44")
    2362                      .dwattr $C$DW$196, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
    2363                      .dwattr $C$DW$196, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2364                      .dwattr $C$DW$196, DW_AT_accessibility(DW_ACCESS_public)
    2365              $C$DW$197       .dwtag  DW_TAG_member
    2366                      .dwattr $C$DW$197, DW_AT_type(*$C$DW$T$19)
    2367                      .dwattr $C$DW$197, DW_AT_name("GPIO45")
    2368                      .dwattr $C$DW$197, DW_AT_TI_symbol_name("_GPIO45")
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:12 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0612810                           PAGE   46

    2369                      .dwattr $C$DW$197, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
    2370                      .dwattr $C$DW$197, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2371                      .dwattr $C$DW$197, DW_AT_accessibility(DW_ACCESS_public)
    2372              $C$DW$198       .dwtag  DW_TAG_member
    2373                      .dwattr $C$DW$198, DW_AT_type(*$C$DW$T$19)
    2374                      .dwattr $C$DW$198, DW_AT_name("GPIO46")
    2375                      .dwattr $C$DW$198, DW_AT_TI_symbol_name("_GPIO46")
    2376                      .dwattr $C$DW$198, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
    2377                      .dwattr $C$DW$198, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2378                      .dwattr $C$DW$198, DW_AT_accessibility(DW_ACCESS_public)
    2379              $C$DW$199       .dwtag  DW_TAG_member
    2380                      .dwattr $C$DW$199, DW_AT_type(*$C$DW$T$19)
    2381                      .dwattr $C$DW$199, DW_AT_name("GPIO47")
    2382                      .dwattr $C$DW$199, DW_AT_TI_symbol_name("_GPIO47")
    2383                      .dwattr $C$DW$199, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    2384                      .dwattr $C$DW$199, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2385                      .dwattr $C$DW$199, DW_AT_accessibility(DW_ACCESS_public)
    2386              $C$DW$200       .dwtag  DW_TAG_member
    2387                      .dwattr $C$DW$200, DW_AT_type(*$C$DW$T$19)
    2388                      .dwattr $C$DW$200, DW_AT_name("GPIO48")
    2389                      .dwattr $C$DW$200, DW_AT_TI_symbol_name("_GPIO48")
    2390                      .dwattr $C$DW$200, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    2391                      .dwattr $C$DW$200, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2392                      .dwattr $C$DW$200, DW_AT_accessibility(DW_ACCESS_public)
    2393              $C$DW$201       .dwtag  DW_TAG_member
    2394                      .dwattr $C$DW$201, DW_AT_type(*$C$DW$T$19)
    2395                      .dwattr $C$DW$201, DW_AT_name("GPIO49")
    2396                      .dwattr $C$DW$201, DW_AT_TI_symbol_name("_GPIO49")
    2397                      .dwattr $C$DW$201, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    2398                      .dwattr $C$DW$201, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2399                      .dwattr $C$DW$201, DW_AT_accessibility(DW_ACCESS_public)
    2400              $C$DW$202       .dwtag  DW_TAG_member
    2401                      .dwattr $C$DW$202, DW_AT_type(*$C$DW$T$19)
    2402                      .dwattr $C$DW$202, DW_AT_name("GPIO50")
    2403                      .dwattr $C$DW$202, DW_AT_TI_symbol_name("_GPIO50")
    2404                      .dwattr $C$DW$202, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    2405                      .dwattr $C$DW$202, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2406                      .dwattr $C$DW$202, DW_AT_accessibility(DW_ACCESS_public)
    2407              $C$DW$203       .dwtag  DW_TAG_member
    2408                      .dwattr $C$DW$203, DW_AT_type(*$C$DW$T$19)
    2409                      .dwattr $C$DW$203, DW_AT_name("GPIO51")
    2410                      .dwattr $C$DW$203, DW_AT_TI_symbol_name("_GPIO51")
    2411                      .dwattr $C$DW$203, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    2412                      .dwattr $C$DW$203, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2413                      .dwattr $C$DW$203, DW_AT_accessibility(DW_ACCESS_public)
    2414              $C$DW$204       .dwtag  DW_TAG_member
    2415                      .dwattr $C$DW$204, DW_AT_type(*$C$DW$T$19)
    2416                      .dwattr $C$DW$204, DW_AT_name("GPIO52")
    2417                      .dwattr $C$DW$204, DW_AT_TI_symbol_name("_GPIO52")
    2418                      .dwattr $C$DW$204, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    2419                      .dwattr $C$DW$204, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2420                      .dwattr $C$DW$204, DW_AT_accessibility(DW_ACCESS_public)
    2421              $C$DW$205       .dwtag  DW_TAG_member
    2422                      .dwattr $C$DW$205, DW_AT_type(*$C$DW$T$19)
    2423                      .dwattr $C$DW$205, DW_AT_name("GPIO53")
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:12 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0612810                           PAGE   47

    2424                      .dwattr $C$DW$205, DW_AT_TI_symbol_name("_GPIO53")
    2425                      .dwattr $C$DW$205, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    2426                      .dwattr $C$DW$205, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2427                      .dwattr $C$DW$205, DW_AT_accessibility(DW_ACCESS_public)
    2428              $C$DW$206       .dwtag  DW_TAG_member
    2429                      .dwattr $C$DW$206, DW_AT_type(*$C$DW$T$19)
    2430                      .dwattr $C$DW$206, DW_AT_name("GPIO54")
    2431                      .dwattr $C$DW$206, DW_AT_TI_symbol_name("_GPIO54")
    2432                      .dwattr $C$DW$206, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    2433                      .dwattr $C$DW$206, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2434                      .dwattr $C$DW$206, DW_AT_accessibility(DW_ACCESS_public)
    2435              $C$DW$207       .dwtag  DW_TAG_member
    2436                      .dwattr $C$DW$207, DW_AT_type(*$C$DW$T$19)
    2437                      .dwattr $C$DW$207, DW_AT_name("GPIO55")
    2438                      .dwattr $C$DW$207, DW_AT_TI_symbol_name("_GPIO55")
    2439                      .dwattr $C$DW$207, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    2440                      .dwattr $C$DW$207, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2441                      .dwattr $C$DW$207, DW_AT_accessibility(DW_ACCESS_public)
    2442              $C$DW$208       .dwtag  DW_TAG_member
    2443                      .dwattr $C$DW$208, DW_AT_type(*$C$DW$T$19)
    2444                      .dwattr $C$DW$208, DW_AT_name("GPIO56")
    2445                      .dwattr $C$DW$208, DW_AT_TI_symbol_name("_GPIO56")
    2446                      .dwattr $C$DW$208, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
    2447                      .dwattr $C$DW$208, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2448                      .dwattr $C$DW$208, DW_AT_accessibility(DW_ACCESS_public)
    2449              $C$DW$209       .dwtag  DW_TAG_member
    2450                      .dwattr $C$DW$209, DW_AT_type(*$C$DW$T$19)
    2451                      .dwattr $C$DW$209, DW_AT_name("GPIO57")
    2452                      .dwattr $C$DW$209, DW_AT_TI_symbol_name("_GPIO57")
    2453                      .dwattr $C$DW$209, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    2454                      .dwattr $C$DW$209, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2455                      .dwattr $C$DW$209, DW_AT_accessibility(DW_ACCESS_public)
    2456              $C$DW$210       .dwtag  DW_TAG_member
    2457                      .dwattr $C$DW$210, DW_AT_type(*$C$DW$T$19)
    2458                      .dwattr $C$DW$210, DW_AT_name("GPIO58")
    2459                      .dwattr $C$DW$210, DW_AT_TI_symbol_name("_GPIO58")
    2460                      .dwattr $C$DW$210, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
    2461                      .dwattr $C$DW$210, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2462                      .dwattr $C$DW$210, DW_AT_accessibility(DW_ACCESS_public)
    2463              $C$DW$211       .dwtag  DW_TAG_member
    2464                      .dwattr $C$DW$211, DW_AT_type(*$C$DW$T$19)
    2465                      .dwattr $C$DW$211, DW_AT_name("GPIO59")
    2466                      .dwattr $C$DW$211, DW_AT_TI_symbol_name("_GPIO59")
    2467                      .dwattr $C$DW$211, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
    2468                      .dwattr $C$DW$211, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2469                      .dwattr $C$DW$211, DW_AT_accessibility(DW_ACCESS_public)
    2470              $C$DW$212       .dwtag  DW_TAG_member
    2471                      .dwattr $C$DW$212, DW_AT_type(*$C$DW$T$19)
    2472                      .dwattr $C$DW$212, DW_AT_name("GPIO60")
    2473                      .dwattr $C$DW$212, DW_AT_TI_symbol_name("_GPIO60")
    2474                      .dwattr $C$DW$212, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
    2475                      .dwattr $C$DW$212, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2476                      .dwattr $C$DW$212, DW_AT_accessibility(DW_ACCESS_public)
    2477              $C$DW$213       .dwtag  DW_TAG_member
    2478                      .dwattr $C$DW$213, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:12 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0612810                           PAGE   48

    2479                      .dwattr $C$DW$213, DW_AT_name("GPIO61")
    2480                      .dwattr $C$DW$213, DW_AT_TI_symbol_name("_GPIO61")
    2481                      .dwattr $C$DW$213, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
    2482                      .dwattr $C$DW$213, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2483                      .dwattr $C$DW$213, DW_AT_accessibility(DW_ACCESS_public)
    2484              $C$DW$214       .dwtag  DW_TAG_member
    2485                      .dwattr $C$DW$214, DW_AT_type(*$C$DW$T$19)
    2486                      .dwattr $C$DW$214, DW_AT_name("GPIO62")
    2487                      .dwattr $C$DW$214, DW_AT_TI_symbol_name("_GPIO62")
    2488                      .dwattr $C$DW$214, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
    2489                      .dwattr $C$DW$214, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2490                      .dwattr $C$DW$214, DW_AT_accessibility(DW_ACCESS_public)
    2491              $C$DW$215       .dwtag  DW_TAG_member
    2492                      .dwattr $C$DW$215, DW_AT_type(*$C$DW$T$19)
    2493                      .dwattr $C$DW$215, DW_AT_name("GPIO63")
    2494                      .dwattr $C$DW$215, DW_AT_TI_symbol_name("_GPIO63")
    2495                      .dwattr $C$DW$215, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    2496                      .dwattr $C$DW$215, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2497                      .dwattr $C$DW$215, DW_AT_accessibility(DW_ACCESS_public)
    2498                      .dwendtag $C$DW$T$35
    2499              
    2500              
    2501              $C$DW$T$36      .dwtag  DW_TAG_union_type
    2502                      .dwattr $C$DW$T$36, DW_AT_name("GPBDAT_REG")
    2503                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x02)
    2504              $C$DW$216       .dwtag  DW_TAG_member
    2505                      .dwattr $C$DW$216, DW_AT_type(*$C$DW$T$21)
    2506                      .dwattr $C$DW$216, DW_AT_name("all")
    2507                      .dwattr $C$DW$216, DW_AT_TI_symbol_name("_all")
    2508                      .dwattr $C$DW$216, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2509                      .dwattr $C$DW$216, DW_AT_accessibility(DW_ACCESS_public)
    2510              $C$DW$217       .dwtag  DW_TAG_member
    2511                      .dwattr $C$DW$217, DW_AT_type(*$C$DW$T$35)
    2512                      .dwattr $C$DW$217, DW_AT_name("bit")
    2513                      .dwattr $C$DW$217, DW_AT_TI_symbol_name("_bit")
    2514                      .dwattr $C$DW$217, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2515                      .dwattr $C$DW$217, DW_AT_accessibility(DW_ACCESS_public)
    2516                      .dwendtag $C$DW$T$36
    2517              
    2518              
    2519              $C$DW$T$37      .dwtag  DW_TAG_structure_type
    2520                      .dwattr $C$DW$T$37, DW_AT_name("GPC1_BITS")
    2521                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x02)
    2522              $C$DW$218       .dwtag  DW_TAG_member
