TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:14 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0580410                           PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v6.2.7 *
       3              ;* Date/Time created: Thu Jul 02 08:31:14 2015                 *
       4              ;***************************************************************
       5                      .compiler_opts --diag_wrap=off --float_support=fpu32 --hll_source=on --mem_model:code=flat --mem_mode
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("../UART/rs485Timer.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v6.2.7 Copyright (c) 1996-2014 Texas I
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("D:\ActiveProject\EKT5\PKMT_NONBIOS\InvertorCntrl\ISPprg")
      13              $C$DW$1 .dwtag  DW_TAG_variable, DW_AT_name("PieCtrlRegs")
      14                      .dwattr $C$DW$1, DW_AT_TI_symbol_name("_PieCtrlRegs")
      15                      .dwattr $C$DW$1, DW_AT_type(*$C$DW$T$84)

     252 00000033 1815!         AND       @_ECap5Regs+21,#0xffef ; [CPU_] |57| 
         00000034 FFEF 
     253                      .dwpsn  file "../UART/rs485Timer.c",line 58,column 2,is_stmt
     254 00000035 0200          MOVB      ACC,#0                ; [CPU_] |58| 
     255 00000036 1E00!         MOVL      @_ECap5Regs,ACC       ; [CPU_] |58| 
     256                      .dwpsn  file "../UART/rs485Timer.c",line 63,column 2,is_stmt
     257 00000037 1E02!         MOVL      @_ECap5Regs+2,ACC     ; [CPU_] |63| 
     258                      .dwpsn  file "../UART/rs485Timer.c",line 64,column 2,is_stmt
     259 00000038 1A15!         OR        @_ECap5Regs+21,#0x0200 ; [CPU_] |64| 
         00000039 0200 
     260                      .dwpsn  file "../UART/rs485Timer.c",line 65,column 2,is_stmt
     261 0000003a 1A15!         OR        @_ECap5Regs+21,#0x0400 ; [CPU_] |65| 
         0000003b 0400 
     262                      .dwpsn  file "../UART/rs485Timer.c",line 66,column 2,is_stmt
     263 0000003c 1815!         AND       @_ECap5Regs+21,#0xffdf ; [CPU_] |66| 
         0000003d FFDF 
     264                      .dwpsn  file "../UART/rs485Timer.c",line 67,column 2,is_stmt
     265 0000003e 1A15!         OR        @_ECap5Regs+21,#0x00c0 ; [CPU_] |67| 
         0000003f 00C0 
     266                      .dwpsn  file "../UART/rs485Timer.c",line 70,column 2,is_stmt
     267 00000040 8F01          MOVL      XAR4,#105001          ; [CPU_U] |70| 
         00000041 9A29 
     268 00000042 A804!         MOVL      @_ECap5Regs+4,XAR4    ; [CPU_] |70| 
     269                      .dwpsn  file "../UART/rs485Timer.c",line 71,column 2,is_stmt
     270 00000043 A808!         MOVL      @_ECap5Regs+8,XAR4    ; [CPU_] |71| 
     271                      .dwpsn  file "../UART/rs485Timer.c",line 72,column 2,is_stmt
     272 00000044 8F01          MOVL      XAR4,#104999          ; [CPU_U] |72| 
         00000045 9A27 
     273 00000046 A806!         MOVL      @_ECap5Regs+6,XAR4    ; [CPU_] |72| 
     274                      .dwpsn  file "../UART/rs485Timer.c",line 73,column 2,is_stmt
     275 00000047 A80A!         MOVL      @_ECap5Regs+10,XAR4   ; [CPU_] |73| 
     276                      .dwpsn  file "../UART/rs485Timer.c",line 75,column 2,is_stmt
     277 00000048 1A15!         OR        @_ECap5Regs+21,#0x0010 ; [CPU_] |75| 
         00000049 0010 
     278                      .dwpsn  file "../UART/rs485Timer.c",line 77,column 2,is_stmt
     279 0000004a 56BF!         MOVB      @_ECap5Regs+24,#255,UNC ; [CPU_] |77| 
         0000004b FF18 
     280                      .dwpsn  file "../UART/rs485Timer.c",line 78,column 2,is_stmt
     281 0000004c 761F!         MOVW      DP,#_PieCtrlRegs+1    ; [CPU_U] 
         0000004d 0000 
     282 0000004e 56BF!         MOVB      @_PieCtrlRegs+1,#8,UNC ; [CPU_] |78| 
         0000004f 0801 
     283                      .dwpsn  file "../UART/rs485Timer.c",line 79,column 2,is_stmt
     284 00000050 761F!         MOVW      DP,#_ECap5Regs+22     ; [CPU_U] 
         00000051 0000 
     285 00000052 1A16!         OR        @_ECap5Regs+22,#0x0040 ; [CPU_] |79| 
         00000053 0040 
     286                      .dwpsn  file "../UART/rs485Timer.c",line 80,column 2,is_stmt
     287 00000054 761F!         MOVW      DP,#_PieCtrlRegs+8    ; [CPU_U] 
         00000055 0000 
     288 00000056 1A08!         OR        @_PieCtrlRegs+8,#0x0010 ; [CPU_] |80| 
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:14 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0580410                           PAGE    7

         00000057 0010 
     289                      .dwpsn  file "../UART/rs485Timer.c",line 81,column 5,is_stmt
     290 00000058 7623          OR        IER,#0x0008           ; [CPU_] |81| 
         00000059 0008 
     291                      .dwpsn  file "../UART/rs485Timer.c",line 82,column 1,is_stmt
     292 0000005a FF69          SPM       #0                    ; [CPU_] 
     293              $C$DW$14        .dwtag  DW_TAG_TI_branch
     294                      .dwattr $C$DW$14, DW_AT_low_pc(0x00)
     295                      .dwattr $C$DW$14, DW_AT_TI_return
     296 0000005b 0006          LRETR     ; [CPU_] 
     297                      ; return occurs ; [] 
     298                      .dwattr $C$DW$13, DW_AT_TI_end_file("../UART/rs485Timer.c")
     299                      .dwattr $C$DW$13, DW_AT_TI_end_line(0x52)
     300                      .dwattr $C$DW$13, DW_AT_TI_end_column(0x01)
     301                      .dwendentry
     302                      .dwendtag $C$DW$13
     303              
     304              ;**************************************************************
     305              ;* UNDEFINED EXTERNAL REFERENCES                              *
     306              ;**************************************************************
     307                      .global _PieCtrlRegs
     308                      .global _GpioDataRegs
     309                      .global _ECap5Regs
     310                      .global _GpioCtrlRegs
     311                      .global _PieVectTable
     312              
     313              ;***************************************************************
     314              ;* TYPE INFORMATION                                            *
     315              ;***************************************************************
     316              
     317              $C$DW$T$23      .dwtag  DW_TAG_structure_type
     318                      .dwattr $C$DW$T$23, DW_AT_name("ECAP_REGS")
     319                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x20)
     320              $C$DW$15        .dwtag  DW_TAG_member
     321                      .dwattr $C$DW$15, DW_AT_type(*$C$DW$T$19)
     322                      .dwattr $C$DW$15, DW_AT_name("TSCTR")
     323                      .dwattr $C$DW$15, DW_AT_TI_symbol_name("_TSCTR")
     324                      .dwattr $C$DW$15, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     325                      .dwattr $C$DW$15, DW_AT_accessibility(DW_ACCESS_public)
     326              $C$DW$16        .dwtag  DW_TAG_member
     327                      .dwattr $C$DW$16, DW_AT_type(*$C$DW$T$19)
     328                      .dwattr $C$DW$16, DW_AT_name("CTRPHS")
     329                      .dwattr $C$DW$16, DW_AT_TI_symbol_name("_CTRPHS")
     330                      .dwattr $C$DW$16, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     331                      .dwattr $C$DW$16, DW_AT_accessibility(DW_ACCESS_public)
     332              $C$DW$17        .dwtag  DW_TAG_member
     333                      .dwattr $C$DW$17, DW_AT_type(*$C$DW$T$19)
     334                      .dwattr $C$DW$17, DW_AT_name("CAP1")
     335                      .dwattr $C$DW$17, DW_AT_TI_symbol_name("_CAP1")
     336                      .dwattr $C$DW$17, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     337                      .dwattr $C$DW$17, DW_AT_accessibility(DW_ACCESS_public)
     338              $C$DW$18        .dwtag  DW_TAG_member
     339                      .dwattr $C$DW$18, DW_AT_type(*$C$DW$T$19)
     340                      .dwattr $C$DW$18, DW_AT_name("CAP2")
     341                      .dwattr $C$DW$18, DW_AT_TI_symbol_name("_CAP2")
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:14 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0580410                           PAGE    8

     342                      .dwattr $C$DW$18, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     343                      .dwattr $C$DW$18, DW_AT_accessibility(DW_ACCESS_public)
     344              $C$DW$19        .dwtag  DW_TAG_member
     345                      .dwattr $C$DW$19, DW_AT_type(*$C$DW$T$19)
     346                      .dwattr $C$DW$19, DW_AT_name("CAP3")
     347                      .dwattr $C$DW$19, DW_AT_TI_symbol_name("_CAP3")
     348                      .dwattr $C$DW$19, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     349                      .dwattr $C$DW$19, DW_AT_accessibility(DW_ACCESS_public)
     350              $C$DW$20        .dwtag  DW_TAG_member
     351                      .dwattr $C$DW$20, DW_AT_type(*$C$DW$T$19)
     352                      .dwattr $C$DW$20, DW_AT_name("CAP4")
     353                      .dwattr $C$DW$20, DW_AT_TI_symbol_name("_CAP4")
     354                      .dwattr $C$DW$20, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
     355                      .dwattr $C$DW$20, DW_AT_accessibility(DW_ACCESS_public)
     356              $C$DW$21        .dwtag  DW_TAG_member
     357                      .dwattr $C$DW$21, DW_AT_type(*$C$DW$T$21)
     358                      .dwattr $C$DW$21, DW_AT_name("rsvd1")
     359                      .dwattr $C$DW$21, DW_AT_TI_symbol_name("_rsvd1")
     360                      .dwattr $C$DW$21, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
     361                      .dwattr $C$DW$21, DW_AT_accessibility(DW_ACCESS_public)
     362              $C$DW$22        .dwtag  DW_TAG_member
     363                      .dwattr $C$DW$22, DW_AT_type(*$C$DW$T$25)
     364                      .dwattr $C$DW$22, DW_AT_name("ECCTL1")
     365                      .dwattr $C$DW$22, DW_AT_TI_symbol_name("_ECCTL1")
     366                      .dwattr $C$DW$22, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
     367                      .dwattr $C$DW$22, DW_AT_accessibility(DW_ACCESS_public)
     368              $C$DW$23        .dwtag  DW_TAG_member
     369                      .dwattr $C$DW$23, DW_AT_type(*$C$DW$T$27)
     370                      .dwattr $C$DW$23, DW_AT_name("ECCTL2")
     371                      .dwattr $C$DW$23, DW_AT_TI_symbol_name("_ECCTL2")
     372                      .dwattr $C$DW$23, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
     373                      .dwattr $C$DW$23, DW_AT_accessibility(DW_ACCESS_public)
     374              $C$DW$24        .dwtag  DW_TAG_member
     375                      .dwattr $C$DW$24, DW_AT_type(*$C$DW$T$29)
     376                      .dwattr $C$DW$24, DW_AT_name("ECEINT")
     377                      .dwattr $C$DW$24, DW_AT_TI_symbol_name("_ECEINT")
     378                      .dwattr $C$DW$24, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
     379                      .dwattr $C$DW$24, DW_AT_accessibility(DW_ACCESS_public)
     380              $C$DW$25        .dwtag  DW_TAG_member
     381                      .dwattr $C$DW$25, DW_AT_type(*$C$DW$T$31)
     382                      .dwattr $C$DW$25, DW_AT_name("ECFLG")
     383                      .dwattr $C$DW$25, DW_AT_TI_symbol_name("_ECFLG")
     384                      .dwattr $C$DW$25, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
     385                      .dwattr $C$DW$25, DW_AT_accessibility(DW_ACCESS_public)
     386              $C$DW$26        .dwtag  DW_TAG_member
     387                      .dwattr $C$DW$26, DW_AT_type(*$C$DW$T$31)
     388                      .dwattr $C$DW$26, DW_AT_name("ECCLR")
     389                      .dwattr $C$DW$26, DW_AT_TI_symbol_name("_ECCLR")
     390                      .dwattr $C$DW$26, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
     391                      .dwattr $C$DW$26, DW_AT_accessibility(DW_ACCESS_public)
     392              $C$DW$27        .dwtag  DW_TAG_member
     393                      .dwattr $C$DW$27, DW_AT_type(*$C$DW$T$29)
     394                      .dwattr $C$DW$27, DW_AT_name("ECFRC")
     395                      .dwattr $C$DW$27, DW_AT_TI_symbol_name("_ECFRC")
     396                      .dwattr $C$DW$27, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:14 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0580410                           PAGE    9

     397                      .dwattr $C$DW$27, DW_AT_accessibility(DW_ACCESS_public)
     398              $C$DW$28        .dwtag  DW_TAG_member
     399                      .dwattr $C$DW$28, DW_AT_type(*$C$DW$T$22)
     400                      .dwattr $C$DW$28, DW_AT_name("rsvd2")
     401                      .dwattr $C$DW$28, DW_AT_TI_symbol_name("_rsvd2")
     402                      .dwattr $C$DW$28, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
     403                      .dwattr $C$DW$28, DW_AT_accessibility(DW_ACCESS_public)
     404                      .dwendtag $C$DW$T$23
     405              
     406              $C$DW$29        .dwtag  DW_TAG_TI_far_type
     407                      .dwattr $C$DW$29, DW_AT_type(*$C$DW$T$23)
     408              $C$DW$T$69      .dwtag  DW_TAG_volatile_type
     409                      .dwattr $C$DW$T$69, DW_AT_type(*$C$DW$29)
     410              
     411              $C$DW$T$24      .dwtag  DW_TAG_structure_type
     412                      .dwattr $C$DW$T$24, DW_AT_name("ECCTL1_BITS")
     413                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x01)
     414              $C$DW$30        .dwtag  DW_TAG_member
     415                      .dwattr $C$DW$30, DW_AT_type(*$C$DW$T$20)
     416                      .dwattr $C$DW$30, DW_AT_name("CAP1POL")
     417                      .dwattr $C$DW$30, DW_AT_TI_symbol_name("_CAP1POL")
     418                      .dwattr $C$DW$30, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
     419                      .dwattr $C$DW$30, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     420                      .dwattr $C$DW$30, DW_AT_accessibility(DW_ACCESS_public)
     421              $C$DW$31        .dwtag  DW_TAG_member
     422                      .dwattr $C$DW$31, DW_AT_type(*$C$DW$T$20)
     423                      .dwattr $C$DW$31, DW_AT_name("CTRRST1")
     424                      .dwattr $C$DW$31, DW_AT_TI_symbol_name("_CTRRST1")
     425                      .dwattr $C$DW$31, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
     426                      .dwattr $C$DW$31, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     427                      .dwattr $C$DW$31, DW_AT_accessibility(DW_ACCESS_public)
     428              $C$DW$32        .dwtag  DW_TAG_member
     429                      .dwattr $C$DW$32, DW_AT_type(*$C$DW$T$20)
     430                      .dwattr $C$DW$32, DW_AT_name("CAP2POL")
     431                      .dwattr $C$DW$32, DW_AT_TI_symbol_name("_CAP2POL")
     432                      .dwattr $C$DW$32, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
     433                      .dwattr $C$DW$32, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     434                      .dwattr $C$DW$32, DW_AT_accessibility(DW_ACCESS_public)
     435              $C$DW$33        .dwtag  DW_TAG_member
     436                      .dwattr $C$DW$33, DW_AT_type(*$C$DW$T$20)
     437                      .dwattr $C$DW$33, DW_AT_name("CTRRST2")
     438                      .dwattr $C$DW$33, DW_AT_TI_symbol_name("_CTRRST2")
     439                      .dwattr $C$DW$33, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
     440                      .dwattr $C$DW$33, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     441                      .dwattr $C$DW$33, DW_AT_accessibility(DW_ACCESS_public)
     442              $C$DW$34        .dwtag  DW_TAG_member
     443                      .dwattr $C$DW$34, DW_AT_type(*$C$DW$T$20)
     444                      .dwattr $C$DW$34, DW_AT_name("CAP3POL")
     445                      .dwattr $C$DW$34, DW_AT_TI_symbol_name("_CAP3POL")
     446                      .dwattr $C$DW$34, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
     447                      .dwattr $C$DW$34, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     448                      .dwattr $C$DW$34, DW_AT_accessibility(DW_ACCESS_public)
     449              $C$DW$35        .dwtag  DW_TAG_member
     450                      .dwattr $C$DW$35, DW_AT_type(*$C$DW$T$20)
     451                      .dwattr $C$DW$35, DW_AT_name("CTRRST3")
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:14 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0580410                           PAGE   10

     452                      .dwattr $C$DW$35, DW_AT_TI_symbol_name("_CTRRST3")
     453                      .dwattr $C$DW$35, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
     454                      .dwattr $C$DW$35, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     455                      .dwattr $C$DW$35, DW_AT_accessibility(DW_ACCESS_public)
     456              $C$DW$36        .dwtag  DW_TAG_member
     457                      .dwattr $C$DW$36, DW_AT_type(*$C$DW$T$20)
     458                      .dwattr $C$DW$36, DW_AT_name("CAP4POL")
     459                      .dwattr $C$DW$36, DW_AT_TI_symbol_name("_CAP4POL")
     460                      .dwattr $C$DW$36, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
     461                      .dwattr $C$DW$36, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     462                      .dwattr $C$DW$36, DW_AT_accessibility(DW_ACCESS_public)
     463              $C$DW$37        .dwtag  DW_TAG_member
     464                      .dwattr $C$DW$37, DW_AT_type(*$C$DW$T$20)
     465                      .dwattr $C$DW$37, DW_AT_name("CTRRST4")
     466                      .dwattr $C$DW$37, DW_AT_TI_symbol_name("_CTRRST4")
     467                      .dwattr $C$DW$37, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
     468                      .dwattr $C$DW$37, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     469                      .dwattr $C$DW$37, DW_AT_accessibility(DW_ACCESS_public)
     470              $C$DW$38        .dwtag  DW_TAG_member
     471                      .dwattr $C$DW$38, DW_AT_type(*$C$DW$T$20)
     472                      .dwattr $C$DW$38, DW_AT_name("CAPLDEN")
     473                      .dwattr $C$DW$38, DW_AT_TI_symbol_name("_CAPLDEN")
     474                      .dwattr $C$DW$38, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
     475                      .dwattr $C$DW$38, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     476                      .dwattr $C$DW$38, DW_AT_accessibility(DW_ACCESS_public)
     477              $C$DW$39        .dwtag  DW_TAG_member
     478                      .dwattr $C$DW$39, DW_AT_type(*$C$DW$T$20)
     479                      .dwattr $C$DW$39, DW_AT_name("PRESCALE")
     480                      .dwattr $C$DW$39, DW_AT_TI_symbol_name("_PRESCALE")
     481                      .dwattr $C$DW$39, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x05)
     482                      .dwattr $C$DW$39, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     483                      .dwattr $C$DW$39, DW_AT_accessibility(DW_ACCESS_public)
     484              $C$DW$40        .dwtag  DW_TAG_member
     485                      .dwattr $C$DW$40, DW_AT_type(*$C$DW$T$20)
     486                      .dwattr $C$DW$40, DW_AT_name("FREE_SOFT")
     487                      .dwattr $C$DW$40, DW_AT_TI_symbol_name("_FREE_SOFT")
     488                      .dwattr $C$DW$40, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x02)
     489                      .dwattr $C$DW$40, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     490                      .dwattr $C$DW$40, DW_AT_accessibility(DW_ACCESS_public)
     491                      .dwendtag $C$DW$T$24
     492              
     493              
     494              $C$DW$T$25      .dwtag  DW_TAG_union_type
     495                      .dwattr $C$DW$T$25, DW_AT_name("ECCTL1_REG")
     496                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x01)
     497              $C$DW$41        .dwtag  DW_TAG_member
     498                      .dwattr $C$DW$41, DW_AT_type(*$C$DW$T$20)
     499                      .dwattr $C$DW$41, DW_AT_name("all")
     500                      .dwattr $C$DW$41, DW_AT_TI_symbol_name("_all")
     501                      .dwattr $C$DW$41, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     502                      .dwattr $C$DW$41, DW_AT_accessibility(DW_ACCESS_public)
     503              $C$DW$42        .dwtag  DW_TAG_member
     504                      .dwattr $C$DW$42, DW_AT_type(*$C$DW$T$24)
     505                      .dwattr $C$DW$42, DW_AT_name("bit")
     506                      .dwattr $C$DW$42, DW_AT_TI_symbol_name("_bit")
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:14 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0580410                           PAGE   11

     507                      .dwattr $C$DW$42, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     508                      .dwattr $C$DW$42, DW_AT_accessibility(DW_ACCESS_public)
     509                      .dwendtag $C$DW$T$25
     510              
     511              
     512              $C$DW$T$26      .dwtag  DW_TAG_structure_type
     513                      .dwattr $C$DW$T$26, DW_AT_name("ECCTL2_BITS")
     514                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x01)
     515              $C$DW$43        .dwtag  DW_TAG_member
     516                      .dwattr $C$DW$43, DW_AT_type(*$C$DW$T$20)
     517                      .dwattr $C$DW$43, DW_AT_name("CONT_ONESHT")
     518                      .dwattr $C$DW$43, DW_AT_TI_symbol_name("_CONT_ONESHT")
     519                      .dwattr $C$DW$43, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
     520                      .dwattr $C$DW$43, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     521                      .dwattr $C$DW$43, DW_AT_accessibility(DW_ACCESS_public)
     522              $C$DW$44        .dwtag  DW_TAG_member
     523                      .dwattr $C$DW$44, DW_AT_type(*$C$DW$T$20)
     524                      .dwattr $C$DW$44, DW_AT_name("STOP_WRAP")
     525                      .dwattr $C$DW$44, DW_AT_TI_symbol_name("_STOP_WRAP")
     526                      .dwattr $C$DW$44, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x02)
     527                      .dwattr $C$DW$44, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     528                      .dwattr $C$DW$44, DW_AT_accessibility(DW_ACCESS_public)
     529              $C$DW$45        .dwtag  DW_TAG_member
     530                      .dwattr $C$DW$45, DW_AT_type(*$C$DW$T$20)
     531                      .dwattr $C$DW$45, DW_AT_name("REARM")
     532                      .dwattr $C$DW$45, DW_AT_TI_symbol_name("_REARM")
     533                      .dwattr $C$DW$45, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
     534                      .dwattr $C$DW$45, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     535                      .dwattr $C$DW$45, DW_AT_accessibility(DW_ACCESS_public)
     536              $C$DW$46        .dwtag  DW_TAG_member
     537                      .dwattr $C$DW$46, DW_AT_type(*$C$DW$T$20)
     538                      .dwattr $C$DW$46, DW_AT_name("TSCTRSTOP")
     539                      .dwattr $C$DW$46, DW_AT_TI_symbol_name("_TSCTRSTOP")
     540                      .dwattr $C$DW$46, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
     541                      .dwattr $C$DW$46, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     542                      .dwattr $C$DW$46, DW_AT_accessibility(DW_ACCESS_public)
     543              $C$DW$47        .dwtag  DW_TAG_member
     544                      .dwattr $C$DW$47, DW_AT_type(*$C$DW$T$20)
     545                      .dwattr $C$DW$47, DW_AT_name("SYNCI_EN")
     546                      .dwattr $C$DW$47, DW_AT_TI_symbol_name("_SYNCI_EN")
     547                      .dwattr $C$DW$47, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
     548                      .dwattr $C$DW$47, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     549                      .dwattr $C$DW$47, DW_AT_accessibility(DW_ACCESS_public)
     550              $C$DW$48        .dwtag  DW_TAG_member
     551                      .dwattr $C$DW$48, DW_AT_type(*$C$DW$T$20)
     552                      .dwattr $C$DW$48, DW_AT_name("SYNCO_SEL")
     553                      .dwattr $C$DW$48, DW_AT_TI_symbol_name("_SYNCO_SEL")
     554                      .dwattr $C$DW$48, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x02)
     555                      .dwattr $C$DW$48, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     556                      .dwattr $C$DW$48, DW_AT_accessibility(DW_ACCESS_public)
     557              $C$DW$49        .dwtag  DW_TAG_member
     558                      .dwattr $C$DW$49, DW_AT_type(*$C$DW$T$20)
     559                      .dwattr $C$DW$49, DW_AT_name("SWSYNC")
     560                      .dwattr $C$DW$49, DW_AT_TI_symbol_name("_SWSYNC")
     561                      .dwattr $C$DW$49, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:14 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0580410                           PAGE   12

     562                      .dwattr $C$DW$49, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     563                      .dwattr $C$DW$49, DW_AT_accessibility(DW_ACCESS_public)
     564              $C$DW$50        .dwtag  DW_TAG_member
     565                      .dwattr $C$DW$50, DW_AT_type(*$C$DW$T$20)
     566                      .dwattr $C$DW$50, DW_AT_name("CAP_APWM")
     567                      .dwattr $C$DW$50, DW_AT_TI_symbol_name("_CAP_APWM")
     568                      .dwattr $C$DW$50, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
     569                      .dwattr $C$DW$50, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     570                      .dwattr $C$DW$50, DW_AT_accessibility(DW_ACCESS_public)
     571              $C$DW$51        .dwtag  DW_TAG_member
     572                      .dwattr $C$DW$51, DW_AT_type(*$C$DW$T$20)
     573                      .dwattr $C$DW$51, DW_AT_name("APWMPOL")
     574                      .dwattr $C$DW$51, DW_AT_TI_symbol_name("_APWMPOL")
     575                      .dwattr $C$DW$51, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
     576                      .dwattr $C$DW$51, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     577                      .dwattr $C$DW$51, DW_AT_accessibility(DW_ACCESS_public)
     578              $C$DW$52        .dwtag  DW_TAG_member
     579                      .dwattr $C$DW$52, DW_AT_type(*$C$DW$T$20)
     580                      .dwattr $C$DW$52, DW_AT_name("rsvd1")
     581                      .dwattr $C$DW$52, DW_AT_TI_symbol_name("_rsvd1")
     582                      .dwattr $C$DW$52, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x05)
     583                      .dwattr $C$DW$52, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     584                      .dwattr $C$DW$52, DW_AT_accessibility(DW_ACCESS_public)
     585                      .dwendtag $C$DW$T$26
     586              
     587              
     588              $C$DW$T$27      .dwtag  DW_TAG_union_type
     589                      .dwattr $C$DW$T$27, DW_AT_name("ECCTL2_REG")
     590                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x01)
     591              $C$DW$53        .dwtag  DW_TAG_member
     592                      .dwattr $C$DW$53, DW_AT_type(*$C$DW$T$20)
     593                      .dwattr $C$DW$53, DW_AT_name("all")
     594                      .dwattr $C$DW$53, DW_AT_TI_symbol_name("_all")
     595                      .dwattr $C$DW$53, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     596                      .dwattr $C$DW$53, DW_AT_accessibility(DW_ACCESS_public)
     597              $C$DW$54        .dwtag  DW_TAG_member
     598                      .dwattr $C$DW$54, DW_AT_type(*$C$DW$T$26)
     599                      .dwattr $C$DW$54, DW_AT_name("bit")
     600                      .dwattr $C$DW$54, DW_AT_TI_symbol_name("_bit")
     601                      .dwattr $C$DW$54, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     602                      .dwattr $C$DW$54, DW_AT_accessibility(DW_ACCESS_public)
     603                      .dwendtag $C$DW$T$27
     604              
     605              
     606              $C$DW$T$28      .dwtag  DW_TAG_structure_type
     607                      .dwattr $C$DW$T$28, DW_AT_name("ECEINT_BITS")
     608                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x01)
     609              $C$DW$55        .dwtag  DW_TAG_member
     610                      .dwattr $C$DW$55, DW_AT_type(*$C$DW$T$20)
     611                      .dwattr $C$DW$55, DW_AT_name("rsvd1")
     612                      .dwattr $C$DW$55, DW_AT_TI_symbol_name("_rsvd1")
     613                      .dwattr $C$DW$55, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
     614                      .dwattr $C$DW$55, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     615                      .dwattr $C$DW$55, DW_AT_accessibility(DW_ACCESS_public)
     616              $C$DW$56        .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:14 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0580410                           PAGE   13

     617                      .dwattr $C$DW$56, DW_AT_type(*$C$DW$T$20)
     618                      .dwattr $C$DW$56, DW_AT_name("CEVT1")
     619                      .dwattr $C$DW$56, DW_AT_TI_symbol_name("_CEVT1")
     620                      .dwattr $C$DW$56, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
     621                      .dwattr $C$DW$56, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     622                      .dwattr $C$DW$56, DW_AT_accessibility(DW_ACCESS_public)
     623              $C$DW$57        .dwtag  DW_TAG_member
     624                      .dwattr $C$DW$57, DW_AT_type(*$C$DW$T$20)
     625                      .dwattr $C$DW$57, DW_AT_name("CEVT2")
     626                      .dwattr $C$DW$57, DW_AT_TI_symbol_name("_CEVT2")
     627                      .dwattr $C$DW$57, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
     628                      .dwattr $C$DW$57, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     629                      .dwattr $C$DW$57, DW_AT_accessibility(DW_ACCESS_public)
     630              $C$DW$58        .dwtag  DW_TAG_member
     631                      .dwattr $C$DW$58, DW_AT_type(*$C$DW$T$20)
     632                      .dwattr $C$DW$58, DW_AT_name("CEVT3")
     633                      .dwattr $C$DW$58, DW_AT_TI_symbol_name("_CEVT3")
     634                      .dwattr $C$DW$58, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
     635                      .dwattr $C$DW$58, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     636                      .dwattr $C$DW$58, DW_AT_accessibility(DW_ACCESS_public)
     637              $C$DW$59        .dwtag  DW_TAG_member
     638                      .dwattr $C$DW$59, DW_AT_type(*$C$DW$T$20)
     639                      .dwattr $C$DW$59, DW_AT_name("CEVT4")
     640                      .dwattr $C$DW$59, DW_AT_TI_symbol_name("_CEVT4")
     641                      .dwattr $C$DW$59, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
     642                      .dwattr $C$DW$59, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     643                      .dwattr $C$DW$59, DW_AT_accessibility(DW_ACCESS_public)
     644              $C$DW$60        .dwtag  DW_TAG_member
     645                      .dwattr $C$DW$60, DW_AT_type(*$C$DW$T$20)
     646                      .dwattr $C$DW$60, DW_AT_name("CTROVF")
     647                      .dwattr $C$DW$60, DW_AT_TI_symbol_name("_CTROVF")
     648                      .dwattr $C$DW$60, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
     649                      .dwattr $C$DW$60, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     650                      .dwattr $C$DW$60, DW_AT_accessibility(DW_ACCESS_public)
     651              $C$DW$61        .dwtag  DW_TAG_member
     652                      .dwattr $C$DW$61, DW_AT_type(*$C$DW$T$20)
     653                      .dwattr $C$DW$61, DW_AT_name("CTR_EQ_PRD")
     654                      .dwattr $C$DW$61, DW_AT_TI_symbol_name("_CTR_EQ_PRD")
     655                      .dwattr $C$DW$61, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
     656                      .dwattr $C$DW$61, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     657                      .dwattr $C$DW$61, DW_AT_accessibility(DW_ACCESS_public)
     658              $C$DW$62        .dwtag  DW_TAG_member
     659                      .dwattr $C$DW$62, DW_AT_type(*$C$DW$T$20)
     660                      .dwattr $C$DW$62, DW_AT_name("CTR_EQ_CMP")
     661                      .dwattr $C$DW$62, DW_AT_TI_symbol_name("_CTR_EQ_CMP")
     662                      .dwattr $C$DW$62, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
     663                      .dwattr $C$DW$62, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     664                      .dwattr $C$DW$62, DW_AT_accessibility(DW_ACCESS_public)
     665              $C$DW$63        .dwtag  DW_TAG_member
     666                      .dwattr $C$DW$63, DW_AT_type(*$C$DW$T$20)
     667                      .dwattr $C$DW$63, DW_AT_name("rsvd2")
     668                      .dwattr $C$DW$63, DW_AT_TI_symbol_name("_rsvd2")
     669                      .dwattr $C$DW$63, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x08)
     670                      .dwattr $C$DW$63, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     671                      .dwattr $C$DW$63, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:14 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0580410                           PAGE   14

     672                      .dwendtag $C$DW$T$28
     673              
     674              
     675              $C$DW$T$29      .dwtag  DW_TAG_union_type
     676                      .dwattr $C$DW$T$29, DW_AT_name("ECEINT_REG")
     677                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x01)
     678              $C$DW$64        .dwtag  DW_TAG_member
     679                      .dwattr $C$DW$64, DW_AT_type(*$C$DW$T$20)
     680                      .dwattr $C$DW$64, DW_AT_name("all")
     681                      .dwattr $C$DW$64, DW_AT_TI_symbol_name("_all")
     682                      .dwattr $C$DW$64, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     683                      .dwattr $C$DW$64, DW_AT_accessibility(DW_ACCESS_public)
     684              $C$DW$65        .dwtag  DW_TAG_member
     685                      .dwattr $C$DW$65, DW_AT_type(*$C$DW$T$28)
     686                      .dwattr $C$DW$65, DW_AT_name("bit")
     687                      .dwattr $C$DW$65, DW_AT_TI_symbol_name("_bit")
     688                      .dwattr $C$DW$65, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     689                      .dwattr $C$DW$65, DW_AT_accessibility(DW_ACCESS_public)
     690                      .dwendtag $C$DW$T$29
     691              
     692              
     693              $C$DW$T$30      .dwtag  DW_TAG_structure_type
     694                      .dwattr $C$DW$T$30, DW_AT_name("ECFLG_BITS")
     695                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x01)
     696              $C$DW$66        .dwtag  DW_TAG_member
     697                      .dwattr $C$DW$66, DW_AT_type(*$C$DW$T$20)
     698                      .dwattr $C$DW$66, DW_AT_name("INT")
     699                      .dwattr $C$DW$66, DW_AT_TI_symbol_name("_INT")
     700                      .dwattr $C$DW$66, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
     701                      .dwattr $C$DW$66, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     702                      .dwattr $C$DW$66, DW_AT_accessibility(DW_ACCESS_public)
     703              $C$DW$67        .dwtag  DW_TAG_member
     704                      .dwattr $C$DW$67, DW_AT_type(*$C$DW$T$20)
     705                      .dwattr $C$DW$67, DW_AT_name("CEVT1")
     706                      .dwattr $C$DW$67, DW_AT_TI_symbol_name("_CEVT1")
     707                      .dwattr $C$DW$67, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
     708                      .dwattr $C$DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     709                      .dwattr $C$DW$67, DW_AT_accessibility(DW_ACCESS_public)
     710              $C$DW$68        .dwtag  DW_TAG_member
     711                      .dwattr $C$DW$68, DW_AT_type(*$C$DW$T$20)
     712                      .dwattr $C$DW$68, DW_AT_name("CEVT2")
     713                      .dwattr $C$DW$68, DW_AT_TI_symbol_name("_CEVT2")
     714                      .dwattr $C$DW$68, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
     715                      .dwattr $C$DW$68, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     716                      .dwattr $C$DW$68, DW_AT_accessibility(DW_ACCESS_public)
     717              $C$DW$69        .dwtag  DW_TAG_member
     718                      .dwattr $C$DW$69, DW_AT_type(*$C$DW$T$20)
     719                      .dwattr $C$DW$69, DW_AT_name("CEVT3")
     720                      .dwattr $C$DW$69, DW_AT_TI_symbol_name("_CEVT3")
     721                      .dwattr $C$DW$69, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
     722                      .dwattr $C$DW$69, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     723                      .dwattr $C$DW$69, DW_AT_accessibility(DW_ACCESS_public)
     724              $C$DW$70        .dwtag  DW_TAG_member
     725                      .dwattr $C$DW$70, DW_AT_type(*$C$DW$T$20)
     726                      .dwattr $C$DW$70, DW_AT_name("CEVT4")
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:14 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0580410                           PAGE   15

     727                      .dwattr $C$DW$70, DW_AT_TI_symbol_name("_CEVT4")
     728                      .dwattr $C$DW$70, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
     729                      .dwattr $C$DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     730                      .dwattr $C$DW$70, DW_AT_accessibility(DW_ACCESS_public)
     731              $C$DW$71        .dwtag  DW_TAG_member
     732                      .dwattr $C$DW$71, DW_AT_type(*$C$DW$T$20)
     733                      .dwattr $C$DW$71, DW_AT_name("CTROVF")
     734                      .dwattr $C$DW$71, DW_AT_TI_symbol_name("_CTROVF")
     735                      .dwattr $C$DW$71, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
     736                      .dwattr $C$DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     737                      .dwattr $C$DW$71, DW_AT_accessibility(DW_ACCESS_public)
     738              $C$DW$72        .dwtag  DW_TAG_member
     739                      .dwattr $C$DW$72, DW_AT_type(*$C$DW$T$20)
     740                      .dwattr $C$DW$72, DW_AT_name("CTR_EQ_PRD")
     741                      .dwattr $C$DW$72, DW_AT_TI_symbol_name("_CTR_EQ_PRD")
     742                      .dwattr $C$DW$72, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
     743                      .dwattr $C$DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     744                      .dwattr $C$DW$72, DW_AT_accessibility(DW_ACCESS_public)
     745              $C$DW$73        .dwtag  DW_TAG_member
     746                      .dwattr $C$DW$73, DW_AT_type(*$C$DW$T$20)
     747                      .dwattr $C$DW$73, DW_AT_name("CTR_EQ_CMP")
     748                      .dwattr $C$DW$73, DW_AT_TI_symbol_name("_CTR_EQ_CMP")
     749                      .dwattr $C$DW$73, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
     750                      .dwattr $C$DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     751                      .dwattr $C$DW$73, DW_AT_accessibility(DW_ACCESS_public)
     752              $C$DW$74        .dwtag  DW_TAG_member
     753                      .dwattr $C$DW$74, DW_AT_type(*$C$DW$T$20)
     754                      .dwattr $C$DW$74, DW_AT_name("rsvd2")
     755                      .dwattr $C$DW$74, DW_AT_TI_symbol_name("_rsvd2")
     756                      .dwattr $C$DW$74, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x08)
     757                      .dwattr $C$DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     758                      .dwattr $C$DW$74, DW_AT_accessibility(DW_ACCESS_public)
     759                      .dwendtag $C$DW$T$30
     760              
     761              
     762              $C$DW$T$31      .dwtag  DW_TAG_union_type
     763                      .dwattr $C$DW$T$31, DW_AT_name("ECFLG_REG")
     764                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x01)
     765              $C$DW$75        .dwtag  DW_TAG_member
     766                      .dwattr $C$DW$75, DW_AT_type(*$C$DW$T$20)
     767                      .dwattr $C$DW$75, DW_AT_name("all")
     768                      .dwattr $C$DW$75, DW_AT_TI_symbol_name("_all")
     769                      .dwattr $C$DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     770                      .dwattr $C$DW$75, DW_AT_accessibility(DW_ACCESS_public)
     771              $C$DW$76        .dwtag  DW_TAG_member
     772                      .dwattr $C$DW$76, DW_AT_type(*$C$DW$T$30)
     773                      .dwattr $C$DW$76, DW_AT_name("bit")
     774                      .dwattr $C$DW$76, DW_AT_TI_symbol_name("_bit")
     775                      .dwattr $C$DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     776                      .dwattr $C$DW$76, DW_AT_accessibility(DW_ACCESS_public)
     777                      .dwendtag $C$DW$T$31
     778              
     779              
     780              $C$DW$T$32      .dwtag  DW_TAG_structure_type
     781                      .dwattr $C$DW$T$32, DW_AT_name("GPA1_BITS")
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:14 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0580410                           PAGE   16

     782                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x02)
     783              $C$DW$77        .dwtag  DW_TAG_member
     784                      .dwattr $C$DW$77, DW_AT_type(*$C$DW$T$20)
     785                      .dwattr $C$DW$77, DW_AT_name("GPIO0")
     786                      .dwattr $C$DW$77, DW_AT_TI_symbol_name("_GPIO0")
     787                      .dwattr $C$DW$77, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x02)
     788                      .dwattr $C$DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     789                      .dwattr $C$DW$77, DW_AT_accessibility(DW_ACCESS_public)
     790              $C$DW$78        .dwtag  DW_TAG_member
     791                      .dwattr $C$DW$78, DW_AT_type(*$C$DW$T$20)
     792                      .dwattr $C$DW$78, DW_AT_name("GPIO1")
     793                      .dwattr $C$DW$78, DW_AT_TI_symbol_name("_GPIO1")
     794                      .dwattr $C$DW$78, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x02)
     795                      .dwattr $C$DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     796                      .dwattr $C$DW$78, DW_AT_accessibility(DW_ACCESS_public)
     797              $C$DW$79        .dwtag  DW_TAG_member
     798                      .dwattr $C$DW$79, DW_AT_type(*$C$DW$T$20)
     799                      .dwattr $C$DW$79, DW_AT_name("GPIO2")
     800                      .dwattr $C$DW$79, DW_AT_TI_symbol_name("_GPIO2")
     801                      .dwattr $C$DW$79, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x02)
     802                      .dwattr $C$DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     803                      .dwattr $C$DW$79, DW_AT_accessibility(DW_ACCESS_public)
     804              $C$DW$80        .dwtag  DW_TAG_member
     805                      .dwattr $C$DW$80, DW_AT_type(*$C$DW$T$20)
     806                      .dwattr $C$DW$80, DW_AT_name("GPIO3")
     807                      .dwattr $C$DW$80, DW_AT_TI_symbol_name("_GPIO3")
     808                      .dwattr $C$DW$80, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x02)
     809                      .dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     810                      .dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
     811              $C$DW$81        .dwtag  DW_TAG_member
     812                      .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$20)
     813                      .dwattr $C$DW$81, DW_AT_name("GPIO4")
     814                      .dwattr $C$DW$81, DW_AT_TI_symbol_name("_GPIO4")
     815                      .dwattr $C$DW$81, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x02)
     816                      .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     817                      .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
     818              $C$DW$82        .dwtag  DW_TAG_member
     819                      .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$20)
     820                      .dwattr $C$DW$82, DW_AT_name("GPIO5")
     821                      .dwattr $C$DW$82, DW_AT_TI_symbol_name("_GPIO5")
     822                      .dwattr $C$DW$82, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x02)
     823                      .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     824                      .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
     825              $C$DW$83        .dwtag  DW_TAG_member
     826                      .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$20)
     827                      .dwattr $C$DW$83, DW_AT_name("GPIO6")
     828                      .dwattr $C$DW$83, DW_AT_TI_symbol_name("_GPIO6")
     829                      .dwattr $C$DW$83, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x02)
     830                      .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     831                      .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
     832              $C$DW$84        .dwtag  DW_TAG_member
     833                      .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$20)
     834                      .dwattr $C$DW$84, DW_AT_name("GPIO7")
     835                      .dwattr $C$DW$84, DW_AT_TI_symbol_name("_GPIO7")
     836                      .dwattr $C$DW$84, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x02)
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:14 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0580410                           PAGE   17

     837                      .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     838                      .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
     839              $C$DW$85        .dwtag  DW_TAG_member
     840                      .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$20)
     841                      .dwattr $C$DW$85, DW_AT_name("GPIO8")
     842                      .dwattr $C$DW$85, DW_AT_TI_symbol_name("_GPIO8")
     843                      .dwattr $C$DW$85, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x02)
     844                      .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     845                      .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
     846              $C$DW$86        .dwtag  DW_TAG_member
     847                      .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$20)
     848                      .dwattr $C$DW$86, DW_AT_name("GPIO9")
     849                      .dwattr $C$DW$86, DW_AT_TI_symbol_name("_GPIO9")
     850                      .dwattr $C$DW$86, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x02)
     851                      .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     852                      .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
     853              $C$DW$87        .dwtag  DW_TAG_member
     854                      .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$20)
     855                      .dwattr $C$DW$87, DW_AT_name("GPIO10")
     856                      .dwattr $C$DW$87, DW_AT_TI_symbol_name("_GPIO10")
     857                      .dwattr $C$DW$87, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x02)
     858                      .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     859                      .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
     860              $C$DW$88        .dwtag  DW_TAG_member
     861                      .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$20)
     862                      .dwattr $C$DW$88, DW_AT_name("GPIO11")
     863                      .dwattr $C$DW$88, DW_AT_TI_symbol_name("_GPIO11")
     864                      .dwattr $C$DW$88, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x02)
     865                      .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     866                      .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
     867              $C$DW$89        .dwtag  DW_TAG_member
     868                      .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$20)
     869                      .dwattr $C$DW$89, DW_AT_name("GPIO12")
     870                      .dwattr $C$DW$89, DW_AT_TI_symbol_name("_GPIO12")
     871                      .dwattr $C$DW$89, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x02)
     872                      .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     873                      .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
     874              $C$DW$90        .dwtag  DW_TAG_member
     875                      .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$20)
     876                      .dwattr $C$DW$90, DW_AT_name("GPIO13")
     877                      .dwattr $C$DW$90, DW_AT_TI_symbol_name("_GPIO13")
     878                      .dwattr $C$DW$90, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x02)
     879                      .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     880                      .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
     881              $C$DW$91        .dwtag  DW_TAG_member
     882                      .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$20)
     883                      .dwattr $C$DW$91, DW_AT_name("GPIO14")
     884                      .dwattr $C$DW$91, DW_AT_TI_symbol_name("_GPIO14")
     885                      .dwattr $C$DW$91, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x02)
     886                      .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     887                      .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
     888              $C$DW$92        .dwtag  DW_TAG_member
     889                      .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$20)
     890                      .dwattr $C$DW$92, DW_AT_name("GPIO15")
     891                      .dwattr $C$DW$92, DW_AT_TI_symbol_name("_GPIO15")
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:14 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0580410                           PAGE   18

     892                      .dwattr $C$DW$92, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x02)
     893                      .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     894                      .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
     895                      .dwendtag $C$DW$T$32
     896              
     897              
     898              $C$DW$T$33      .dwtag  DW_TAG_union_type
     899                      .dwattr $C$DW$T$33, DW_AT_name("GPA1_REG")
     900                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x02)
     901              $C$DW$93        .dwtag  DW_TAG_member
     902                      .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$19)
     903                      .dwattr $C$DW$93, DW_AT_name("all")
     904                      .dwattr $C$DW$93, DW_AT_TI_symbol_name("_all")
     905                      .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     906                      .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
     907              $C$DW$94        .dwtag  DW_TAG_member
     908                      .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$32)
     909                      .dwattr $C$DW$94, DW_AT_name("bit")
     910                      .dwattr $C$DW$94, DW_AT_TI_symbol_name("_bit")
     911                      .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     912                      .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
     913                      .dwendtag $C$DW$T$33
     914              
     915              
     916              $C$DW$T$34      .dwtag  DW_TAG_structure_type
     917                      .dwattr $C$DW$T$34, DW_AT_name("GPA2_BITS")
     918                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x02)
     919              $C$DW$95        .dwtag  DW_TAG_member
     920                      .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$20)
     921                      .dwattr $C$DW$95, DW_AT_name("GPIO16")
     922                      .dwattr $C$DW$95, DW_AT_TI_symbol_name("_GPIO16")
     923                      .dwattr $C$DW$95, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x02)
     924                      .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     925                      .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
     926              $C$DW$96        .dwtag  DW_TAG_member
     927                      .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$20)
     928                      .dwattr $C$DW$96, DW_AT_name("GPIO17")
     929                      .dwattr $C$DW$96, DW_AT_TI_symbol_name("_GPIO17")
     930                      .dwattr $C$DW$96, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x02)
     931                      .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     932                      .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
     933              $C$DW$97        .dwtag  DW_TAG_member
     934                      .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$20)
     935                      .dwattr $C$DW$97, DW_AT_name("GPIO18")
     936                      .dwattr $C$DW$97, DW_AT_TI_symbol_name("_GPIO18")
     937                      .dwattr $C$DW$97, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x02)
     938                      .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     939                      .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
     940              $C$DW$98        .dwtag  DW_TAG_member
     941                      .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$20)
     942                      .dwattr $C$DW$98, DW_AT_name("GPIO19")
     943                      .dwattr $C$DW$98, DW_AT_TI_symbol_name("_GPIO19")
     944                      .dwattr $C$DW$98, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x02)
     945                      .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     946                      .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:14 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0580410                           PAGE   19

     947              $C$DW$99        .dwtag  DW_TAG_member
     948                      .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$20)
     949                      .dwattr $C$DW$99, DW_AT_name("GPIO20")
     950                      .dwattr $C$DW$99, DW_AT_TI_symbol_name("_GPIO20")
     951                      .dwattr $C$DW$99, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x02)
     952                      .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     953                      .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
     954              $C$DW$100       .dwtag  DW_TAG_member
     955                      .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$20)
     956                      .dwattr $C$DW$100, DW_AT_name("GPIO21")
     957                      .dwattr $C$DW$100, DW_AT_TI_symbol_name("_GPIO21")
     958                      .dwattr $C$DW$100, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x02)
     959                      .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     960                      .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
     961              $C$DW$101       .dwtag  DW_TAG_member
     962                      .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$20)
     963                      .dwattr $C$DW$101, DW_AT_name("GPIO22")
     964                      .dwattr $C$DW$101, DW_AT_TI_symbol_name("_GPIO22")
     965                      .dwattr $C$DW$101, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x02)
     966                      .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     967                      .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
     968              $C$DW$102       .dwtag  DW_TAG_member
     969                      .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$20)
     970                      .dwattr $C$DW$102, DW_AT_name("GPIO23")
     971                      .dwattr $C$DW$102, DW_AT_TI_symbol_name("_GPIO23")
     972                      .dwattr $C$DW$102, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x02)
     973                      .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     974                      .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
     975              $C$DW$103       .dwtag  DW_TAG_member
     976                      .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$20)
     977                      .dwattr $C$DW$103, DW_AT_name("GPIO24")
     978                      .dwattr $C$DW$103, DW_AT_TI_symbol_name("_GPIO24")
     979                      .dwattr $C$DW$103, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x02)
     980                      .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     981                      .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
     982              $C$DW$104       .dwtag  DW_TAG_member
     983                      .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$20)
     984                      .dwattr $C$DW$104, DW_AT_name("GPIO25")
     985                      .dwattr $C$DW$104, DW_AT_TI_symbol_name("_GPIO25")
     986                      .dwattr $C$DW$104, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x02)
     987                      .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     988                      .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
     989              $C$DW$105       .dwtag  DW_TAG_member
     990                      .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$20)
     991                      .dwattr $C$DW$105, DW_AT_name("GPIO26")
     992                      .dwattr $C$DW$105, DW_AT_TI_symbol_name("_GPIO26")
     993                      .dwattr $C$DW$105, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x02)
     994                      .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     995                      .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
     996              $C$DW$106       .dwtag  DW_TAG_member
     997                      .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$20)
     998                      .dwattr $C$DW$106, DW_AT_name("GPIO27")
     999                      .dwattr $C$DW$106, DW_AT_TI_symbol_name("_GPIO27")
    1000                      .dwattr $C$DW$106, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x02)
    1001                      .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:14 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0580410                           PAGE   20

    1002                      .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    1003              $C$DW$107       .dwtag  DW_TAG_member
    1004                      .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$20)
    1005                      .dwattr $C$DW$107, DW_AT_name("GPIO28")
    1006                      .dwattr $C$DW$107, DW_AT_TI_symbol_name("_GPIO28")
    1007                      .dwattr $C$DW$107, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x02)
    1008                      .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1009                      .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
    1010              $C$DW$108       .dwtag  DW_TAG_member
    1011                      .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$20)
    1012                      .dwattr $C$DW$108, DW_AT_name("GPIO29")
    1013                      .dwattr $C$DW$108, DW_AT_TI_symbol_name("_GPIO29")
    1014                      .dwattr $C$DW$108, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x02)
    1015                      .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1016                      .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    1017              $C$DW$109       .dwtag  DW_TAG_member
    1018                      .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$20)
    1019                      .dwattr $C$DW$109, DW_AT_name("GPIO30")
    1020                      .dwattr $C$DW$109, DW_AT_TI_symbol_name("_GPIO30")
    1021                      .dwattr $C$DW$109, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x02)
    1022                      .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1023                      .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    1024              $C$DW$110       .dwtag  DW_TAG_member
    1025                      .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$20)
    1026                      .dwattr $C$DW$110, DW_AT_name("GPIO31")
    1027                      .dwattr $C$DW$110, DW_AT_TI_symbol_name("_GPIO31")
    1028                      .dwattr $C$DW$110, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x02)
    1029                      .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1030                      .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    1031                      .dwendtag $C$DW$T$34
    1032              
    1033              
    1034              $C$DW$T$35      .dwtag  DW_TAG_union_type
    1035                      .dwattr $C$DW$T$35, DW_AT_name("GPA2_REG")
    1036                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x02)
    1037              $C$DW$111       .dwtag  DW_TAG_member
    1038                      .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$19)
    1039                      .dwattr $C$DW$111, DW_AT_name("all")
    1040                      .dwattr $C$DW$111, DW_AT_TI_symbol_name("_all")
    1041                      .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1042                      .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    1043              $C$DW$112       .dwtag  DW_TAG_member
    1044                      .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$34)
    1045                      .dwattr $C$DW$112, DW_AT_name("bit")
    1046                      .dwattr $C$DW$112, DW_AT_TI_symbol_name("_bit")
    1047                      .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1048                      .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    1049                      .dwendtag $C$DW$T$35
    1050              
    1051              
    1052              $C$DW$T$36      .dwtag  DW_TAG_structure_type
    1053                      .dwattr $C$DW$T$36, DW_AT_name("GPACTRL_BITS")
    1054                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x02)
    1055              $C$DW$113       .dwtag  DW_TAG_member
    1056                      .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$20)
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:14 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0580410                           PAGE   21

    1057                      .dwattr $C$DW$113, DW_AT_name("QUALPRD0")
    1058                      .dwattr $C$DW$113, DW_AT_TI_symbol_name("_QUALPRD0")
    1059                      .dwattr $C$DW$113, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x08)
    1060                      .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1061                      .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    1062              $C$DW$114       .dwtag  DW_TAG_member
    1063                      .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$20)
    1064                      .dwattr $C$DW$114, DW_AT_name("QUALPRD1")
    1065                      .dwattr $C$DW$114, DW_AT_TI_symbol_name("_QUALPRD1")
    1066                      .dwattr $C$DW$114, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x08)
    1067                      .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1068                      .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    1069              $C$DW$115       .dwtag  DW_TAG_member
    1070                      .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$20)
    1071                      .dwattr $C$DW$115, DW_AT_name("QUALPRD2")
    1072                      .dwattr $C$DW$115, DW_AT_TI_symbol_name("_QUALPRD2")
    1073                      .dwattr $C$DW$115, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x08)
    1074                      .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1075                      .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    1076              $C$DW$116       .dwtag  DW_TAG_member
    1077                      .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$20)
    1078                      .dwattr $C$DW$116, DW_AT_name("QUALPRD3")
    1079                      .dwattr $C$DW$116, DW_AT_TI_symbol_name("_QUALPRD3")
    1080                      .dwattr $C$DW$116, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x08)
    1081                      .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1082                      .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    1083                      .dwendtag $C$DW$T$36
    1084              
    1085              
    1086              $C$DW$T$37      .dwtag  DW_TAG_union_type
    1087                      .dwattr $C$DW$T$37, DW_AT_name("GPACTRL_REG")
    1088                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x02)
    1089              $C$DW$117       .dwtag  DW_TAG_member
    1090                      .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$19)
    1091                      .dwattr $C$DW$117, DW_AT_name("all")
    1092                      .dwattr $C$DW$117, DW_AT_TI_symbol_name("_all")
    1093                      .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1094                      .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    1095              $C$DW$118       .dwtag  DW_TAG_member
    1096                      .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$36)
    1097                      .dwattr $C$DW$118, DW_AT_name("bit")
    1098                      .dwattr $C$DW$118, DW_AT_TI_symbol_name("_bit")
    1099                      .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1100                      .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    1101                      .dwendtag $C$DW$T$37
    1102              
    1103              
    1104              $C$DW$T$38      .dwtag  DW_TAG_structure_type
    1105                      .dwattr $C$DW$T$38, DW_AT_name("GPADAT_BITS")
    1106                      .dwattr $C$DW$T$38, DW_AT_byte_size(0x02)
    1107              $C$DW$119       .dwtag  DW_TAG_member
    1108                      .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$20)
    1109                      .dwattr $C$DW$119, DW_AT_name("GPIO0")
    1110                      .dwattr $C$DW$119, DW_AT_TI_symbol_name("_GPIO0")
    1111                      .dwattr $C$DW$119, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:14 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0580410                           PAGE   22

    1112                      .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1113                      .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    1114              $C$DW$120       .dwtag  DW_TAG_member
    1115                      .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$20)
    1116                      .dwattr $C$DW$120, DW_AT_name("GPIO1")
    1117                      .dwattr $C$DW$120, DW_AT_TI_symbol_name("_GPIO1")
    1118                      .dwattr $C$DW$120, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    1119                      .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1120                      .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    1121              $C$DW$121       .dwtag  DW_TAG_member
    1122                      .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$20)
    1123                      .dwattr $C$DW$121, DW_AT_name("GPIO2")
    1124                      .dwattr $C$DW$121, DW_AT_TI_symbol_name("_GPIO2")
    1125                      .dwattr $C$DW$121, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    1126                      .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1127                      .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    1128              $C$DW$122       .dwtag  DW_TAG_member
    1129                      .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$20)
    1130                      .dwattr $C$DW$122, DW_AT_name("GPIO3")
    1131                      .dwattr $C$DW$122, DW_AT_TI_symbol_name("_GPIO3")
    1132                      .dwattr $C$DW$122, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    1133                      .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1134                      .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    1135              $C$DW$123       .dwtag  DW_TAG_member
    1136                      .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$20)
    1137                      .dwattr $C$DW$123, DW_AT_name("GPIO4")
    1138                      .dwattr $C$DW$123, DW_AT_TI_symbol_name("_GPIO4")
    1139                      .dwattr $C$DW$123, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    1140                      .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1141                      .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    1142              $C$DW$124       .dwtag  DW_TAG_member
    1143                      .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$20)
    1144                      .dwattr $C$DW$124, DW_AT_name("GPIO5")
    1145                      .dwattr $C$DW$124, DW_AT_TI_symbol_name("_GPIO5")
    1146                      .dwattr $C$DW$124, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    1147                      .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1148                      .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    1149              $C$DW$125       .dwtag  DW_TAG_member
    1150                      .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$20)
    1151                      .dwattr $C$DW$125, DW_AT_name("GPIO6")
    1152                      .dwattr $C$DW$125, DW_AT_TI_symbol_name("_GPIO6")
    1153                      .dwattr $C$DW$125, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    1154                      .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1155                      .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    1156              $C$DW$126       .dwtag  DW_TAG_member
    1157                      .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$20)
    1158                      .dwattr $C$DW$126, DW_AT_name("GPIO7")
    1159                      .dwattr $C$DW$126, DW_AT_TI_symbol_name("_GPIO7")
    1160                      .dwattr $C$DW$126, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    1161                      .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1162                      .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    1163              $C$DW$127       .dwtag  DW_TAG_member
    1164                      .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$20)
    1165                      .dwattr $C$DW$127, DW_AT_name("GPIO8")
    1166                      .dwattr $C$DW$127, DW_AT_TI_symbol_name("_GPIO8")
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:14 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0580410                           PAGE   23

    1167                      .dwattr $C$DW$127, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
    1168                      .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1169                      .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    1170              $C$DW$128       .dwtag  DW_TAG_member
    1171                      .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$20)
    1172                      .dwattr $C$DW$128, DW_AT_name("GPIO9")
    1173                      .dwattr $C$DW$128, DW_AT_TI_symbol_name("_GPIO9")
    1174                      .dwattr $C$DW$128, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    1175                      .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1176                      .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    1177              $C$DW$129       .dwtag  DW_TAG_member
    1178                      .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$20)
    1179                      .dwattr $C$DW$129, DW_AT_name("GPIO10")
    1180                      .dwattr $C$DW$129, DW_AT_TI_symbol_name("_GPIO10")
    1181                      .dwattr $C$DW$129, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
    1182                      .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1183                      .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    1184              $C$DW$130       .dwtag  DW_TAG_member
    1185                      .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$20)
    1186                      .dwattr $C$DW$130, DW_AT_name("GPIO11")
    1187                      .dwattr $C$DW$130, DW_AT_TI_symbol_name("_GPIO11")
    1188                      .dwattr $C$DW$130, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
    1189                      .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1190                      .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    1191              $C$DW$131       .dwtag  DW_TAG_member
    1192                      .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$20)
    1193                      .dwattr $C$DW$131, DW_AT_name("GPIO12")
    1194                      .dwattr $C$DW$131, DW_AT_TI_symbol_name("_GPIO12")
    1195                      .dwattr $C$DW$131, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
    1196                      .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1197                      .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    1198              $C$DW$132       .dwtag  DW_TAG_member
    1199                      .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$20)
    1200                      .dwattr $C$DW$132, DW_AT_name("GPIO13")
    1201                      .dwattr $C$DW$132, DW_AT_TI_symbol_name("_GPIO13")
    1202                      .dwattr $C$DW$132, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
    1203                      .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1204                      .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    1205              $C$DW$133       .dwtag  DW_TAG_member
    1206                      .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$20)
    1207                      .dwattr $C$DW$133, DW_AT_name("GPIO14")
    1208                      .dwattr $C$DW$133, DW_AT_TI_symbol_name("_GPIO14")
    1209                      .dwattr $C$DW$133, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
    1210                      .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1211                      .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    1212              $C$DW$134       .dwtag  DW_TAG_member
    1213                      .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$20)
    1214                      .dwattr $C$DW$134, DW_AT_name("GPIO15")
    1215                      .dwattr $C$DW$134, DW_AT_TI_symbol_name("_GPIO15")
    1216                      .dwattr $C$DW$134, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    1217                      .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1218                      .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    1219              $C$DW$135       .dwtag  DW_TAG_member
    1220                      .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$20)
    1221                      .dwattr $C$DW$135, DW_AT_name("GPIO16")
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:14 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0580410                           PAGE   24

    1222                      .dwattr $C$DW$135, DW_AT_TI_symbol_name("_GPIO16")
    1223                      .dwattr $C$DW$135, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    1224                      .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1225                      .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    1226              $C$DW$136       .dwtag  DW_TAG_member
    1227                      .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$20)
    1228                      .dwattr $C$DW$136, DW_AT_name("GPIO17")
    1229                      .dwattr $C$DW$136, DW_AT_TI_symbol_name("_GPIO17")
    1230                      .dwattr $C$DW$136, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    1231                      .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1232                      .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    1233              $C$DW$137       .dwtag  DW_TAG_member
    1234                      .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$20)
    1235                      .dwattr $C$DW$137, DW_AT_name("GPIO18")
    1236                      .dwattr $C$DW$137, DW_AT_TI_symbol_name("_GPIO18")
    1237                      .dwattr $C$DW$137, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    1238                      .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1239                      .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    1240              $C$DW$138       .dwtag  DW_TAG_member
    1241                      .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$20)
    1242                      .dwattr $C$DW$138, DW_AT_name("GPIO19")
    1243                      .dwattr $C$DW$138, DW_AT_TI_symbol_name("_GPIO19")
    1244                      .dwattr $C$DW$138, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    1245                      .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1246                      .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    1247              $C$DW$139       .dwtag  DW_TAG_member
    1248                      .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$20)
    1249                      .dwattr $C$DW$139, DW_AT_name("GPIO20")
    1250                      .dwattr $C$DW$139, DW_AT_TI_symbol_name("_GPIO20")
    1251                      .dwattr $C$DW$139, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    1252                      .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1253                      .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    1254              $C$DW$140       .dwtag  DW_TAG_member
    1255                      .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$20)
    1256                      .dwattr $C$DW$140, DW_AT_name("GPIO21")
    1257                      .dwattr $C$DW$140, DW_AT_TI_symbol_name("_GPIO21")
    1258                      .dwattr $C$DW$140, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    1259                      .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1260                      .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    1261              $C$DW$141       .dwtag  DW_TAG_member
    1262                      .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$20)
    1263                      .dwattr $C$DW$141, DW_AT_name("GPIO22")
    1264                      .dwattr $C$DW$141, DW_AT_TI_symbol_name("_GPIO22")
    1265                      .dwattr $C$DW$141, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    1266                      .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1267                      .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    1268              $C$DW$142       .dwtag  DW_TAG_member
    1269                      .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$20)
    1270                      .dwattr $C$DW$142, DW_AT_name("GPIO23")
    1271                      .dwattr $C$DW$142, DW_AT_TI_symbol_name("_GPIO23")
    1272                      .dwattr $C$DW$142, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    1273                      .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1274                      .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    1275              $C$DW$143       .dwtag  DW_TAG_member
    1276                      .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$20)
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:14 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0580410                           PAGE   25

    1277                      .dwattr $C$DW$143, DW_AT_name("GPIO24")
    1278                      .dwattr $C$DW$143, DW_AT_TI_symbol_name("_GPIO24")
    1279                      .dwattr $C$DW$143, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
    1280                      .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1281                      .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    1282              $C$DW$144       .dwtag  DW_TAG_member
    1283                      .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$20)
    1284                      .dwattr $C$DW$144, DW_AT_name("GPIO25")
    1285                      .dwattr $C$DW$144, DW_AT_TI_symbol_name("_GPIO25")
    1286                      .dwattr $C$DW$144, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    1287                      .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1288                      .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    1289              $C$DW$145       .dwtag  DW_TAG_member
    1290                      .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$20)
    1291                      .dwattr $C$DW$145, DW_AT_name("GPIO26")
    1292                      .dwattr $C$DW$145, DW_AT_TI_symbol_name("_GPIO26")
    1293                      .dwattr $C$DW$145, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
    1294                      .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1295                      .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    1296              $C$DW$146       .dwtag  DW_TAG_member
    1297                      .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$20)
    1298                      .dwattr $C$DW$146, DW_AT_name("GPIO27")
    1299                      .dwattr $C$DW$146, DW_AT_TI_symbol_name("_GPIO27")
    1300                      .dwattr $C$DW$146, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
    1301                      .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1302                      .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
    1303              $C$DW$147       .dwtag  DW_TAG_member
    1304                      .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$20)
    1305                      .dwattr $C$DW$147, DW_AT_name("GPIO28")
    1306                      .dwattr $C$DW$147, DW_AT_TI_symbol_name("_GPIO28")
    1307                      .dwattr $C$DW$147, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
    1308                      .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1309                      .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
    1310              $C$DW$148       .dwtag  DW_TAG_member
    1311                      .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$20)
    1312                      .dwattr $C$DW$148, DW_AT_name("GPIO29")
    1313                      .dwattr $C$DW$148, DW_AT_TI_symbol_name("_GPIO29")
    1314                      .dwattr $C$DW$148, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
    1315                      .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1316                      .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    1317              $C$DW$149       .dwtag  DW_TAG_member
    1318                      .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$20)
    1319                      .dwattr $C$DW$149, DW_AT_name("GPIO30")
    1320                      .dwattr $C$DW$149, DW_AT_TI_symbol_name("_GPIO30")
    1321                      .dwattr $C$DW$149, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
    1322                      .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1323                      .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    1324              $C$DW$150       .dwtag  DW_TAG_member
    1325                      .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$20)
    1326                      .dwattr $C$DW$150, DW_AT_name("GPIO31")
    1327                      .dwattr $C$DW$150, DW_AT_TI_symbol_name("_GPIO31")
    1328                      .dwattr $C$DW$150, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    1329                      .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1330                      .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
    1331                      .dwendtag $C$DW$T$38
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:14 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0580410                           PAGE   26

    1332              
    1333              
    1334              $C$DW$T$39      .dwtag  DW_TAG_union_type
    1335                      .dwattr $C$DW$T$39, DW_AT_name("GPADAT_REG")
    1336                      .dwattr $C$DW$T$39, DW_AT_byte_size(0x02)
    1337              $C$DW$151       .dwtag  DW_TAG_member
    1338                      .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$19)
    1339                      .dwattr $C$DW$151, DW_AT_name("all")
    1340                      .dwattr $C$DW$151, DW_AT_TI_symbol_name("_all")
    1341                      .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1342                      .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    1343              $C$DW$152       .dwtag  DW_TAG_member
    1344                      .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$38)
    1345                      .dwattr $C$DW$152, DW_AT_name("bit")
    1346                      .dwattr $C$DW$152, DW_AT_TI_symbol_name("_bit")
    1347                      .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1348                      .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    1349                      .dwendtag $C$DW$T$39
    1350              
    1351              
    1352              $C$DW$T$40      .dwtag  DW_TAG_structure_type
    1353                      .dwattr $C$DW$T$40, DW_AT_name("GPB1_BITS")
    1354                      .dwattr $C$DW$T$40, DW_AT_byte_size(0x02)
    1355              $C$DW$153       .dwtag  DW_TAG_member
    1356                      .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$20)
    1357                      .dwattr $C$DW$153, DW_AT_name("GPIO32")
    1358                      .dwattr $C$DW$153, DW_AT_TI_symbol_name("_GPIO32")
    1359                      .dwattr $C$DW$153, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x02)
    1360                      .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1361                      .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    1362              $C$DW$154       .dwtag  DW_TAG_member
    1363                      .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$20)
    1364                      .dwattr $C$DW$154, DW_AT_name("GPIO33")
    1365                      .dwattr $C$DW$154, DW_AT_TI_symbol_name("_GPIO33")
    1366                      .dwattr $C$DW$154, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x02)
    1367                      .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1368                      .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
    1369              $C$DW$155       .dwtag  DW_TAG_member
    1370                      .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$20)
    1371                      .dwattr $C$DW$155, DW_AT_name("GPIO34")
    1372                      .dwattr $C$DW$155, DW_AT_TI_symbol_name("_GPIO34")
    1373                      .dwattr $C$DW$155, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x02)
    1374                      .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1375                      .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
    1376              $C$DW$156       .dwtag  DW_TAG_member
    1377                      .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$20)
    1378                      .dwattr $C$DW$156, DW_AT_name("GPIO35")
    1379                      .dwattr $C$DW$156, DW_AT_TI_symbol_name("_GPIO35")
    1380                      .dwattr $C$DW$156, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x02)
    1381                      .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1382                      .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    1383              $C$DW$157       .dwtag  DW_TAG_member
    1384                      .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$20)
    1385                      .dwattr $C$DW$157, DW_AT_name("GPIO36")
    1386                      .dwattr $C$DW$157, DW_AT_TI_symbol_name("_GPIO36")
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:14 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0580410                           PAGE   27

    1387                      .dwattr $C$DW$157, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x02)
    1388                      .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1389                      .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    1390              $C$DW$158       .dwtag  DW_TAG_member
    1391                      .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$20)
    1392                      .dwattr $C$DW$158, DW_AT_name("GPIO37")
    1393                      .dwattr $C$DW$158, DW_AT_TI_symbol_name("_GPIO37")
    1394                      .dwattr $C$DW$158, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x02)
    1395                      .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1396                      .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    1397              $C$DW$159       .dwtag  DW_TAG_member
    1398                      .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$20)
    1399                      .dwattr $C$DW$159, DW_AT_name("GPIO38")
    1400                      .dwattr $C$DW$159, DW_AT_TI_symbol_name("_GPIO38")
    1401                      .dwattr $C$DW$159, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x02)
    1402                      .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1403                      .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    1404              $C$DW$160       .dwtag  DW_TAG_member
    1405                      .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$20)
    1406                      .dwattr $C$DW$160, DW_AT_name("GPIO39")
    1407                      .dwattr $C$DW$160, DW_AT_TI_symbol_name("_GPIO39")
    1408                      .dwattr $C$DW$160, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x02)
    1409                      .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1410                      .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    1411              $C$DW$161       .dwtag  DW_TAG_member
    1412                      .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$20)
    1413                      .dwattr $C$DW$161, DW_AT_name("GPIO40")
    1414                      .dwattr $C$DW$161, DW_AT_TI_symbol_name("_GPIO40")
    1415                      .dwattr $C$DW$161, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x02)
    1416                      .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1417                      .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    1418              $C$DW$162       .dwtag  DW_TAG_member
    1419                      .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$20)
    1420                      .dwattr $C$DW$162, DW_AT_name("GPIO41")
    1421                      .dwattr $C$DW$162, DW_AT_TI_symbol_name("_GPIO41")
    1422                      .dwattr $C$DW$162, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x02)
    1423                      .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1424                      .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    1425              $C$DW$163       .dwtag  DW_TAG_member
    1426                      .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$20)
    1427                      .dwattr $C$DW$163, DW_AT_name("GPIO42")
    1428                      .dwattr $C$DW$163, DW_AT_TI_symbol_name("_GPIO42")
    1429                      .dwattr $C$DW$163, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x02)
    1430                      .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1431                      .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    1432              $C$DW$164       .dwtag  DW_TAG_member
    1433                      .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$20)
    1434                      .dwattr $C$DW$164, DW_AT_name("GPIO43")
    1435                      .dwattr $C$DW$164, DW_AT_TI_symbol_name("_GPIO43")
    1436                      .dwattr $C$DW$164, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x02)
    1437                      .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1438                      .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    1439              $C$DW$165       .dwtag  DW_TAG_member
    1440                      .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$20)
    1441                      .dwattr $C$DW$165, DW_AT_name("GPIO44")
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:14 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0580410                           PAGE   28

    1442                      .dwattr $C$DW$165, DW_AT_TI_symbol_name("_GPIO44")
    1443                      .dwattr $C$DW$165, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x02)
    1444                      .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1445                      .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    1446              $C$DW$166       .dwtag  DW_TAG_member
    1447                      .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$20)
    1448                      .dwattr $C$DW$166, DW_AT_name("GPIO45")
    1449                      .dwattr $C$DW$166, DW_AT_TI_symbol_name("_GPIO45")
    1450                      .dwattr $C$DW$166, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x02)
    1451                      .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1452                      .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    1453              $C$DW$167       .dwtag  DW_TAG_member
    1454                      .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$20)
    1455                      .dwattr $C$DW$167, DW_AT_name("GPIO46")
    1456                      .dwattr $C$DW$167, DW_AT_TI_symbol_name("_GPIO46")
    1457                      .dwattr $C$DW$167, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x02)
    1458                      .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1459                      .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    1460              $C$DW$168       .dwtag  DW_TAG_member
    1461                      .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$20)
    1462                      .dwattr $C$DW$168, DW_AT_name("GPIO47")
    1463                      .dwattr $C$DW$168, DW_AT_TI_symbol_name("_GPIO47")
    1464                      .dwattr $C$DW$168, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x02)
    1465                      .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1466                      .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    1467                      .dwendtag $C$DW$T$40
    1468              
    1469              
    1470              $C$DW$T$41      .dwtag  DW_TAG_union_type
