TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:10 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0517210                           PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v6.2.7 *
       3              ;* Date/Time created: Thu Jul 02 08:31:10 2015                 *
       4              ;***************************************************************
       5                      .compiler_opts --diag_wrap=off --float_support=fpu32 --hll_source=on --mem_model:code=flat --mem_mode
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("../UART/UartRs485.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v6.2.7 Copyright (c) 1996-2014 Texas I
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("D:\ActiveProject\EKT5\PKMT_NONBIOS\InvertorCntrl\ISPprg")
      13              
      14              $C$DW$1 .dwtag  DW_TAG_subprogram, DW_AT_name("initCoreUART_C")
      15                      .dwattr $C$DW$1, DW_AT_TI_symbol_name("_initCoreUART_C")
      16                      .dwattr $C$DW$1, DW_AT_declaration

    1100                      .dwpsn  file "../UART/UartRs485.c",line 306,column 1,is_stmt
    1101              $C$DW$56        .dwtag  DW_TAG_TI_branch
    1102                      .dwattr $C$DW$56, DW_AT_low_pc(0x00)
    1103                      .dwattr $C$DW$56, DW_AT_TI_return
    1104 00000092 0006          LRETR     ; [CPU_] 
    1105                      ; return occurs ; [] 
    1106                      .dwattr $C$DW$55, DW_AT_TI_end_file("../UART/UartRs485.c")
    1107                      .dwattr $C$DW$55, DW_AT_TI_end_line(0x132)
    1108                      .dwattr $C$DW$55, DW_AT_TI_end_column(0x01)
    1109                      .dwendentry
    1110                      .dwendtag $C$DW$55
    1111              
    1112 00000093               .sect   ".text"
    1113                      .clink
    1114                      .global _disableSciRcInt_485
    1115              
    1116              $C$DW$57        .dwtag  DW_TAG_subprogram, DW_AT_name("disableSciRcInt_485")
    1117                      .dwattr $C$DW$57, DW_AT_low_pc(_disableSciRcInt_485)
    1118                      .dwattr $C$DW$57, DW_AT_high_pc(0x00)
    1119                      .dwattr $C$DW$57, DW_AT_TI_symbol_name("_disableSciRcInt_485")
    1120                      .dwattr $C$DW$57, DW_AT_external
    1121                      .dwattr $C$DW$57, DW_AT_TI_begin_file("../UART/UartRs485.c")
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:10 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0517210                           PAGE   23

    1122                      .dwattr $C$DW$57, DW_AT_TI_begin_line(0x134)
    1123                      .dwattr $C$DW$57, DW_AT_TI_begin_column(0x06)
    1124                      .dwattr $C$DW$57, DW_AT_TI_max_frame_size(-2)
    1125                      .dwpsn  file "../UART/UartRs485.c",line 309,column 1,is_stmt,address _disableSciRcInt_485
    1126              
    1127                      .dwfde $C$DW$CIE, _disableSciRcInt_485
    1128              
    1129              ;***************************************************************
    1130              ;* FNAME: _disableSciRcInt_485          FR SIZE:   0           *
    1131              ;*                                                             *
    1132              ;* FUNCTION ENVIRONMENT                                        *
    1133              ;*                                                             *
    1134              ;* FUNCTION PROPERTIES                                         *
    1135              ;*                            0 Parameter,  0 Auto,  0 SOE     *
    1136              ;***************************************************************
    1137              
    1138 00000093       _disableSciRcInt_485:
    1139                      .dwcfi  cfa_offset, -2
    1140                      .dwcfi  save_reg_to_mem, 26, 0
    1141                      .dwcfi  save_reg_to_reg, 78, 26
    1142                      .dwpsn  file "../UART/UartRs485.c",line 311,column 2,is_stmt
    1143 00000093 761F!         MOVW      DP,#_ScicRegs+11      ; [CPU_U] 
         00000094 0000 
    1144 00000095 180B!         AND       @_ScicRegs+11,#0xffdf ; [CPU_] |311| 
         00000096 FFDF 
    1145                      .dwpsn  file "../UART/UartRs485.c",line 319,column 1,is_stmt
    1146              $C$DW$58        .dwtag  DW_TAG_TI_branch
    1147                      .dwattr $C$DW$58, DW_AT_low_pc(0x00)
    1148                      .dwattr $C$DW$58, DW_AT_TI_return
    1149 00000097 0006          LRETR     ; [CPU_] 
    1150                      ; return occurs ; [] 
    1151                      .dwattr $C$DW$57, DW_AT_TI_end_file("../UART/UartRs485.c")
    1152                      .dwattr $C$DW$57, DW_AT_TI_end_line(0x13f)
    1153                      .dwattr $C$DW$57, DW_AT_TI_end_column(0x01)
    1154                      .dwendentry
    1155                      .dwendtag $C$DW$57
    1156              
    1157              ;**************************************************************
    1158              ;* UNDEFINED EXTERNAL REFERENCES                              *
    1159              ;**************************************************************
    1160                      .global _initCoreUART_C
    1161                      .global _initRS485Timer
    1162                      .global _initUart485Bufer
    1163                      .global _getTxBufForInt
    1164                      .global _testRcBuf
    1165                      .global _putRcBufFromInt
    1166                      .global _SciaRegs
    1167                      .global _ScicRegs
    1168                      .global _PieCtrlRegs
    1169                      .global _GpioCtrlRegs
    1170                      .global _PieVectTable
    1171              
    1172              ;***************************************************************
    1173              ;* TYPE INFORMATION                                            *
    1174              ;***************************************************************
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:10 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0517210                           PAGE   24

    1175              
    1176              $C$DW$T$20      .dwtag  DW_TAG_structure_type
    1177                      .dwattr $C$DW$T$20, DW_AT_name("GPA1_BITS")
    1178                      .dwattr $C$DW$T$20, DW_AT_byte_size(0x02)
    1179              $C$DW$59        .dwtag  DW_TAG_member
    1180                      .dwattr $C$DW$59, DW_AT_type(*$C$DW$T$19)
    1181                      .dwattr $C$DW$59, DW_AT_name("GPIO0")
    1182                      .dwattr $C$DW$59, DW_AT_TI_symbol_name("_GPIO0")
    1183                      .dwattr $C$DW$59, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x02)
    1184                      .dwattr $C$DW$59, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1185                      .dwattr $C$DW$59, DW_AT_accessibility(DW_ACCESS_public)
    1186              $C$DW$60        .dwtag  DW_TAG_member
    1187                      .dwattr $C$DW$60, DW_AT_type(*$C$DW$T$19)
    1188                      .dwattr $C$DW$60, DW_AT_name("GPIO1")
    1189                      .dwattr $C$DW$60, DW_AT_TI_symbol_name("_GPIO1")
    1190                      .dwattr $C$DW$60, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x02)
    1191                      .dwattr $C$DW$60, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1192                      .dwattr $C$DW$60, DW_AT_accessibility(DW_ACCESS_public)
    1193              $C$DW$61        .dwtag  DW_TAG_member
    1194                      .dwattr $C$DW$61, DW_AT_type(*$C$DW$T$19)
    1195                      .dwattr $C$DW$61, DW_AT_name("GPIO2")
    1196                      .dwattr $C$DW$61, DW_AT_TI_symbol_name("_GPIO2")
    1197                      .dwattr $C$DW$61, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x02)
    1198                      .dwattr $C$DW$61, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1199                      .dwattr $C$DW$61, DW_AT_accessibility(DW_ACCESS_public)
    1200              $C$DW$62        .dwtag  DW_TAG_member
    1201                      .dwattr $C$DW$62, DW_AT_type(*$C$DW$T$19)
    1202                      .dwattr $C$DW$62, DW_AT_name("GPIO3")
    1203                      .dwattr $C$DW$62, DW_AT_TI_symbol_name("_GPIO3")
    1204                      .dwattr $C$DW$62, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x02)
    1205                      .dwattr $C$DW$62, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1206                      .dwattr $C$DW$62, DW_AT_accessibility(DW_ACCESS_public)
    1207              $C$DW$63        .dwtag  DW_TAG_member
    1208                      .dwattr $C$DW$63, DW_AT_type(*$C$DW$T$19)
    1209                      .dwattr $C$DW$63, DW_AT_name("GPIO4")
    1210                      .dwattr $C$DW$63, DW_AT_TI_symbol_name("_GPIO4")
    1211                      .dwattr $C$DW$63, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x02)
    1212                      .dwattr $C$DW$63, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1213                      .dwattr $C$DW$63, DW_AT_accessibility(DW_ACCESS_public)
    1214              $C$DW$64        .dwtag  DW_TAG_member
    1215                      .dwattr $C$DW$64, DW_AT_type(*$C$DW$T$19)
    1216                      .dwattr $C$DW$64, DW_AT_name("GPIO5")
    1217                      .dwattr $C$DW$64, DW_AT_TI_symbol_name("_GPIO5")
    1218                      .dwattr $C$DW$64, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x02)
    1219                      .dwattr $C$DW$64, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1220                      .dwattr $C$DW$64, DW_AT_accessibility(DW_ACCESS_public)
    1221              $C$DW$65        .dwtag  DW_TAG_member
    1222                      .dwattr $C$DW$65, DW_AT_type(*$C$DW$T$19)
    1223                      .dwattr $C$DW$65, DW_AT_name("GPIO6")
    1224                      .dwattr $C$DW$65, DW_AT_TI_symbol_name("_GPIO6")
    1225                      .dwattr $C$DW$65, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x02)
    1226                      .dwattr $C$DW$65, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1227                      .dwattr $C$DW$65, DW_AT_accessibility(DW_ACCESS_public)
    1228              $C$DW$66        .dwtag  DW_TAG_member
    1229                      .dwattr $C$DW$66, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:10 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0517210                           PAGE   25

    1230                      .dwattr $C$DW$66, DW_AT_name("GPIO7")
    1231                      .dwattr $C$DW$66, DW_AT_TI_symbol_name("_GPIO7")
    1232                      .dwattr $C$DW$66, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x02)
    1233                      .dwattr $C$DW$66, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1234                      .dwattr $C$DW$66, DW_AT_accessibility(DW_ACCESS_public)
    1235              $C$DW$67        .dwtag  DW_TAG_member
    1236                      .dwattr $C$DW$67, DW_AT_type(*$C$DW$T$19)
    1237                      .dwattr $C$DW$67, DW_AT_name("GPIO8")
    1238                      .dwattr $C$DW$67, DW_AT_TI_symbol_name("_GPIO8")
    1239                      .dwattr $C$DW$67, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x02)
    1240                      .dwattr $C$DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1241                      .dwattr $C$DW$67, DW_AT_accessibility(DW_ACCESS_public)
    1242              $C$DW$68        .dwtag  DW_TAG_member
    1243                      .dwattr $C$DW$68, DW_AT_type(*$C$DW$T$19)
    1244                      .dwattr $C$DW$68, DW_AT_name("GPIO9")
    1245                      .dwattr $C$DW$68, DW_AT_TI_symbol_name("_GPIO9")
    1246                      .dwattr $C$DW$68, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x02)
    1247                      .dwattr $C$DW$68, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1248                      .dwattr $C$DW$68, DW_AT_accessibility(DW_ACCESS_public)
    1249              $C$DW$69        .dwtag  DW_TAG_member
    1250                      .dwattr $C$DW$69, DW_AT_type(*$C$DW$T$19)
    1251                      .dwattr $C$DW$69, DW_AT_name("GPIO10")
    1252                      .dwattr $C$DW$69, DW_AT_TI_symbol_name("_GPIO10")
    1253                      .dwattr $C$DW$69, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x02)
    1254                      .dwattr $C$DW$69, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1255                      .dwattr $C$DW$69, DW_AT_accessibility(DW_ACCESS_public)
    1256              $C$DW$70        .dwtag  DW_TAG_member
    1257                      .dwattr $C$DW$70, DW_AT_type(*$C$DW$T$19)
    1258                      .dwattr $C$DW$70, DW_AT_name("GPIO11")
    1259                      .dwattr $C$DW$70, DW_AT_TI_symbol_name("_GPIO11")
    1260                      .dwattr $C$DW$70, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x02)
    1261                      .dwattr $C$DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1262                      .dwattr $C$DW$70, DW_AT_accessibility(DW_ACCESS_public)
    1263              $C$DW$71        .dwtag  DW_TAG_member
    1264                      .dwattr $C$DW$71, DW_AT_type(*$C$DW$T$19)
    1265                      .dwattr $C$DW$71, DW_AT_name("GPIO12")
    1266                      .dwattr $C$DW$71, DW_AT_TI_symbol_name("_GPIO12")
    1267                      .dwattr $C$DW$71, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x02)
    1268                      .dwattr $C$DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1269                      .dwattr $C$DW$71, DW_AT_accessibility(DW_ACCESS_public)
    1270              $C$DW$72        .dwtag  DW_TAG_member
    1271                      .dwattr $C$DW$72, DW_AT_type(*$C$DW$T$19)
    1272                      .dwattr $C$DW$72, DW_AT_name("GPIO13")
    1273                      .dwattr $C$DW$72, DW_AT_TI_symbol_name("_GPIO13")
    1274                      .dwattr $C$DW$72, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x02)
    1275                      .dwattr $C$DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1276                      .dwattr $C$DW$72, DW_AT_accessibility(DW_ACCESS_public)
    1277              $C$DW$73        .dwtag  DW_TAG_member
    1278                      .dwattr $C$DW$73, DW_AT_type(*$C$DW$T$19)
    1279                      .dwattr $C$DW$73, DW_AT_name("GPIO14")
    1280                      .dwattr $C$DW$73, DW_AT_TI_symbol_name("_GPIO14")
    1281                      .dwattr $C$DW$73, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x02)
    1282                      .dwattr $C$DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1283                      .dwattr $C$DW$73, DW_AT_accessibility(DW_ACCESS_public)
    1284              $C$DW$74        .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:10 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0517210                           PAGE   26

    1285                      .dwattr $C$DW$74, DW_AT_type(*$C$DW$T$19)
    1286                      .dwattr $C$DW$74, DW_AT_name("GPIO15")
    1287                      .dwattr $C$DW$74, DW_AT_TI_symbol_name("_GPIO15")
    1288                      .dwattr $C$DW$74, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x02)
    1289                      .dwattr $C$DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1290                      .dwattr $C$DW$74, DW_AT_accessibility(DW_ACCESS_public)
    1291                      .dwendtag $C$DW$T$20
    1292              
    1293              
    1294              $C$DW$T$22      .dwtag  DW_TAG_union_type
    1295                      .dwattr $C$DW$T$22, DW_AT_name("GPA1_REG")
    1296                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x02)
    1297              $C$DW$75        .dwtag  DW_TAG_member
    1298                      .dwattr $C$DW$75, DW_AT_type(*$C$DW$T$21)
    1299                      .dwattr $C$DW$75, DW_AT_name("all")
    1300                      .dwattr $C$DW$75, DW_AT_TI_symbol_name("_all")
    1301                      .dwattr $C$DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1302                      .dwattr $C$DW$75, DW_AT_accessibility(DW_ACCESS_public)
    1303              $C$DW$76        .dwtag  DW_TAG_member
    1304                      .dwattr $C$DW$76, DW_AT_type(*$C$DW$T$20)
    1305                      .dwattr $C$DW$76, DW_AT_name("bit")
    1306                      .dwattr $C$DW$76, DW_AT_TI_symbol_name("_bit")
    1307                      .dwattr $C$DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1308                      .dwattr $C$DW$76, DW_AT_accessibility(DW_ACCESS_public)
    1309                      .dwendtag $C$DW$T$22
    1310              
    1311              
    1312              $C$DW$T$23      .dwtag  DW_TAG_structure_type
    1313                      .dwattr $C$DW$T$23, DW_AT_name("GPA2_BITS")
    1314                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x02)
    1315              $C$DW$77        .dwtag  DW_TAG_member
    1316                      .dwattr $C$DW$77, DW_AT_type(*$C$DW$T$19)
    1317                      .dwattr $C$DW$77, DW_AT_name("GPIO16")
    1318                      .dwattr $C$DW$77, DW_AT_TI_symbol_name("_GPIO16")
    1319                      .dwattr $C$DW$77, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x02)
    1320                      .dwattr $C$DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1321                      .dwattr $C$DW$77, DW_AT_accessibility(DW_ACCESS_public)
    1322              $C$DW$78        .dwtag  DW_TAG_member
    1323                      .dwattr $C$DW$78, DW_AT_type(*$C$DW$T$19)
    1324                      .dwattr $C$DW$78, DW_AT_name("GPIO17")
    1325                      .dwattr $C$DW$78, DW_AT_TI_symbol_name("_GPIO17")
    1326                      .dwattr $C$DW$78, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x02)
    1327                      .dwattr $C$DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1328                      .dwattr $C$DW$78, DW_AT_accessibility(DW_ACCESS_public)
    1329              $C$DW$79        .dwtag  DW_TAG_member
    1330                      .dwattr $C$DW$79, DW_AT_type(*$C$DW$T$19)
    1331                      .dwattr $C$DW$79, DW_AT_name("GPIO18")
    1332                      .dwattr $C$DW$79, DW_AT_TI_symbol_name("_GPIO18")
    1333                      .dwattr $C$DW$79, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x02)
    1334                      .dwattr $C$DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1335                      .dwattr $C$DW$79, DW_AT_accessibility(DW_ACCESS_public)
    1336              $C$DW$80        .dwtag  DW_TAG_member
    1337                      .dwattr $C$DW$80, DW_AT_type(*$C$DW$T$19)
    1338                      .dwattr $C$DW$80, DW_AT_name("GPIO19")
    1339                      .dwattr $C$DW$80, DW_AT_TI_symbol_name("_GPIO19")
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:10 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0517210                           PAGE   27

    1340                      .dwattr $C$DW$80, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x02)
    1341                      .dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1342                      .dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
    1343              $C$DW$81        .dwtag  DW_TAG_member
    1344                      .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$19)
    1345                      .dwattr $C$DW$81, DW_AT_name("GPIO20")
    1346                      .dwattr $C$DW$81, DW_AT_TI_symbol_name("_GPIO20")
    1347                      .dwattr $C$DW$81, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x02)
    1348                      .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1349                      .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
    1350              $C$DW$82        .dwtag  DW_TAG_member
    1351                      .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$19)
    1352                      .dwattr $C$DW$82, DW_AT_name("GPIO21")
    1353                      .dwattr $C$DW$82, DW_AT_TI_symbol_name("_GPIO21")
    1354                      .dwattr $C$DW$82, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x02)
    1355                      .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1356                      .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
    1357              $C$DW$83        .dwtag  DW_TAG_member
    1358                      .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$19)
    1359                      .dwattr $C$DW$83, DW_AT_name("GPIO22")
    1360                      .dwattr $C$DW$83, DW_AT_TI_symbol_name("_GPIO22")
    1361                      .dwattr $C$DW$83, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x02)
    1362                      .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1363                      .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
    1364              $C$DW$84        .dwtag  DW_TAG_member
    1365                      .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$19)
    1366                      .dwattr $C$DW$84, DW_AT_name("GPIO23")
    1367                      .dwattr $C$DW$84, DW_AT_TI_symbol_name("_GPIO23")
    1368                      .dwattr $C$DW$84, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x02)
    1369                      .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1370                      .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
    1371              $C$DW$85        .dwtag  DW_TAG_member
    1372                      .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$19)
    1373                      .dwattr $C$DW$85, DW_AT_name("GPIO24")
    1374                      .dwattr $C$DW$85, DW_AT_TI_symbol_name("_GPIO24")
    1375                      .dwattr $C$DW$85, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x02)
    1376                      .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1377                      .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
    1378              $C$DW$86        .dwtag  DW_TAG_member
    1379                      .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$19)
    1380                      .dwattr $C$DW$86, DW_AT_name("GPIO25")
    1381                      .dwattr $C$DW$86, DW_AT_TI_symbol_name("_GPIO25")
    1382                      .dwattr $C$DW$86, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x02)
    1383                      .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1384                      .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
    1385              $C$DW$87        .dwtag  DW_TAG_member
    1386                      .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$19)
    1387                      .dwattr $C$DW$87, DW_AT_name("GPIO26")
    1388                      .dwattr $C$DW$87, DW_AT_TI_symbol_name("_GPIO26")
    1389                      .dwattr $C$DW$87, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x02)
    1390                      .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1391                      .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
    1392              $C$DW$88        .dwtag  DW_TAG_member
    1393                      .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$19)
    1394                      .dwattr $C$DW$88, DW_AT_name("GPIO27")
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:10 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0517210                           PAGE   28

    1395                      .dwattr $C$DW$88, DW_AT_TI_symbol_name("_GPIO27")
    1396                      .dwattr $C$DW$88, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x02)
    1397                      .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1398                      .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
    1399              $C$DW$89        .dwtag  DW_TAG_member
    1400                      .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$19)
    1401                      .dwattr $C$DW$89, DW_AT_name("GPIO28")
    1402                      .dwattr $C$DW$89, DW_AT_TI_symbol_name("_GPIO28")
    1403                      .dwattr $C$DW$89, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x02)
    1404                      .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1405                      .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
    1406              $C$DW$90        .dwtag  DW_TAG_member
    1407                      .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$19)
    1408                      .dwattr $C$DW$90, DW_AT_name("GPIO29")
    1409                      .dwattr $C$DW$90, DW_AT_TI_symbol_name("_GPIO29")
    1410                      .dwattr $C$DW$90, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x02)
    1411                      .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1412                      .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
    1413              $C$DW$91        .dwtag  DW_TAG_member
    1414                      .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$19)
    1415                      .dwattr $C$DW$91, DW_AT_name("GPIO30")
    1416                      .dwattr $C$DW$91, DW_AT_TI_symbol_name("_GPIO30")
    1417                      .dwattr $C$DW$91, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x02)
    1418                      .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1419                      .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
    1420              $C$DW$92        .dwtag  DW_TAG_member
    1421                      .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$19)
    1422                      .dwattr $C$DW$92, DW_AT_name("GPIO31")
    1423                      .dwattr $C$DW$92, DW_AT_TI_symbol_name("_GPIO31")
    1424                      .dwattr $C$DW$92, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x02)
    1425                      .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1426                      .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
    1427                      .dwendtag $C$DW$T$23
    1428              
    1429              
    1430              $C$DW$T$24      .dwtag  DW_TAG_union_type
    1431                      .dwattr $C$DW$T$24, DW_AT_name("GPA2_REG")
    1432                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x02)
    1433              $C$DW$93        .dwtag  DW_TAG_member
    1434                      .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$21)
    1435                      .dwattr $C$DW$93, DW_AT_name("all")
    1436                      .dwattr $C$DW$93, DW_AT_TI_symbol_name("_all")
    1437                      .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1438                      .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
    1439              $C$DW$94        .dwtag  DW_TAG_member
    1440                      .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$23)
    1441                      .dwattr $C$DW$94, DW_AT_name("bit")
    1442                      .dwattr $C$DW$94, DW_AT_TI_symbol_name("_bit")
    1443                      .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1444                      .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
    1445                      .dwendtag $C$DW$T$24
    1446              
    1447              
    1448              $C$DW$T$25      .dwtag  DW_TAG_structure_type
    1449                      .dwattr $C$DW$T$25, DW_AT_name("GPACTRL_BITS")
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:10 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0517210                           PAGE   29

    1450                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x02)
    1451              $C$DW$95        .dwtag  DW_TAG_member
    1452                      .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$19)
    1453                      .dwattr $C$DW$95, DW_AT_name("QUALPRD0")
    1454                      .dwattr $C$DW$95, DW_AT_TI_symbol_name("_QUALPRD0")
    1455                      .dwattr $C$DW$95, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x08)
    1456                      .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1457                      .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
    1458              $C$DW$96        .dwtag  DW_TAG_member
    1459                      .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$19)
    1460                      .dwattr $C$DW$96, DW_AT_name("QUALPRD1")
    1461                      .dwattr $C$DW$96, DW_AT_TI_symbol_name("_QUALPRD1")
    1462                      .dwattr $C$DW$96, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x08)
    1463                      .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1464                      .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
    1465              $C$DW$97        .dwtag  DW_TAG_member
    1466                      .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$19)
    1467                      .dwattr $C$DW$97, DW_AT_name("QUALPRD2")
    1468                      .dwattr $C$DW$97, DW_AT_TI_symbol_name("_QUALPRD2")
    1469                      .dwattr $C$DW$97, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x08)
    1470                      .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1471                      .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
    1472              $C$DW$98        .dwtag  DW_TAG_member
    1473                      .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$19)
    1474                      .dwattr $C$DW$98, DW_AT_name("QUALPRD3")
    1475                      .dwattr $C$DW$98, DW_AT_TI_symbol_name("_QUALPRD3")
    1476                      .dwattr $C$DW$98, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x08)
    1477                      .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1478                      .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
    1479                      .dwendtag $C$DW$T$25
    1480              
    1481              
    1482              $C$DW$T$26      .dwtag  DW_TAG_union_type
    1483                      .dwattr $C$DW$T$26, DW_AT_name("GPACTRL_REG")
    1484                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x02)
    1485              $C$DW$99        .dwtag  DW_TAG_member
    1486                      .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$21)
    1487                      .dwattr $C$DW$99, DW_AT_name("all")
    1488                      .dwattr $C$DW$99, DW_AT_TI_symbol_name("_all")
    1489                      .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1490                      .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
    1491              $C$DW$100       .dwtag  DW_TAG_member
    1492                      .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$25)
    1493                      .dwattr $C$DW$100, DW_AT_name("bit")
    1494                      .dwattr $C$DW$100, DW_AT_TI_symbol_name("_bit")
    1495                      .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1496                      .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
    1497                      .dwendtag $C$DW$T$26
    1498              
    1499              
    1500              $C$DW$T$27      .dwtag  DW_TAG_structure_type
    1501                      .dwattr $C$DW$T$27, DW_AT_name("GPADAT_BITS")
    1502                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x02)
    1503              $C$DW$101       .dwtag  DW_TAG_member
    1504                      .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:10 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0517210                           PAGE   30

    1505                      .dwattr $C$DW$101, DW_AT_name("GPIO0")
    1506                      .dwattr $C$DW$101, DW_AT_TI_symbol_name("_GPIO0")
    1507                      .dwattr $C$DW$101, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    1508                      .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1509                      .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
    1510              $C$DW$102       .dwtag  DW_TAG_member
    1511                      .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$19)
    1512                      .dwattr $C$DW$102, DW_AT_name("GPIO1")
    1513                      .dwattr $C$DW$102, DW_AT_TI_symbol_name("_GPIO1")
    1514                      .dwattr $C$DW$102, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    1515                      .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1516                      .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
    1517              $C$DW$103       .dwtag  DW_TAG_member
    1518                      .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$19)
    1519                      .dwattr $C$DW$103, DW_AT_name("GPIO2")
    1520                      .dwattr $C$DW$103, DW_AT_TI_symbol_name("_GPIO2")
    1521                      .dwattr $C$DW$103, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    1522                      .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1523                      .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
    1524              $C$DW$104       .dwtag  DW_TAG_member
    1525                      .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$19)
    1526                      .dwattr $C$DW$104, DW_AT_name("GPIO3")
    1527                      .dwattr $C$DW$104, DW_AT_TI_symbol_name("_GPIO3")
    1528                      .dwattr $C$DW$104, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    1529                      .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1530                      .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
    1531              $C$DW$105       .dwtag  DW_TAG_member
    1532                      .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$19)
    1533                      .dwattr $C$DW$105, DW_AT_name("GPIO4")
    1534                      .dwattr $C$DW$105, DW_AT_TI_symbol_name("_GPIO4")
    1535                      .dwattr $C$DW$105, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    1536                      .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1537                      .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
    1538              $C$DW$106       .dwtag  DW_TAG_member
    1539                      .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$19)
    1540                      .dwattr $C$DW$106, DW_AT_name("GPIO5")
    1541                      .dwattr $C$DW$106, DW_AT_TI_symbol_name("_GPIO5")
    1542                      .dwattr $C$DW$106, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    1543                      .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1544                      .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    1545              $C$DW$107       .dwtag  DW_TAG_member
    1546                      .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$19)
    1547                      .dwattr $C$DW$107, DW_AT_name("GPIO6")
    1548                      .dwattr $C$DW$107, DW_AT_TI_symbol_name("_GPIO6")
    1549                      .dwattr $C$DW$107, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    1550                      .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1551                      .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
    1552              $C$DW$108       .dwtag  DW_TAG_member
    1553                      .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$19)
    1554                      .dwattr $C$DW$108, DW_AT_name("GPIO7")
    1555                      .dwattr $C$DW$108, DW_AT_TI_symbol_name("_GPIO7")
    1556                      .dwattr $C$DW$108, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    1557                      .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1558                      .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    1559              $C$DW$109       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:10 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0517210                           PAGE   31

    1560                      .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$19)
    1561                      .dwattr $C$DW$109, DW_AT_name("GPIO8")
    1562                      .dwattr $C$DW$109, DW_AT_TI_symbol_name("_GPIO8")
    1563                      .dwattr $C$DW$109, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
    1564                      .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1565                      .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    1566              $C$DW$110       .dwtag  DW_TAG_member
    1567                      .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$19)
    1568                      .dwattr $C$DW$110, DW_AT_name("GPIO9")
    1569                      .dwattr $C$DW$110, DW_AT_TI_symbol_name("_GPIO9")
    1570                      .dwattr $C$DW$110, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    1571                      .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1572                      .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    1573              $C$DW$111       .dwtag  DW_TAG_member
    1574                      .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$19)
    1575                      .dwattr $C$DW$111, DW_AT_name("GPIO10")
    1576                      .dwattr $C$DW$111, DW_AT_TI_symbol_name("_GPIO10")
    1577                      .dwattr $C$DW$111, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
    1578                      .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1579                      .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    1580              $C$DW$112       .dwtag  DW_TAG_member
    1581                      .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$19)
    1582                      .dwattr $C$DW$112, DW_AT_name("GPIO11")
    1583                      .dwattr $C$DW$112, DW_AT_TI_symbol_name("_GPIO11")
    1584                      .dwattr $C$DW$112, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
    1585                      .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1586                      .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    1587              $C$DW$113       .dwtag  DW_TAG_member
    1588                      .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$19)
    1589                      .dwattr $C$DW$113, DW_AT_name("GPIO12")
    1590                      .dwattr $C$DW$113, DW_AT_TI_symbol_name("_GPIO12")
    1591                      .dwattr $C$DW$113, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
    1592                      .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1593                      .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    1594              $C$DW$114       .dwtag  DW_TAG_member
    1595                      .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$19)
    1596                      .dwattr $C$DW$114, DW_AT_name("GPIO13")
    1597                      .dwattr $C$DW$114, DW_AT_TI_symbol_name("_GPIO13")
    1598                      .dwattr $C$DW$114, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
    1599                      .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1600                      .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    1601              $C$DW$115       .dwtag  DW_TAG_member
    1602                      .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$19)
    1603                      .dwattr $C$DW$115, DW_AT_name("GPIO14")
    1604                      .dwattr $C$DW$115, DW_AT_TI_symbol_name("_GPIO14")
    1605                      .dwattr $C$DW$115, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
    1606                      .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1607                      .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    1608              $C$DW$116       .dwtag  DW_TAG_member
    1609                      .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$19)
    1610                      .dwattr $C$DW$116, DW_AT_name("GPIO15")
    1611                      .dwattr $C$DW$116, DW_AT_TI_symbol_name("_GPIO15")
    1612                      .dwattr $C$DW$116, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    1613                      .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1614                      .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:10 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0517210                           PAGE   32

    1615              $C$DW$117       .dwtag  DW_TAG_member
    1616                      .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$19)
    1617                      .dwattr $C$DW$117, DW_AT_name("GPIO16")
    1618                      .dwattr $C$DW$117, DW_AT_TI_symbol_name("_GPIO16")
    1619                      .dwattr $C$DW$117, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    1620                      .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1621                      .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    1622              $C$DW$118       .dwtag  DW_TAG_member
    1623                      .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$19)
    1624                      .dwattr $C$DW$118, DW_AT_name("GPIO17")
    1625                      .dwattr $C$DW$118, DW_AT_TI_symbol_name("_GPIO17")
    1626                      .dwattr $C$DW$118, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    1627                      .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1628                      .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    1629              $C$DW$119       .dwtag  DW_TAG_member
    1630                      .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$19)
    1631                      .dwattr $C$DW$119, DW_AT_name("GPIO18")
    1632                      .dwattr $C$DW$119, DW_AT_TI_symbol_name("_GPIO18")
    1633                      .dwattr $C$DW$119, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    1634                      .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1635                      .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    1636              $C$DW$120       .dwtag  DW_TAG_member
    1637                      .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$19)
    1638                      .dwattr $C$DW$120, DW_AT_name("GPIO19")
    1639                      .dwattr $C$DW$120, DW_AT_TI_symbol_name("_GPIO19")
    1640                      .dwattr $C$DW$120, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    1641                      .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1642                      .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    1643              $C$DW$121       .dwtag  DW_TAG_member
    1644                      .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$19)
    1645                      .dwattr $C$DW$121, DW_AT_name("GPIO20")
    1646                      .dwattr $C$DW$121, DW_AT_TI_symbol_name("_GPIO20")
    1647                      .dwattr $C$DW$121, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    1648                      .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1649                      .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    1650              $C$DW$122       .dwtag  DW_TAG_member
    1651                      .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$19)
    1652                      .dwattr $C$DW$122, DW_AT_name("GPIO21")
    1653                      .dwattr $C$DW$122, DW_AT_TI_symbol_name("_GPIO21")
    1654                      .dwattr $C$DW$122, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    1655                      .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1656                      .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    1657              $C$DW$123       .dwtag  DW_TAG_member
    1658                      .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$19)
    1659                      .dwattr $C$DW$123, DW_AT_name("GPIO22")
    1660                      .dwattr $C$DW$123, DW_AT_TI_symbol_name("_GPIO22")
    1661                      .dwattr $C$DW$123, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    1662                      .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1663                      .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    1664              $C$DW$124       .dwtag  DW_TAG_member
    1665                      .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$19)
    1666                      .dwattr $C$DW$124, DW_AT_name("GPIO23")
    1667                      .dwattr $C$DW$124, DW_AT_TI_symbol_name("_GPIO23")
    1668                      .dwattr $C$DW$124, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    1669                      .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:10 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0517210                           PAGE   33

    1670                      .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    1671              $C$DW$125       .dwtag  DW_TAG_member
    1672                      .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$19)
    1673                      .dwattr $C$DW$125, DW_AT_name("GPIO24")
    1674                      .dwattr $C$DW$125, DW_AT_TI_symbol_name("_GPIO24")
    1675                      .dwattr $C$DW$125, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
    1676                      .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1677                      .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    1678              $C$DW$126       .dwtag  DW_TAG_member
    1679                      .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$19)
    1680                      .dwattr $C$DW$126, DW_AT_name("GPIO25")
    1681                      .dwattr $C$DW$126, DW_AT_TI_symbol_name("_GPIO25")
    1682                      .dwattr $C$DW$126, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    1683                      .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1684                      .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    1685              $C$DW$127       .dwtag  DW_TAG_member
    1686                      .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$19)
    1687                      .dwattr $C$DW$127, DW_AT_name("GPIO26")
    1688                      .dwattr $C$DW$127, DW_AT_TI_symbol_name("_GPIO26")
    1689                      .dwattr $C$DW$127, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
    1690                      .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1691                      .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    1692              $C$DW$128       .dwtag  DW_TAG_member
    1693                      .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$19)
    1694                      .dwattr $C$DW$128, DW_AT_name("GPIO27")
    1695                      .dwattr $C$DW$128, DW_AT_TI_symbol_name("_GPIO27")
    1696                      .dwattr $C$DW$128, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
    1697                      .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1698                      .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    1699              $C$DW$129       .dwtag  DW_TAG_member
    1700                      .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$19)
    1701                      .dwattr $C$DW$129, DW_AT_name("GPIO28")
    1702                      .dwattr $C$DW$129, DW_AT_TI_symbol_name("_GPIO28")
    1703                      .dwattr $C$DW$129, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
    1704                      .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1705                      .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    1706              $C$DW$130       .dwtag  DW_TAG_member
    1707                      .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$19)
    1708                      .dwattr $C$DW$130, DW_AT_name("GPIO29")
    1709                      .dwattr $C$DW$130, DW_AT_TI_symbol_name("_GPIO29")
    1710                      .dwattr $C$DW$130, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
    1711                      .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1712                      .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    1713              $C$DW$131       .dwtag  DW_TAG_member
    1714                      .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$19)
    1715                      .dwattr $C$DW$131, DW_AT_name("GPIO30")
    1716                      .dwattr $C$DW$131, DW_AT_TI_symbol_name("_GPIO30")
    1717                      .dwattr $C$DW$131, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
    1718                      .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1719                      .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    1720              $C$DW$132       .dwtag  DW_TAG_member
    1721                      .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$19)
    1722                      .dwattr $C$DW$132, DW_AT_name("GPIO31")
    1723                      .dwattr $C$DW$132, DW_AT_TI_symbol_name("_GPIO31")
    1724                      .dwattr $C$DW$132, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:10 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0517210                           PAGE   34

    1725                      .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1726                      .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    1727                      .dwendtag $C$DW$T$27
    1728              
    1729              
    1730              $C$DW$T$28      .dwtag  DW_TAG_union_type
    1731                      .dwattr $C$DW$T$28, DW_AT_name("GPADAT_REG")
    1732                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x02)
    1733              $C$DW$133       .dwtag  DW_TAG_member
    1734                      .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$21)
    1735                      .dwattr $C$DW$133, DW_AT_name("all")
    1736                      .dwattr $C$DW$133, DW_AT_TI_symbol_name("_all")
    1737                      .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1738                      .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    1739              $C$DW$134       .dwtag  DW_TAG_member
    1740                      .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$27)
    1741                      .dwattr $C$DW$134, DW_AT_name("bit")
    1742                      .dwattr $C$DW$134, DW_AT_TI_symbol_name("_bit")
    1743                      .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1744                      .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    1745                      .dwendtag $C$DW$T$28
    1746              
    1747              
    1748              $C$DW$T$29      .dwtag  DW_TAG_structure_type
    1749                      .dwattr $C$DW$T$29, DW_AT_name("GPB1_BITS")
    1750                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x02)
    1751              $C$DW$135       .dwtag  DW_TAG_member
    1752                      .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$19)
    1753                      .dwattr $C$DW$135, DW_AT_name("GPIO32")
    1754                      .dwattr $C$DW$135, DW_AT_TI_symbol_name("_GPIO32")
    1755                      .dwattr $C$DW$135, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x02)
    1756                      .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1757                      .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    1758              $C$DW$136       .dwtag  DW_TAG_member
    1759                      .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$19)
    1760                      .dwattr $C$DW$136, DW_AT_name("GPIO33")
    1761                      .dwattr $C$DW$136, DW_AT_TI_symbol_name("_GPIO33")
    1762                      .dwattr $C$DW$136, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x02)
    1763                      .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1764                      .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    1765              $C$DW$137       .dwtag  DW_TAG_member
    1766                      .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$19)
    1767                      .dwattr $C$DW$137, DW_AT_name("GPIO34")
    1768                      .dwattr $C$DW$137, DW_AT_TI_symbol_name("_GPIO34")
    1769                      .dwattr $C$DW$137, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x02)
    1770                      .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1771                      .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    1772              $C$DW$138       .dwtag  DW_TAG_member
    1773                      .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$19)
    1774                      .dwattr $C$DW$138, DW_AT_name("GPIO35")
    1775                      .dwattr $C$DW$138, DW_AT_TI_symbol_name("_GPIO35")
    1776                      .dwattr $C$DW$138, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x02)
    1777                      .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1778                      .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    1779              $C$DW$139       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:10 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0517210                           PAGE   35

    1780                      .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$19)
    1781                      .dwattr $C$DW$139, DW_AT_name("GPIO36")
    1782                      .dwattr $C$DW$139, DW_AT_TI_symbol_name("_GPIO36")
    1783                      .dwattr $C$DW$139, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x02)
    1784                      .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1785                      .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    1786              $C$DW$140       .dwtag  DW_TAG_member
    1787                      .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$19)
    1788                      .dwattr $C$DW$140, DW_AT_name("GPIO37")
    1789                      .dwattr $C$DW$140, DW_AT_TI_symbol_name("_GPIO37")
    1790                      .dwattr $C$DW$140, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x02)
    1791                      .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1792                      .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    1793              $C$DW$141       .dwtag  DW_TAG_member
    1794                      .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$19)
    1795                      .dwattr $C$DW$141, DW_AT_name("GPIO38")
    1796                      .dwattr $C$DW$141, DW_AT_TI_symbol_name("_GPIO38")
    1797                      .dwattr $C$DW$141, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x02)
    1798                      .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1799                      .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    1800              $C$DW$142       .dwtag  DW_TAG_member
    1801                      .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$19)
    1802                      .dwattr $C$DW$142, DW_AT_name("GPIO39")
    1803                      .dwattr $C$DW$142, DW_AT_TI_symbol_name("_GPIO39")
    1804                      .dwattr $C$DW$142, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x02)
    1805                      .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1806                      .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    1807              $C$DW$143       .dwtag  DW_TAG_member
    1808                      .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$19)
    1809                      .dwattr $C$DW$143, DW_AT_name("GPIO40")
    1810                      .dwattr $C$DW$143, DW_AT_TI_symbol_name("_GPIO40")
    1811                      .dwattr $C$DW$143, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x02)
    1812                      .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1813                      .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    1814              $C$DW$144       .dwtag  DW_TAG_member
    1815                      .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$19)
    1816                      .dwattr $C$DW$144, DW_AT_name("GPIO41")
    1817                      .dwattr $C$DW$144, DW_AT_TI_symbol_name("_GPIO41")
    1818                      .dwattr $C$DW$144, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x02)
    1819                      .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1820                      .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    1821              $C$DW$145       .dwtag  DW_TAG_member
    1822                      .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$19)
    1823                      .dwattr $C$DW$145, DW_AT_name("GPIO42")
    1824                      .dwattr $C$DW$145, DW_AT_TI_symbol_name("_GPIO42")
    1825                      .dwattr $C$DW$145, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x02)
    1826                      .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1827                      .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    1828              $C$DW$146       .dwtag  DW_TAG_member
    1829                      .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$19)
    1830                      .dwattr $C$DW$146, DW_AT_name("GPIO43")
    1831                      .dwattr $C$DW$146, DW_AT_TI_symbol_name("_GPIO43")
    1832                      .dwattr $C$DW$146, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x02)
    1833                      .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1834                      .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:10 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0517210                           PAGE   36

    1835              $C$DW$147       .dwtag  DW_TAG_member
    1836                      .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$19)
    1837                      .dwattr $C$DW$147, DW_AT_name("GPIO44")
    1838                      .dwattr $C$DW$147, DW_AT_TI_symbol_name("_GPIO44")
    1839                      .dwattr $C$DW$147, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x02)
    1840                      .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1841                      .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
    1842              $C$DW$148       .dwtag  DW_TAG_member
    1843                      .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$19)
    1844                      .dwattr $C$DW$148, DW_AT_name("GPIO45")
    1845                      .dwattr $C$DW$148, DW_AT_TI_symbol_name("_GPIO45")
    1846                      .dwattr $C$DW$148, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x02)
    1847                      .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1848                      .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    1849              $C$DW$149       .dwtag  DW_TAG_member
    1850                      .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$19)
    1851                      .dwattr $C$DW$149, DW_AT_name("GPIO46")
    1852                      .dwattr $C$DW$149, DW_AT_TI_symbol_name("_GPIO46")
    1853                      .dwattr $C$DW$149, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x02)
    1854                      .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1855                      .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    1856              $C$DW$150       .dwtag  DW_TAG_member
    1857                      .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$19)
    1858                      .dwattr $C$DW$150, DW_AT_name("GPIO47")
    1859                      .dwattr $C$DW$150, DW_AT_TI_symbol_name("_GPIO47")
    1860                      .dwattr $C$DW$150, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x02)
    1861                      .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1862                      .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
    1863                      .dwendtag $C$DW$T$29
    1864              
    1865              
    1866              $C$DW$T$30      .dwtag  DW_TAG_union_type
    1867                      .dwattr $C$DW$T$30, DW_AT_name("GPB1_REG")
    1868                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x02)
    1869              $C$DW$151       .dwtag  DW_TAG_member
    1870                      .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$21)
    1871                      .dwattr $C$DW$151, DW_AT_name("all")
    1872                      .dwattr $C$DW$151, DW_AT_TI_symbol_name("_all")
    1873                      .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1874                      .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    1875              $C$DW$152       .dwtag  DW_TAG_member
    1876                      .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$29)
    1877                      .dwattr $C$DW$152, DW_AT_name("bit")
    1878                      .dwattr $C$DW$152, DW_AT_TI_symbol_name("_bit")
    1879                      .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1880                      .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    1881                      .dwendtag $C$DW$T$30
    1882              
    1883              
    1884              $C$DW$T$31      .dwtag  DW_TAG_structure_type
    1885                      .dwattr $C$DW$T$31, DW_AT_name("GPB2_BITS")
    1886                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x02)
    1887              $C$DW$153       .dwtag  DW_TAG_member
    1888                      .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$19)
    1889                      .dwattr $C$DW$153, DW_AT_name("GPIO48")
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:10 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0517210                           PAGE   37

    1890                      .dwattr $C$DW$153, DW_AT_TI_symbol_name("_GPIO48")
    1891                      .dwattr $C$DW$153, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x02)
    1892                      .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1893                      .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    1894              $C$DW$154       .dwtag  DW_TAG_member
    1895                      .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$19)
    1896                      .dwattr $C$DW$154, DW_AT_name("GPIO49")
    1897                      .dwattr $C$DW$154, DW_AT_TI_symbol_name("_GPIO49")
    1898                      .dwattr $C$DW$154, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x02)
    1899                      .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1900                      .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
    1901              $C$DW$155       .dwtag  DW_TAG_member
    1902                      .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$19)
    1903                      .dwattr $C$DW$155, DW_AT_name("GPIO50")
    1904                      .dwattr $C$DW$155, DW_AT_TI_symbol_name("_GPIO50")
    1905                      .dwattr $C$DW$155, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x02)
    1906                      .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1907                      .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
    1908              $C$DW$156       .dwtag  DW_TAG_member
    1909                      .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$19)
    1910                      .dwattr $C$DW$156, DW_AT_name("GPIO51")
    1911                      .dwattr $C$DW$156, DW_AT_TI_symbol_name("_GPIO51")
    1912                      .dwattr $C$DW$156, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x02)
    1913                      .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1914                      .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    1915              $C$DW$157       .dwtag  DW_TAG_member
    1916                      .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$19)
    1917                      .dwattr $C$DW$157, DW_AT_name("GPIO52")
    1918                      .dwattr $C$DW$157, DW_AT_TI_symbol_name("_GPIO52")
    1919                      .dwattr $C$DW$157, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x02)
    1920                      .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1921                      .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    1922              $C$DW$158       .dwtag  DW_TAG_member
    1923                      .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$19)
    1924                      .dwattr $C$DW$158, DW_AT_name("GPIO53")
    1925                      .dwattr $C$DW$158, DW_AT_TI_symbol_name("_GPIO53")
    1926                      .dwattr $C$DW$158, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x02)
    1927                      .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1928                      .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    1929              $C$DW$159       .dwtag  DW_TAG_member
    1930                      .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$19)
    1931                      .dwattr $C$DW$159, DW_AT_name("GPIO54")
    1932                      .dwattr $C$DW$159, DW_AT_TI_symbol_name("_GPIO54")
    1933                      .dwattr $C$DW$159, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x02)
    1934                      .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1935                      .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    1936              $C$DW$160       .dwtag  DW_TAG_member
    1937                      .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$19)
    1938                      .dwattr $C$DW$160, DW_AT_name("GPIO55")
    1939                      .dwattr $C$DW$160, DW_AT_TI_symbol_name("_GPIO55")
    1940                      .dwattr $C$DW$160, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x02)
    1941                      .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1942                      .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    1943              $C$DW$161       .dwtag  DW_TAG_member
    1944                      .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:10 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0517210                           PAGE   38

    1945                      .dwattr $C$DW$161, DW_AT_name("GPIO56")
    1946                      .dwattr $C$DW$161, DW_AT_TI_symbol_name("_GPIO56")
    1947                      .dwattr $C$DW$161, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x02)
    1948                      .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1949                      .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    1950              $C$DW$162       .dwtag  DW_TAG_member
    1951                      .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$19)
    1952                      .dwattr $C$DW$162, DW_AT_name("GPIO57")
    1953                      .dwattr $C$DW$162, DW_AT_TI_symbol_name("_GPIO57")
    1954                      .dwattr $C$DW$162, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x02)
    1955                      .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1956                      .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    1957              $C$DW$163       .dwtag  DW_TAG_member
    1958                      .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$19)
    1959                      .dwattr $C$DW$163, DW_AT_name("GPIO58")
    1960                      .dwattr $C$DW$163, DW_AT_TI_symbol_name("_GPIO58")
    1961                      .dwattr $C$DW$163, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x02)
    1962                      .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1963                      .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    1964              $C$DW$164       .dwtag  DW_TAG_member
    1965                      .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$19)
    1966                      .dwattr $C$DW$164, DW_AT_name("GPIO59")
    1967                      .dwattr $C$DW$164, DW_AT_TI_symbol_name("_GPIO59")
    1968                      .dwattr $C$DW$164, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x02)
    1969                      .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1970                      .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    1971              $C$DW$165       .dwtag  DW_TAG_member
    1972                      .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$19)
    1973                      .dwattr $C$DW$165, DW_AT_name("GPIO60")
    1974                      .dwattr $C$DW$165, DW_AT_TI_symbol_name("_GPIO60")
    1975                      .dwattr $C$DW$165, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x02)
    1976                      .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1977                      .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    1978              $C$DW$166       .dwtag  DW_TAG_member
    1979                      .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$19)
    1980                      .dwattr $C$DW$166, DW_AT_name("GPIO61")
    1981                      .dwattr $C$DW$166, DW_AT_TI_symbol_name("_GPIO61")
    1982                      .dwattr $C$DW$166, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x02)
    1983                      .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1984                      .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    1985              $C$DW$167       .dwtag  DW_TAG_member
    1986                      .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$19)
    1987                      .dwattr $C$DW$167, DW_AT_name("GPIO62")
    1988                      .dwattr $C$DW$167, DW_AT_TI_symbol_name("_GPIO62")
    1989                      .dwattr $C$DW$167, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x02)
    1990                      .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1991                      .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    1992              $C$DW$168       .dwtag  DW_TAG_member
    1993                      .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$19)
    1994                      .dwattr $C$DW$168, DW_AT_name("GPIO63")
    1995                      .dwattr $C$DW$168, DW_AT_TI_symbol_name("_GPIO63")
    1996                      .dwattr $C$DW$168, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x02)
    1997                      .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1998                      .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    1999                      .dwendtag $C$DW$T$31
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:10 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0517210                           PAGE   39

    2000              
    2001              
    2002              $C$DW$T$32      .dwtag  DW_TAG_union_type
    2003                      .dwattr $C$DW$T$32, DW_AT_name("GPB2_REG")
    2004                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x02)
    2005              $C$DW$169       .dwtag  DW_TAG_member
    2006                      .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$21)
    2007                      .dwattr $C$DW$169, DW_AT_name("all")
    2008                      .dwattr $C$DW$169, DW_AT_TI_symbol_name("_all")
    2009                      .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2010                      .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    2011              $C$DW$170       .dwtag  DW_TAG_member
    2012                      .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$31)
    2013                      .dwattr $C$DW$170, DW_AT_name("bit")
    2014                      .dwattr $C$DW$170, DW_AT_TI_symbol_name("_bit")
    2015                      .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2016                      .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    2017                      .dwendtag $C$DW$T$32
    2018              
    2019              
    2020              $C$DW$T$33      .dwtag  DW_TAG_structure_type
    2021                      .dwattr $C$DW$T$33, DW_AT_name("GPBCTRL_BITS")
    2022                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x02)
    2023              $C$DW$171       .dwtag  DW_TAG_member
    2024                      .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$19)
    2025                      .dwattr $C$DW$171, DW_AT_name("QUALPRD0")
    2026                      .dwattr $C$DW$171, DW_AT_TI_symbol_name("_QUALPRD0")
    2027                      .dwattr $C$DW$171, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x08)
    2028                      .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2029                      .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    2030              $C$DW$172       .dwtag  DW_TAG_member
    2031                      .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$19)
    2032                      .dwattr $C$DW$172, DW_AT_name("QUALPRD1")
    2033                      .dwattr $C$DW$172, DW_AT_TI_symbol_name("_QUALPRD1")
    2034                      .dwattr $C$DW$172, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x08)
    2035                      .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2036                      .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    2037              $C$DW$173       .dwtag  DW_TAG_member
    2038                      .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$19)
    2039                      .dwattr $C$DW$173, DW_AT_name("QUALPRD2")
    2040                      .dwattr $C$DW$173, DW_AT_TI_symbol_name("_QUALPRD2")
    2041                      .dwattr $C$DW$173, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x08)
    2042                      .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2043                      .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
    2044              $C$DW$174       .dwtag  DW_TAG_member
    2045                      .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$19)
    2046                      .dwattr $C$DW$174, DW_AT_name("QUALPRD3")
    2047                      .dwattr $C$DW$174, DW_AT_TI_symbol_name("_QUALPRD3")
    2048                      .dwattr $C$DW$174, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x08)
    2049                      .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2050                      .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
    2051                      .dwendtag $C$DW$T$33
    2052              
    2053              
    2054              $C$DW$T$34      .dwtag  DW_TAG_union_type
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:10 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0517210                           PAGE   40

    2055                      .dwattr $C$DW$T$34, DW_AT_name("GPBCTRL_REG")
    2056                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x02)
    2057              $C$DW$175       .dwtag  DW_TAG_member
    2058                      .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$21)
    2059                      .dwattr $C$DW$175, DW_AT_name("all")
    2060                      .dwattr $C$DW$175, DW_AT_TI_symbol_name("_all")
    2061                      .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2062                      .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
    2063              $C$DW$176       .dwtag  DW_TAG_member
    2064                      .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$33)
    2065                      .dwattr $C$DW$176, DW_AT_name("bit")
    2066                      .dwattr $C$DW$176, DW_AT_TI_symbol_name("_bit")
    2067                      .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2068                      .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
    2069                      .dwendtag $C$DW$T$34
    2070              
    2071              
    2072              $C$DW$T$35      .dwtag  DW_TAG_structure_type
    2073                      .dwattr $C$DW$T$35, DW_AT_name("GPBDAT_BITS")
    2074                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x02)
    2075              $C$DW$177       .dwtag  DW_TAG_member
    2076                      .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$19)
    2077                      .dwattr $C$DW$177, DW_AT_name("GPIO32")
    2078                      .dwattr $C$DW$177, DW_AT_TI_symbol_name("_GPIO32")
    2079                      .dwattr $C$DW$177, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    2080                      .dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2081                      .dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
    2082              $C$DW$178       .dwtag  DW_TAG_member
    2083                      .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$19)
    2084                      .dwattr $C$DW$178, DW_AT_name("GPIO33")
    2085                      .dwattr $C$DW$178, DW_AT_TI_symbol_name("_GPIO33")
    2086                      .dwattr $C$DW$178, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    2087                      .dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2088                      .dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
    2089              $C$DW$179       .dwtag  DW_TAG_member
    2090                      .dwattr $C$DW$179, DW_AT_type(*$C$DW$T$19)
    2091                      .dwattr $C$DW$179, DW_AT_name("GPIO34")
    2092                      .dwattr $C$DW$179, DW_AT_TI_symbol_name("_GPIO34")
    2093                      .dwattr $C$DW$179, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    2094                      .dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2095                      .dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
    2096              $C$DW$180       .dwtag  DW_TAG_member
    2097                      .dwattr $C$DW$180, DW_AT_type(*$C$DW$T$19)
    2098                      .dwattr $C$DW$180, DW_AT_name("GPIO35")
    2099                      .dwattr $C$DW$180, DW_AT_TI_symbol_name("_GPIO35")
    2100                      .dwattr $C$DW$180, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    2101                      .dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2102                      .dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
    2103              $C$DW$181       .dwtag  DW_TAG_member
    2104                      .dwattr $C$DW$181, DW_AT_type(*$C$DW$T$19)
    2105                      .dwattr $C$DW$181, DW_AT_name("GPIO36")
    2106                      .dwattr $C$DW$181, DW_AT_TI_symbol_name("_GPIO36")
    2107                      .dwattr $C$DW$181, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    2108                      .dwattr $C$DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2109                      .dwattr $C$DW$181, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:10 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0517210                           PAGE   41

    2110              $C$DW$182       .dwtag  DW_TAG_member
    2111                      .dwattr $C$DW$182, DW_AT_type(*$C$DW$T$19)
    2112                      .dwattr $C$DW$182, DW_AT_name("GPIO37")
    2113                      .dwattr $C$DW$182, DW_AT_TI_symbol_name("_GPIO37")
    2114                      .dwattr $C$DW$182, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    2115                      .dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2116                      .dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)
    2117              $C$DW$183       .dwtag  DW_TAG_member
    2118                      .dwattr $C$DW$183, DW_AT_type(*$C$DW$T$19)
    2119                      .dwattr $C$DW$183, DW_AT_name("GPIO38")
    2120                      .dwattr $C$DW$183, DW_AT_TI_symbol_name("_GPIO38")
    2121                      .dwattr $C$DW$183, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    2122                      .dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2123                      .dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
    2124              $C$DW$184       .dwtag  DW_TAG_member
    2125                      .dwattr $C$DW$184, DW_AT_type(*$C$DW$T$19)
    2126                      .dwattr $C$DW$184, DW_AT_name("GPIO39")
    2127                      .dwattr $C$DW$184, DW_AT_TI_symbol_name("_GPIO39")
    2128                      .dwattr $C$DW$184, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    2129                      .dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2130                      .dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
    2131              $C$DW$185       .dwtag  DW_TAG_member
    2132                      .dwattr $C$DW$185, DW_AT_type(*$C$DW$T$19)
    2133                      .dwattr $C$DW$185, DW_AT_name("GPIO40")
    2134                      .dwattr $C$DW$185, DW_AT_TI_symbol_name("_GPIO40")
    2135                      .dwattr $C$DW$185, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
    2136                      .dwattr $C$DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2137                      .dwattr $C$DW$185, DW_AT_accessibility(DW_ACCESS_public)
    2138              $C$DW$186       .dwtag  DW_TAG_member
    2139                      .dwattr $C$DW$186, DW_AT_type(*$C$DW$T$19)
    2140                      .dwattr $C$DW$186, DW_AT_name("GPIO41")
    2141                      .dwattr $C$DW$186, DW_AT_TI_symbol_name("_GPIO41")
    2142                      .dwattr $C$DW$186, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    2143                      .dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2144                      .dwattr $C$DW$186, DW_AT_accessibility(DW_ACCESS_public)
    2145              $C$DW$187       .dwtag  DW_TAG_member
    2146                      .dwattr $C$DW$187, DW_AT_type(*$C$DW$T$19)
    2147                      .dwattr $C$DW$187, DW_AT_name("GPIO42")
    2148                      .dwattr $C$DW$187, DW_AT_TI_symbol_name("_GPIO42")
    2149                      .dwattr $C$DW$187, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
    2150                      .dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2151                      .dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)
    2152              $C$DW$188       .dwtag  DW_TAG_member
    2153                      .dwattr $C$DW$188, DW_AT_type(*$C$DW$T$19)
    2154                      .dwattr $C$DW$188, DW_AT_name("GPIO43")
    2155                      .dwattr $C$DW$188, DW_AT_TI_symbol_name("_GPIO43")
    2156                      .dwattr $C$DW$188, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
    2157                      .dwattr $C$DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2158                      .dwattr $C$DW$188, DW_AT_accessibility(DW_ACCESS_public)
    2159              $C$DW$189       .dwtag  DW_TAG_member
    2160                      .dwattr $C$DW$189, DW_AT_type(*$C$DW$T$19)
    2161                      .dwattr $C$DW$189, DW_AT_name("GPIO44")
    2162                      .dwattr $C$DW$189, DW_AT_TI_symbol_name("_GPIO44")
    2163                      .dwattr $C$DW$189, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
    2164                      .dwattr $C$DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:10 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0517210                           PAGE   42

    2165                      .dwattr $C$DW$189, DW_AT_accessibility(DW_ACCESS_public)
    2166              $C$DW$190       .dwtag  DW_TAG_member
    2167                      .dwattr $C$DW$190, DW_AT_type(*$C$DW$T$19)
    2168                      .dwattr $C$DW$190, DW_AT_name("GPIO45")
    2169                      .dwattr $C$DW$190, DW_AT_TI_symbol_name("_GPIO45")
    2170                      .dwattr $C$DW$190, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
    2171                      .dwattr $C$DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2172                      .dwattr $C$DW$190, DW_AT_accessibility(DW_ACCESS_public)
    2173              $C$DW$191       .dwtag  DW_TAG_member
    2174                      .dwattr $C$DW$191, DW_AT_type(*$C$DW$T$19)
    2175                      .dwattr $C$DW$191, DW_AT_name("GPIO46")
    2176                      .dwattr $C$DW$191, DW_AT_TI_symbol_name("_GPIO46")
    2177                      .dwattr $C$DW$191, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
    2178                      .dwattr $C$DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2179                      .dwattr $C$DW$191, DW_AT_accessibility(DW_ACCESS_public)
    2180              $C$DW$192       .dwtag  DW_TAG_member
    2181                      .dwattr $C$DW$192, DW_AT_type(*$C$DW$T$19)
    2182                      .dwattr $C$DW$192, DW_AT_name("GPIO47")
    2183                      .dwattr $C$DW$192, DW_AT_TI_symbol_name("_GPIO47")
    2184                      .dwattr $C$DW$192, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    2185                      .dwattr $C$DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2186                      .dwattr $C$DW$192, DW_AT_accessibility(DW_ACCESS_public)
    2187              $C$DW$193       .dwtag  DW_TAG_member
    2188                      .dwattr $C$DW$193, DW_AT_type(*$C$DW$T$19)
    2189                      .dwattr $C$DW$193, DW_AT_name("GPIO48")
    2190                      .dwattr $C$DW$193, DW_AT_TI_symbol_name("_GPIO48")
    2191                      .dwattr $C$DW$193, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    2192                      .dwattr $C$DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2193                      .dwattr $C$DW$193, DW_AT_accessibility(DW_ACCESS_public)
    2194              $C$DW$194       .dwtag  DW_TAG_member
    2195                      .dwattr $C$DW$194, DW_AT_type(*$C$DW$T$19)
    2196                      .dwattr $C$DW$194, DW_AT_name("GPIO49")
    2197                      .dwattr $C$DW$194, DW_AT_TI_symbol_name("_GPIO49")
    2198                      .dwattr $C$DW$194, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    2199                      .dwattr $C$DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2200                      .dwattr $C$DW$194, DW_AT_accessibility(DW_ACCESS_public)
    2201              $C$DW$195       .dwtag  DW_TAG_member
    2202                      .dwattr $C$DW$195, DW_AT_type(*$C$DW$T$19)
    2203                      .dwattr $C$DW$195, DW_AT_name("GPIO50")
    2204                      .dwattr $C$DW$195, DW_AT_TI_symbol_name("_GPIO50")
    2205                      .dwattr $C$DW$195, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    2206                      .dwattr $C$DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2207                      .dwattr $C$DW$195, DW_AT_accessibility(DW_ACCESS_public)
    2208              $C$DW$196       .dwtag  DW_TAG_member
    2209                      .dwattr $C$DW$196, DW_AT_type(*$C$DW$T$19)
    2210                      .dwattr $C$DW$196, DW_AT_name("GPIO51")
    2211                      .dwattr $C$DW$196, DW_AT_TI_symbol_name("_GPIO51")
    2212                      .dwattr $C$DW$196, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    2213                      .dwattr $C$DW$196, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2214                      .dwattr $C$DW$196, DW_AT_accessibility(DW_ACCESS_public)
    2215              $C$DW$197       .dwtag  DW_TAG_member
    2216                      .dwattr $C$DW$197, DW_AT_type(*$C$DW$T$19)
    2217                      .dwattr $C$DW$197, DW_AT_name("GPIO52")
    2218                      .dwattr $C$DW$197, DW_AT_TI_symbol_name("_GPIO52")
    2219                      .dwattr $C$DW$197, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:10 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0517210                           PAGE   43

    2220                      .dwattr $C$DW$197, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2221                      .dwattr $C$DW$197, DW_AT_accessibility(DW_ACCESS_public)
    2222              $C$DW$198       .dwtag  DW_TAG_member
    2223                      .dwattr $C$DW$198, DW_AT_type(*$C$DW$T$19)
    2224                      .dwattr $C$DW$198, DW_AT_name("GPIO53")
    2225                      .dwattr $C$DW$198, DW_AT_TI_symbol_name("_GPIO53")
    2226                      .dwattr $C$DW$198, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    2227                      .dwattr $C$DW$198, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2228                      .dwattr $C$DW$198, DW_AT_accessibility(DW_ACCESS_public)
    2229              $C$DW$199       .dwtag  DW_TAG_member
    2230                      .dwattr $C$DW$199, DW_AT_type(*$C$DW$T$19)
    2231                      .dwattr $C$DW$199, DW_AT_name("GPIO54")
    2232                      .dwattr $C$DW$199, DW_AT_TI_symbol_name("_GPIO54")
    2233                      .dwattr $C$DW$199, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    2234                      .dwattr $C$DW$199, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2235                      .dwattr $C$DW$199, DW_AT_accessibility(DW_ACCESS_public)
    2236              $C$DW$200       .dwtag  DW_TAG_member
    2237                      .dwattr $C$DW$200, DW_AT_type(*$C$DW$T$19)
    2238                      .dwattr $C$DW$200, DW_AT_name("GPIO55")
    2239                      .dwattr $C$DW$200, DW_AT_TI_symbol_name("_GPIO55")
    2240                      .dwattr $C$DW$200, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    2241                      .dwattr $C$DW$200, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2242                      .dwattr $C$DW$200, DW_AT_accessibility(DW_ACCESS_public)
    2243              $C$DW$201       .dwtag  DW_TAG_member
    2244                      .dwattr $C$DW$201, DW_AT_type(*$C$DW$T$19)
    2245                      .dwattr $C$DW$201, DW_AT_name("GPIO56")
    2246                      .dwattr $C$DW$201, DW_AT_TI_symbol_name("_GPIO56")
    2247                      .dwattr $C$DW$201, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
    2248                      .dwattr $C$DW$201, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2249                      .dwattr $C$DW$201, DW_AT_accessibility(DW_ACCESS_public)
    2250              $C$DW$202       .dwtag  DW_TAG_member
    2251                      .dwattr $C$DW$202, DW_AT_type(*$C$DW$T$19)
    2252                      .dwattr $C$DW$202, DW_AT_name("GPIO57")
    2253                      .dwattr $C$DW$202, DW_AT_TI_symbol_name("_GPIO57")
    2254                      .dwattr $C$DW$202, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    2255                      .dwattr $C$DW$202, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2256                      .dwattr $C$DW$202, DW_AT_accessibility(DW_ACCESS_public)
    2257              $C$DW$203       .dwtag  DW_TAG_member
    2258                      .dwattr $C$DW$203, DW_AT_type(*$C$DW$T$19)
    2259                      .dwattr $C$DW$203, DW_AT_name("GPIO58")
    2260                      .dwattr $C$DW$203, DW_AT_TI_symbol_name("_GPIO58")
    2261                      .dwattr $C$DW$203, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
    2262                      .dwattr $C$DW$203, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2263                      .dwattr $C$DW$203, DW_AT_accessibility(DW_ACCESS_public)
    2264              $C$DW$204       .dwtag  DW_TAG_member
    2265                      .dwattr $C$DW$204, DW_AT_type(*$C$DW$T$19)
    2266                      .dwattr $C$DW$204, DW_AT_name("GPIO59")
    2267                      .dwattr $C$DW$204, DW_AT_TI_symbol_name("_GPIO59")
    2268                      .dwattr $C$DW$204, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
    2269                      .dwattr $C$DW$204, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2270                      .dwattr $C$DW$204, DW_AT_accessibility(DW_ACCESS_public)
    2271              $C$DW$205       .dwtag  DW_TAG_member
    2272                      .dwattr $C$DW$205, DW_AT_type(*$C$DW$T$19)
    2273                      .dwattr $C$DW$205, DW_AT_name("GPIO60")
    2274                      .dwattr $C$DW$205, DW_AT_TI_symbol_name("_GPIO60")
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:10 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0517210                           PAGE   44

    2275                      .dwattr $C$DW$205, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
    2276                      .dwattr $C$DW$205, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2277                      .dwattr $C$DW$205, DW_AT_accessibility(DW_ACCESS_public)
    2278              $C$DW$206       .dwtag  DW_TAG_member
    2279                      .dwattr $C$DW$206, DW_AT_type(*$C$DW$T$19)
    2280                      .dwattr $C$DW$206, DW_AT_name("GPIO61")
    2281                      .dwattr $C$DW$206, DW_AT_TI_symbol_name("_GPIO61")
    2282                      .dwattr $C$DW$206, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
    2283                      .dwattr $C$DW$206, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2284                      .dwattr $C$DW$206, DW_AT_accessibility(DW_ACCESS_public)
    2285              $C$DW$207       .dwtag  DW_TAG_member
    2286                      .dwattr $C$DW$207, DW_AT_type(*$C$DW$T$19)
    2287                      .dwattr $C$DW$207, DW_AT_name("GPIO62")
    2288                      .dwattr $C$DW$207, DW_AT_TI_symbol_name("_GPIO62")
    2289                      .dwattr $C$DW$207, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
    2290                      .dwattr $C$DW$207, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2291                      .dwattr $C$DW$207, DW_AT_accessibility(DW_ACCESS_public)
    2292              $C$DW$208       .dwtag  DW_TAG_member
    2293                      .dwattr $C$DW$208, DW_AT_type(*$C$DW$T$19)
    2294                      .dwattr $C$DW$208, DW_AT_name("GPIO63")
    2295                      .dwattr $C$DW$208, DW_AT_TI_symbol_name("_GPIO63")
    2296                      .dwattr $C$DW$208, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    2297                      .dwattr $C$DW$208, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2298                      .dwattr $C$DW$208, DW_AT_accessibility(DW_ACCESS_public)
    2299                      .dwendtag $C$DW$T$35
    2300              
    2301              
    2302              $C$DW$T$36      .dwtag  DW_TAG_union_type
    2303                      .dwattr $C$DW$T$36, DW_AT_name("GPBDAT_REG")
    2304                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x02)
    2305              $C$DW$209       .dwtag  DW_TAG_member
    2306                      .dwattr $C$DW$209, DW_AT_type(*$C$DW$T$21)
    2307                      .dwattr $C$DW$209, DW_AT_name("all")
    2308                      .dwattr $C$DW$209, DW_AT_TI_symbol_name("_all")
    2309                      .dwattr $C$DW$209, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2310                      .dwattr $C$DW$209, DW_AT_accessibility(DW_ACCESS_public)
    2311              $C$DW$210       .dwtag  DW_TAG_member
    2312                      .dwattr $C$DW$210, DW_AT_type(*$C$DW$T$35)
    2313                      .dwattr $C$DW$210, DW_AT_name("bit")
    2314                      .dwattr $C$DW$210, DW_AT_TI_symbol_name("_bit")
    2315                      .dwattr $C$DW$210, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2316                      .dwattr $C$DW$210, DW_AT_accessibility(DW_ACCESS_public)
    2317                      .dwendtag $C$DW$T$36
    2318              
    2319              
    2320              $C$DW$T$37      .dwtag  DW_TAG_structure_type
    2321                      .dwattr $C$DW$T$37, DW_AT_name("GPC1_BITS")
    2322                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x02)
    2323              $C$DW$211       .dwtag  DW_TAG_member
