TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:10 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0600410                           PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v6.2.7 *
       3              ;* Date/Time created: Thu Jul 02 08:31:10 2015                 *
       4              ;***************************************************************
       5                      .compiler_opts --diag_wrap=off --float_support=fpu32 --hll_source=on --mem_model:code=flat --mem_mode
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("../UART/UartAdded.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v6.2.7 Copyright (c) 1996-2014 Texas I
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("D:\ActiveProject\EKT5\PKMT_NONBIOS\InvertorCntrl\ISPprg")
      13              
      14              $C$DW$1 .dwtag  DW_TAG_subprogram, DW_AT_name("initUartBBufer")
      15                      .dwattr $C$DW$1, DW_AT_TI_symbol_name("_initUartBBufer")
      16                      .dwattr $C$DW$1, DW_AT_declaration

    1171 0000008b 761F!         MOVW      DP,#_ScibRegs+11      ; [CPU_U] 
         0000008c 0000 
    1172 0000008d 1A0B!         OR        @_ScibRegs+11,#0x0020 ; [CPU_] |323| 
         0000008e 0020 
    1173                      .dwpsn  file "../UART/UartAdded.c",line 332,column 1,is_stmt
    1174              $C$DW$58        .dwtag  DW_TAG_TI_branch
    1175                      .dwattr $C$DW$58, DW_AT_low_pc(0x00)
    1176                      .dwattr $C$DW$58, DW_AT_TI_return
    1177 0000008f 0006          LRETR     ; [CPU_] 
    1178                      ; return occurs ; [] 
    1179                      .dwattr $C$DW$57, DW_AT_TI_end_file("../UART/UartAdded.c")
    1180                      .dwattr $C$DW$57, DW_AT_TI_end_line(0x14c)
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:10 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0600410                           PAGE   24

    1181                      .dwattr $C$DW$57, DW_AT_TI_end_column(0x01)
    1182                      .dwendentry
    1183                      .dwendtag $C$DW$57
    1184              
    1185 00000090               .sect   ".text"
    1186                      .clink
    1187                      .global _disableSciRcIntAddRS
    1188              
    1189              $C$DW$59        .dwtag  DW_TAG_subprogram, DW_AT_name("disableSciRcIntAddRS")
    1190                      .dwattr $C$DW$59, DW_AT_low_pc(_disableSciRcIntAddRS)
    1191                      .dwattr $C$DW$59, DW_AT_high_pc(0x00)
    1192                      .dwattr $C$DW$59, DW_AT_TI_symbol_name("_disableSciRcIntAddRS")
    1193                      .dwattr $C$DW$59, DW_AT_external
    1194                      .dwattr $C$DW$59, DW_AT_TI_begin_file("../UART/UartAdded.c")
    1195                      .dwattr $C$DW$59, DW_AT_TI_begin_line(0x14e)
    1196                      .dwattr $C$DW$59, DW_AT_TI_begin_column(0x06)
    1197                      .dwattr $C$DW$59, DW_AT_TI_max_frame_size(-2)
    1198                      .dwpsn  file "../UART/UartAdded.c",line 335,column 1,is_stmt,address _disableSciRcIntAddRS
    1199              
    1200                      .dwfde $C$DW$CIE, _disableSciRcIntAddRS
    1201              
    1202              ;***************************************************************
    1203              ;* FNAME: _disableSciRcIntAddRS         FR SIZE:   0           *
    1204              ;*                                                             *
    1205              ;* FUNCTION ENVIRONMENT                                        *
    1206              ;*                                                             *
    1207              ;* FUNCTION PROPERTIES                                         *
    1208              ;*                            0 Parameter,  0 Auto,  0 SOE     *
    1209              ;***************************************************************
    1210              
    1211 00000090       _disableSciRcIntAddRS:
    1212                      .dwcfi  cfa_offset, -2
    1213                      .dwcfi  save_reg_to_mem, 26, 0
    1214                      .dwcfi  save_reg_to_reg, 78, 26
    1215                      .dwpsn  file "../UART/UartAdded.c",line 337,column 2,is_stmt
    1216 00000090 761F!         MOVW      DP,#_ScibRegs+11      ; [CPU_U] 
         00000091 0000 
    1217 00000092 180B!         AND       @_ScibRegs+11,#0xffdf ; [CPU_] |337| 
         00000093 FFDF 
    1218                      .dwpsn  file "../UART/UartAdded.c",line 345,column 1,is_stmt
    1219              $C$DW$60        .dwtag  DW_TAG_TI_branch
    1220                      .dwattr $C$DW$60, DW_AT_low_pc(0x00)
    1221                      .dwattr $C$DW$60, DW_AT_TI_return
    1222 00000094 0006          LRETR     ; [CPU_] 
    1223                      ; return occurs ; [] 
    1224                      .dwattr $C$DW$59, DW_AT_TI_end_file("../UART/UartAdded.c")
    1225                      .dwattr $C$DW$59, DW_AT_TI_end_line(0x159)
    1226                      .dwattr $C$DW$59, DW_AT_TI_end_column(0x01)
    1227                      .dwendentry
    1228                      .dwendtag $C$DW$59
    1229              
    1230              ;**************************************************************
    1231              ;* UNDEFINED EXTERNAL REFERENCES                              *
    1232              ;**************************************************************
    1233                      .global _initUartBBufer
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:10 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0600410                           PAGE   25

    1234                      .global _testRcBufB
    1235                      .global _putRcBufBFromInt
    1236                      .global _getTxBufBForInt
    1237                      .global _ScibRegs
    1238                      .global _PieCtrlRegs
    1239                      .global _GpioCtrlRegs
    1240                      .global _PieVectTable
    1241              
    1242              ;***************************************************************
    1243              ;* TYPE INFORMATION                                            *
    1244              ;***************************************************************
    1245              
    1246              $C$DW$T$20      .dwtag  DW_TAG_structure_type
    1247                      .dwattr $C$DW$T$20, DW_AT_name("GPA1_BITS")
    1248                      .dwattr $C$DW$T$20, DW_AT_byte_size(0x02)
    1249              $C$DW$61        .dwtag  DW_TAG_member
    1250                      .dwattr $C$DW$61, DW_AT_type(*$C$DW$T$19)
    1251                      .dwattr $C$DW$61, DW_AT_name("GPIO0")
    1252                      .dwattr $C$DW$61, DW_AT_TI_symbol_name("_GPIO0")
    1253                      .dwattr $C$DW$61, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x02)
    1254                      .dwattr $C$DW$61, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1255                      .dwattr $C$DW$61, DW_AT_accessibility(DW_ACCESS_public)
    1256              $C$DW$62        .dwtag  DW_TAG_member
    1257                      .dwattr $C$DW$62, DW_AT_type(*$C$DW$T$19)
    1258                      .dwattr $C$DW$62, DW_AT_name("GPIO1")
    1259                      .dwattr $C$DW$62, DW_AT_TI_symbol_name("_GPIO1")
    1260                      .dwattr $C$DW$62, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x02)
    1261                      .dwattr $C$DW$62, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1262                      .dwattr $C$DW$62, DW_AT_accessibility(DW_ACCESS_public)
    1263              $C$DW$63        .dwtag  DW_TAG_member
    1264                      .dwattr $C$DW$63, DW_AT_type(*$C$DW$T$19)
    1265                      .dwattr $C$DW$63, DW_AT_name("GPIO2")
    1266                      .dwattr $C$DW$63, DW_AT_TI_symbol_name("_GPIO2")
    1267                      .dwattr $C$DW$63, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x02)
    1268                      .dwattr $C$DW$63, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1269                      .dwattr $C$DW$63, DW_AT_accessibility(DW_ACCESS_public)
    1270              $C$DW$64        .dwtag  DW_TAG_member
    1271                      .dwattr $C$DW$64, DW_AT_type(*$C$DW$T$19)
    1272                      .dwattr $C$DW$64, DW_AT_name("GPIO3")
    1273                      .dwattr $C$DW$64, DW_AT_TI_symbol_name("_GPIO3")
    1274                      .dwattr $C$DW$64, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x02)
    1275                      .dwattr $C$DW$64, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1276                      .dwattr $C$DW$64, DW_AT_accessibility(DW_ACCESS_public)
    1277              $C$DW$65        .dwtag  DW_TAG_member
    1278                      .dwattr $C$DW$65, DW_AT_type(*$C$DW$T$19)
    1279                      .dwattr $C$DW$65, DW_AT_name("GPIO4")
    1280                      .dwattr $C$DW$65, DW_AT_TI_symbol_name("_GPIO4")
    1281                      .dwattr $C$DW$65, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x02)
    1282                      .dwattr $C$DW$65, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1283                      .dwattr $C$DW$65, DW_AT_accessibility(DW_ACCESS_public)
    1284              $C$DW$66        .dwtag  DW_TAG_member
    1285                      .dwattr $C$DW$66, DW_AT_type(*$C$DW$T$19)
    1286                      .dwattr $C$DW$66, DW_AT_name("GPIO5")
    1287                      .dwattr $C$DW$66, DW_AT_TI_symbol_name("_GPIO5")
    1288                      .dwattr $C$DW$66, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x02)
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:10 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0600410                           PAGE   26

    1289                      .dwattr $C$DW$66, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1290                      .dwattr $C$DW$66, DW_AT_accessibility(DW_ACCESS_public)
    1291              $C$DW$67        .dwtag  DW_TAG_member
    1292                      .dwattr $C$DW$67, DW_AT_type(*$C$DW$T$19)
    1293                      .dwattr $C$DW$67, DW_AT_name("GPIO6")
    1294                      .dwattr $C$DW$67, DW_AT_TI_symbol_name("_GPIO6")
    1295                      .dwattr $C$DW$67, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x02)
    1296                      .dwattr $C$DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1297                      .dwattr $C$DW$67, DW_AT_accessibility(DW_ACCESS_public)
    1298              $C$DW$68        .dwtag  DW_TAG_member
    1299                      .dwattr $C$DW$68, DW_AT_type(*$C$DW$T$19)
    1300                      .dwattr $C$DW$68, DW_AT_name("GPIO7")
    1301                      .dwattr $C$DW$68, DW_AT_TI_symbol_name("_GPIO7")
    1302                      .dwattr $C$DW$68, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x02)
    1303                      .dwattr $C$DW$68, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1304                      .dwattr $C$DW$68, DW_AT_accessibility(DW_ACCESS_public)
    1305              $C$DW$69        .dwtag  DW_TAG_member
    1306                      .dwattr $C$DW$69, DW_AT_type(*$C$DW$T$19)
    1307                      .dwattr $C$DW$69, DW_AT_name("GPIO8")
    1308                      .dwattr $C$DW$69, DW_AT_TI_symbol_name("_GPIO8")
    1309                      .dwattr $C$DW$69, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x02)
    1310                      .dwattr $C$DW$69, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1311                      .dwattr $C$DW$69, DW_AT_accessibility(DW_ACCESS_public)
    1312              $C$DW$70        .dwtag  DW_TAG_member
    1313                      .dwattr $C$DW$70, DW_AT_type(*$C$DW$T$19)
    1314                      .dwattr $C$DW$70, DW_AT_name("GPIO9")
    1315                      .dwattr $C$DW$70, DW_AT_TI_symbol_name("_GPIO9")
    1316                      .dwattr $C$DW$70, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x02)
    1317                      .dwattr $C$DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1318                      .dwattr $C$DW$70, DW_AT_accessibility(DW_ACCESS_public)
    1319              $C$DW$71        .dwtag  DW_TAG_member
    1320                      .dwattr $C$DW$71, DW_AT_type(*$C$DW$T$19)
    1321                      .dwattr $C$DW$71, DW_AT_name("GPIO10")
    1322                      .dwattr $C$DW$71, DW_AT_TI_symbol_name("_GPIO10")
    1323                      .dwattr $C$DW$71, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x02)
    1324                      .dwattr $C$DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1325                      .dwattr $C$DW$71, DW_AT_accessibility(DW_ACCESS_public)
    1326              $C$DW$72        .dwtag  DW_TAG_member
    1327                      .dwattr $C$DW$72, DW_AT_type(*$C$DW$T$19)
    1328                      .dwattr $C$DW$72, DW_AT_name("GPIO11")
    1329                      .dwattr $C$DW$72, DW_AT_TI_symbol_name("_GPIO11")
    1330                      .dwattr $C$DW$72, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x02)
    1331                      .dwattr $C$DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1332                      .dwattr $C$DW$72, DW_AT_accessibility(DW_ACCESS_public)
    1333              $C$DW$73        .dwtag  DW_TAG_member
    1334                      .dwattr $C$DW$73, DW_AT_type(*$C$DW$T$19)
    1335                      .dwattr $C$DW$73, DW_AT_name("GPIO12")
    1336                      .dwattr $C$DW$73, DW_AT_TI_symbol_name("_GPIO12")
    1337                      .dwattr $C$DW$73, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x02)
    1338                      .dwattr $C$DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1339                      .dwattr $C$DW$73, DW_AT_accessibility(DW_ACCESS_public)
    1340              $C$DW$74        .dwtag  DW_TAG_member
    1341                      .dwattr $C$DW$74, DW_AT_type(*$C$DW$T$19)
    1342                      .dwattr $C$DW$74, DW_AT_name("GPIO13")
    1343                      .dwattr $C$DW$74, DW_AT_TI_symbol_name("_GPIO13")
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:10 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0600410                           PAGE   27

    1344                      .dwattr $C$DW$74, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x02)
    1345                      .dwattr $C$DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1346                      .dwattr $C$DW$74, DW_AT_accessibility(DW_ACCESS_public)
    1347              $C$DW$75        .dwtag  DW_TAG_member
    1348                      .dwattr $C$DW$75, DW_AT_type(*$C$DW$T$19)
    1349                      .dwattr $C$DW$75, DW_AT_name("GPIO14")
    1350                      .dwattr $C$DW$75, DW_AT_TI_symbol_name("_GPIO14")
    1351                      .dwattr $C$DW$75, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x02)
    1352                      .dwattr $C$DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1353                      .dwattr $C$DW$75, DW_AT_accessibility(DW_ACCESS_public)
    1354              $C$DW$76        .dwtag  DW_TAG_member
    1355                      .dwattr $C$DW$76, DW_AT_type(*$C$DW$T$19)
    1356                      .dwattr $C$DW$76, DW_AT_name("GPIO15")
    1357                      .dwattr $C$DW$76, DW_AT_TI_symbol_name("_GPIO15")
    1358                      .dwattr $C$DW$76, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x02)
    1359                      .dwattr $C$DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1360                      .dwattr $C$DW$76, DW_AT_accessibility(DW_ACCESS_public)
    1361                      .dwendtag $C$DW$T$20
    1362              
    1363              
    1364              $C$DW$T$22      .dwtag  DW_TAG_union_type
    1365                      .dwattr $C$DW$T$22, DW_AT_name("GPA1_REG")
    1366                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x02)
    1367              $C$DW$77        .dwtag  DW_TAG_member
    1368                      .dwattr $C$DW$77, DW_AT_type(*$C$DW$T$21)
    1369                      .dwattr $C$DW$77, DW_AT_name("all")
    1370                      .dwattr $C$DW$77, DW_AT_TI_symbol_name("_all")
    1371                      .dwattr $C$DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1372                      .dwattr $C$DW$77, DW_AT_accessibility(DW_ACCESS_public)
    1373              $C$DW$78        .dwtag  DW_TAG_member
    1374                      .dwattr $C$DW$78, DW_AT_type(*$C$DW$T$20)
    1375                      .dwattr $C$DW$78, DW_AT_name("bit")
    1376                      .dwattr $C$DW$78, DW_AT_TI_symbol_name("_bit")
    1377                      .dwattr $C$DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1378                      .dwattr $C$DW$78, DW_AT_accessibility(DW_ACCESS_public)
    1379                      .dwendtag $C$DW$T$22
    1380              
    1381              
    1382              $C$DW$T$23      .dwtag  DW_TAG_structure_type
    1383                      .dwattr $C$DW$T$23, DW_AT_name("GPA2_BITS")
    1384                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x02)
    1385              $C$DW$79        .dwtag  DW_TAG_member
    1386                      .dwattr $C$DW$79, DW_AT_type(*$C$DW$T$19)
    1387                      .dwattr $C$DW$79, DW_AT_name("GPIO16")
    1388                      .dwattr $C$DW$79, DW_AT_TI_symbol_name("_GPIO16")
    1389                      .dwattr $C$DW$79, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x02)
    1390                      .dwattr $C$DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1391                      .dwattr $C$DW$79, DW_AT_accessibility(DW_ACCESS_public)
    1392              $C$DW$80        .dwtag  DW_TAG_member
    1393                      .dwattr $C$DW$80, DW_AT_type(*$C$DW$T$19)
    1394                      .dwattr $C$DW$80, DW_AT_name("GPIO17")
    1395                      .dwattr $C$DW$80, DW_AT_TI_symbol_name("_GPIO17")
    1396                      .dwattr $C$DW$80, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x02)
    1397                      .dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1398                      .dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:10 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0600410                           PAGE   28

    1399              $C$DW$81        .dwtag  DW_TAG_member
    1400                      .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$19)
    1401                      .dwattr $C$DW$81, DW_AT_name("GPIO18")
    1402                      .dwattr $C$DW$81, DW_AT_TI_symbol_name("_GPIO18")
    1403                      .dwattr $C$DW$81, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x02)
    1404                      .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1405                      .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
    1406              $C$DW$82        .dwtag  DW_TAG_member
    1407                      .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$19)
    1408                      .dwattr $C$DW$82, DW_AT_name("GPIO19")
    1409                      .dwattr $C$DW$82, DW_AT_TI_symbol_name("_GPIO19")
    1410                      .dwattr $C$DW$82, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x02)
    1411                      .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1412                      .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
    1413              $C$DW$83        .dwtag  DW_TAG_member
    1414                      .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$19)
    1415                      .dwattr $C$DW$83, DW_AT_name("GPIO20")
    1416                      .dwattr $C$DW$83, DW_AT_TI_symbol_name("_GPIO20")
    1417                      .dwattr $C$DW$83, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x02)
    1418                      .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1419                      .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
    1420              $C$DW$84        .dwtag  DW_TAG_member
    1421                      .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$19)
    1422                      .dwattr $C$DW$84, DW_AT_name("GPIO21")
    1423                      .dwattr $C$DW$84, DW_AT_TI_symbol_name("_GPIO21")
    1424                      .dwattr $C$DW$84, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x02)
    1425                      .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1426                      .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
    1427              $C$DW$85        .dwtag  DW_TAG_member
    1428                      .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$19)
    1429                      .dwattr $C$DW$85, DW_AT_name("GPIO22")
    1430                      .dwattr $C$DW$85, DW_AT_TI_symbol_name("_GPIO22")
    1431                      .dwattr $C$DW$85, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x02)
    1432                      .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1433                      .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
    1434              $C$DW$86        .dwtag  DW_TAG_member
    1435                      .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$19)
    1436                      .dwattr $C$DW$86, DW_AT_name("GPIO23")
    1437                      .dwattr $C$DW$86, DW_AT_TI_symbol_name("_GPIO23")
    1438                      .dwattr $C$DW$86, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x02)
    1439                      .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1440                      .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
    1441              $C$DW$87        .dwtag  DW_TAG_member
    1442                      .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$19)
    1443                      .dwattr $C$DW$87, DW_AT_name("GPIO24")
    1444                      .dwattr $C$DW$87, DW_AT_TI_symbol_name("_GPIO24")
    1445                      .dwattr $C$DW$87, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x02)
    1446                      .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1447                      .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
    1448              $C$DW$88        .dwtag  DW_TAG_member
    1449                      .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$19)
    1450                      .dwattr $C$DW$88, DW_AT_name("GPIO25")
    1451                      .dwattr $C$DW$88, DW_AT_TI_symbol_name("_GPIO25")
    1452                      .dwattr $C$DW$88, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x02)
    1453                      .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:10 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0600410                           PAGE   29

    1454                      .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
    1455              $C$DW$89        .dwtag  DW_TAG_member
    1456                      .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$19)
    1457                      .dwattr $C$DW$89, DW_AT_name("GPIO26")
    1458                      .dwattr $C$DW$89, DW_AT_TI_symbol_name("_GPIO26")
    1459                      .dwattr $C$DW$89, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x02)
    1460                      .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1461                      .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
    1462              $C$DW$90        .dwtag  DW_TAG_member
    1463                      .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$19)
    1464                      .dwattr $C$DW$90, DW_AT_name("GPIO27")
    1465                      .dwattr $C$DW$90, DW_AT_TI_symbol_name("_GPIO27")
    1466                      .dwattr $C$DW$90, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x02)
    1467                      .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1468                      .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
    1469              $C$DW$91        .dwtag  DW_TAG_member
    1470                      .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$19)
    1471                      .dwattr $C$DW$91, DW_AT_name("GPIO28")
    1472                      .dwattr $C$DW$91, DW_AT_TI_symbol_name("_GPIO28")
    1473                      .dwattr $C$DW$91, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x02)
    1474                      .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1475                      .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
    1476              $C$DW$92        .dwtag  DW_TAG_member
    1477                      .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$19)
    1478                      .dwattr $C$DW$92, DW_AT_name("GPIO29")
    1479                      .dwattr $C$DW$92, DW_AT_TI_symbol_name("_GPIO29")
    1480                      .dwattr $C$DW$92, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x02)
    1481                      .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1482                      .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
    1483              $C$DW$93        .dwtag  DW_TAG_member
    1484                      .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$19)
    1485                      .dwattr $C$DW$93, DW_AT_name("GPIO30")
    1486                      .dwattr $C$DW$93, DW_AT_TI_symbol_name("_GPIO30")
    1487                      .dwattr $C$DW$93, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x02)
    1488                      .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1489                      .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
    1490              $C$DW$94        .dwtag  DW_TAG_member
    1491                      .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$19)
    1492                      .dwattr $C$DW$94, DW_AT_name("GPIO31")
    1493                      .dwattr $C$DW$94, DW_AT_TI_symbol_name("_GPIO31")
    1494                      .dwattr $C$DW$94, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x02)
    1495                      .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1496                      .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
    1497                      .dwendtag $C$DW$T$23
    1498              
    1499              
    1500              $C$DW$T$24      .dwtag  DW_TAG_union_type
    1501                      .dwattr $C$DW$T$24, DW_AT_name("GPA2_REG")
    1502                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x02)
    1503              $C$DW$95        .dwtag  DW_TAG_member
    1504                      .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$21)
    1505                      .dwattr $C$DW$95, DW_AT_name("all")
    1506                      .dwattr $C$DW$95, DW_AT_TI_symbol_name("_all")
    1507                      .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1508                      .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:10 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0600410                           PAGE   30

    1509              $C$DW$96        .dwtag  DW_TAG_member
    1510                      .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$23)
    1511                      .dwattr $C$DW$96, DW_AT_name("bit")
    1512                      .dwattr $C$DW$96, DW_AT_TI_symbol_name("_bit")
    1513                      .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1514                      .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
    1515                      .dwendtag $C$DW$T$24
    1516              
    1517              
    1518              $C$DW$T$25      .dwtag  DW_TAG_structure_type
    1519                      .dwattr $C$DW$T$25, DW_AT_name("GPACTRL_BITS")
    1520                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x02)
    1521              $C$DW$97        .dwtag  DW_TAG_member
    1522                      .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$19)
    1523                      .dwattr $C$DW$97, DW_AT_name("QUALPRD0")
    1524                      .dwattr $C$DW$97, DW_AT_TI_symbol_name("_QUALPRD0")
    1525                      .dwattr $C$DW$97, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x08)
    1526                      .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1527                      .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
    1528              $C$DW$98        .dwtag  DW_TAG_member
    1529                      .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$19)
    1530                      .dwattr $C$DW$98, DW_AT_name("QUALPRD1")
    1531                      .dwattr $C$DW$98, DW_AT_TI_symbol_name("_QUALPRD1")
    1532                      .dwattr $C$DW$98, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x08)
    1533                      .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1534                      .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
    1535              $C$DW$99        .dwtag  DW_TAG_member
    1536                      .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$19)
    1537                      .dwattr $C$DW$99, DW_AT_name("QUALPRD2")
    1538                      .dwattr $C$DW$99, DW_AT_TI_symbol_name("_QUALPRD2")
    1539                      .dwattr $C$DW$99, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x08)
    1540                      .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1541                      .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
    1542              $C$DW$100       .dwtag  DW_TAG_member
    1543                      .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$19)
    1544                      .dwattr $C$DW$100, DW_AT_name("QUALPRD3")
    1545                      .dwattr $C$DW$100, DW_AT_TI_symbol_name("_QUALPRD3")
    1546                      .dwattr $C$DW$100, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x08)
    1547                      .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1548                      .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
    1549                      .dwendtag $C$DW$T$25
    1550              
    1551              
    1552              $C$DW$T$26      .dwtag  DW_TAG_union_type
    1553                      .dwattr $C$DW$T$26, DW_AT_name("GPACTRL_REG")
    1554                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x02)
    1555              $C$DW$101       .dwtag  DW_TAG_member
    1556                      .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$21)
    1557                      .dwattr $C$DW$101, DW_AT_name("all")
    1558                      .dwattr $C$DW$101, DW_AT_TI_symbol_name("_all")
    1559                      .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1560                      .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
    1561              $C$DW$102       .dwtag  DW_TAG_member
    1562                      .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$25)
    1563                      .dwattr $C$DW$102, DW_AT_name("bit")
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:10 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0600410                           PAGE   31

    1564                      .dwattr $C$DW$102, DW_AT_TI_symbol_name("_bit")
    1565                      .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1566                      .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
    1567                      .dwendtag $C$DW$T$26
    1568              
    1569              
    1570              $C$DW$T$27      .dwtag  DW_TAG_structure_type
    1571                      .dwattr $C$DW$T$27, DW_AT_name("GPADAT_BITS")
    1572                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x02)
    1573              $C$DW$103       .dwtag  DW_TAG_member
    1574                      .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$19)
    1575                      .dwattr $C$DW$103, DW_AT_name("GPIO0")
    1576                      .dwattr $C$DW$103, DW_AT_TI_symbol_name("_GPIO0")
    1577                      .dwattr $C$DW$103, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    1578                      .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1579                      .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
    1580              $C$DW$104       .dwtag  DW_TAG_member
    1581                      .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$19)
    1582                      .dwattr $C$DW$104, DW_AT_name("GPIO1")
    1583                      .dwattr $C$DW$104, DW_AT_TI_symbol_name("_GPIO1")
    1584                      .dwattr $C$DW$104, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    1585                      .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1586                      .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
    1587              $C$DW$105       .dwtag  DW_TAG_member
    1588                      .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$19)
    1589                      .dwattr $C$DW$105, DW_AT_name("GPIO2")
    1590                      .dwattr $C$DW$105, DW_AT_TI_symbol_name("_GPIO2")
    1591                      .dwattr $C$DW$105, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    1592                      .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1593                      .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
    1594              $C$DW$106       .dwtag  DW_TAG_member
    1595                      .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$19)
    1596                      .dwattr $C$DW$106, DW_AT_name("GPIO3")
    1597                      .dwattr $C$DW$106, DW_AT_TI_symbol_name("_GPIO3")
    1598                      .dwattr $C$DW$106, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    1599                      .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1600                      .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    1601              $C$DW$107       .dwtag  DW_TAG_member
    1602                      .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$19)
    1603                      .dwattr $C$DW$107, DW_AT_name("GPIO4")
    1604                      .dwattr $C$DW$107, DW_AT_TI_symbol_name("_GPIO4")
    1605                      .dwattr $C$DW$107, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    1606                      .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1607                      .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
    1608              $C$DW$108       .dwtag  DW_TAG_member
    1609                      .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$19)
    1610                      .dwattr $C$DW$108, DW_AT_name("GPIO5")
    1611                      .dwattr $C$DW$108, DW_AT_TI_symbol_name("_GPIO5")
    1612                      .dwattr $C$DW$108, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    1613                      .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1614                      .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    1615              $C$DW$109       .dwtag  DW_TAG_member
    1616                      .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$19)
    1617                      .dwattr $C$DW$109, DW_AT_name("GPIO6")
    1618                      .dwattr $C$DW$109, DW_AT_TI_symbol_name("_GPIO6")
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:10 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0600410                           PAGE   32

    1619                      .dwattr $C$DW$109, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    1620                      .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1621                      .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    1622              $C$DW$110       .dwtag  DW_TAG_member
    1623                      .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$19)
    1624                      .dwattr $C$DW$110, DW_AT_name("GPIO7")
    1625                      .dwattr $C$DW$110, DW_AT_TI_symbol_name("_GPIO7")
    1626                      .dwattr $C$DW$110, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    1627                      .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1628                      .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    1629              $C$DW$111       .dwtag  DW_TAG_member
    1630                      .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$19)
    1631                      .dwattr $C$DW$111, DW_AT_name("GPIO8")
    1632                      .dwattr $C$DW$111, DW_AT_TI_symbol_name("_GPIO8")
    1633                      .dwattr $C$DW$111, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
    1634                      .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1635                      .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    1636              $C$DW$112       .dwtag  DW_TAG_member
    1637                      .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$19)
    1638                      .dwattr $C$DW$112, DW_AT_name("GPIO9")
    1639                      .dwattr $C$DW$112, DW_AT_TI_symbol_name("_GPIO9")
    1640                      .dwattr $C$DW$112, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    1641                      .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1642                      .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    1643              $C$DW$113       .dwtag  DW_TAG_member
    1644                      .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$19)
    1645                      .dwattr $C$DW$113, DW_AT_name("GPIO10")
    1646                      .dwattr $C$DW$113, DW_AT_TI_symbol_name("_GPIO10")
    1647                      .dwattr $C$DW$113, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
    1648                      .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1649                      .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    1650              $C$DW$114       .dwtag  DW_TAG_member
    1651                      .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$19)
    1652                      .dwattr $C$DW$114, DW_AT_name("GPIO11")
    1653                      .dwattr $C$DW$114, DW_AT_TI_symbol_name("_GPIO11")
    1654                      .dwattr $C$DW$114, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
    1655                      .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1656                      .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    1657              $C$DW$115       .dwtag  DW_TAG_member
    1658                      .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$19)
    1659                      .dwattr $C$DW$115, DW_AT_name("GPIO12")
    1660                      .dwattr $C$DW$115, DW_AT_TI_symbol_name("_GPIO12")
    1661                      .dwattr $C$DW$115, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
    1662                      .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1663                      .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    1664              $C$DW$116       .dwtag  DW_TAG_member
    1665                      .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$19)
    1666                      .dwattr $C$DW$116, DW_AT_name("GPIO13")
    1667                      .dwattr $C$DW$116, DW_AT_TI_symbol_name("_GPIO13")
    1668                      .dwattr $C$DW$116, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
    1669                      .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1670                      .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    1671              $C$DW$117       .dwtag  DW_TAG_member
    1672                      .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$19)
    1673                      .dwattr $C$DW$117, DW_AT_name("GPIO14")
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:10 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0600410                           PAGE   33

    1674                      .dwattr $C$DW$117, DW_AT_TI_symbol_name("_GPIO14")
    1675                      .dwattr $C$DW$117, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
    1676                      .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1677                      .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    1678              $C$DW$118       .dwtag  DW_TAG_member
    1679                      .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$19)
    1680                      .dwattr $C$DW$118, DW_AT_name("GPIO15")
    1681                      .dwattr $C$DW$118, DW_AT_TI_symbol_name("_GPIO15")
    1682                      .dwattr $C$DW$118, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    1683                      .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1684                      .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    1685              $C$DW$119       .dwtag  DW_TAG_member
    1686                      .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$19)
    1687                      .dwattr $C$DW$119, DW_AT_name("GPIO16")
    1688                      .dwattr $C$DW$119, DW_AT_TI_symbol_name("_GPIO16")
    1689                      .dwattr $C$DW$119, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    1690                      .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1691                      .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    1692              $C$DW$120       .dwtag  DW_TAG_member
    1693                      .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$19)
    1694                      .dwattr $C$DW$120, DW_AT_name("GPIO17")
    1695                      .dwattr $C$DW$120, DW_AT_TI_symbol_name("_GPIO17")
    1696                      .dwattr $C$DW$120, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    1697                      .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1698                      .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    1699              $C$DW$121       .dwtag  DW_TAG_member
    1700                      .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$19)
    1701                      .dwattr $C$DW$121, DW_AT_name("GPIO18")
    1702                      .dwattr $C$DW$121, DW_AT_TI_symbol_name("_GPIO18")
    1703                      .dwattr $C$DW$121, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    1704                      .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1705                      .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    1706              $C$DW$122       .dwtag  DW_TAG_member
    1707                      .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$19)
    1708                      .dwattr $C$DW$122, DW_AT_name("GPIO19")
    1709                      .dwattr $C$DW$122, DW_AT_TI_symbol_name("_GPIO19")
    1710                      .dwattr $C$DW$122, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    1711                      .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1712                      .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    1713              $C$DW$123       .dwtag  DW_TAG_member
    1714                      .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$19)
    1715                      .dwattr $C$DW$123, DW_AT_name("GPIO20")
    1716                      .dwattr $C$DW$123, DW_AT_TI_symbol_name("_GPIO20")
    1717                      .dwattr $C$DW$123, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    1718                      .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1719                      .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    1720              $C$DW$124       .dwtag  DW_TAG_member
    1721                      .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$19)
    1722                      .dwattr $C$DW$124, DW_AT_name("GPIO21")
    1723                      .dwattr $C$DW$124, DW_AT_TI_symbol_name("_GPIO21")
    1724                      .dwattr $C$DW$124, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    1725                      .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1726                      .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    1727              $C$DW$125       .dwtag  DW_TAG_member
    1728                      .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:10 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0600410                           PAGE   34

    1729                      .dwattr $C$DW$125, DW_AT_name("GPIO22")
    1730                      .dwattr $C$DW$125, DW_AT_TI_symbol_name("_GPIO22")
    1731                      .dwattr $C$DW$125, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    1732                      .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1733                      .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    1734              $C$DW$126       .dwtag  DW_TAG_member
    1735                      .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$19)
    1736                      .dwattr $C$DW$126, DW_AT_name("GPIO23")
    1737                      .dwattr $C$DW$126, DW_AT_TI_symbol_name("_GPIO23")
    1738                      .dwattr $C$DW$126, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    1739                      .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1740                      .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    1741              $C$DW$127       .dwtag  DW_TAG_member
    1742                      .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$19)
    1743                      .dwattr $C$DW$127, DW_AT_name("GPIO24")
    1744                      .dwattr $C$DW$127, DW_AT_TI_symbol_name("_GPIO24")
    1745                      .dwattr $C$DW$127, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
    1746                      .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1747                      .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    1748              $C$DW$128       .dwtag  DW_TAG_member
    1749                      .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$19)
    1750                      .dwattr $C$DW$128, DW_AT_name("GPIO25")
    1751                      .dwattr $C$DW$128, DW_AT_TI_symbol_name("_GPIO25")
    1752                      .dwattr $C$DW$128, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    1753                      .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1754                      .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    1755              $C$DW$129       .dwtag  DW_TAG_member
    1756                      .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$19)
    1757                      .dwattr $C$DW$129, DW_AT_name("GPIO26")
    1758                      .dwattr $C$DW$129, DW_AT_TI_symbol_name("_GPIO26")
    1759                      .dwattr $C$DW$129, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
    1760                      .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1761                      .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    1762              $C$DW$130       .dwtag  DW_TAG_member
    1763                      .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$19)
    1764                      .dwattr $C$DW$130, DW_AT_name("GPIO27")
    1765                      .dwattr $C$DW$130, DW_AT_TI_symbol_name("_GPIO27")
    1766                      .dwattr $C$DW$130, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
    1767                      .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1768                      .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    1769              $C$DW$131       .dwtag  DW_TAG_member
    1770                      .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$19)
    1771                      .dwattr $C$DW$131, DW_AT_name("GPIO28")
    1772                      .dwattr $C$DW$131, DW_AT_TI_symbol_name("_GPIO28")
    1773                      .dwattr $C$DW$131, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
    1774                      .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1775                      .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    1776              $C$DW$132       .dwtag  DW_TAG_member
    1777                      .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$19)
    1778                      .dwattr $C$DW$132, DW_AT_name("GPIO29")
    1779                      .dwattr $C$DW$132, DW_AT_TI_symbol_name("_GPIO29")
    1780                      .dwattr $C$DW$132, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
    1781                      .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1782                      .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    1783              $C$DW$133       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:10 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0600410                           PAGE   35

    1784                      .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$19)
    1785                      .dwattr $C$DW$133, DW_AT_name("GPIO30")
    1786                      .dwattr $C$DW$133, DW_AT_TI_symbol_name("_GPIO30")
    1787                      .dwattr $C$DW$133, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
    1788                      .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1789                      .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    1790              $C$DW$134       .dwtag  DW_TAG_member
    1791                      .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$19)
    1792                      .dwattr $C$DW$134, DW_AT_name("GPIO31")
    1793                      .dwattr $C$DW$134, DW_AT_TI_symbol_name("_GPIO31")
    1794                      .dwattr $C$DW$134, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    1795                      .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1796                      .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    1797                      .dwendtag $C$DW$T$27
    1798              
    1799              
    1800              $C$DW$T$28      .dwtag  DW_TAG_union_type
    1801                      .dwattr $C$DW$T$28, DW_AT_name("GPADAT_REG")
    1802                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x02)
    1803              $C$DW$135       .dwtag  DW_TAG_member
    1804                      .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$21)
    1805                      .dwattr $C$DW$135, DW_AT_name("all")
    1806                      .dwattr $C$DW$135, DW_AT_TI_symbol_name("_all")
    1807                      .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1808                      .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    1809              $C$DW$136       .dwtag  DW_TAG_member
    1810                      .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$27)
    1811                      .dwattr $C$DW$136, DW_AT_name("bit")
    1812                      .dwattr $C$DW$136, DW_AT_TI_symbol_name("_bit")
    1813                      .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1814                      .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    1815                      .dwendtag $C$DW$T$28
    1816              
    1817              
    1818              $C$DW$T$29      .dwtag  DW_TAG_structure_type
    1819                      .dwattr $C$DW$T$29, DW_AT_name("GPB1_BITS")
    1820                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x02)
    1821              $C$DW$137       .dwtag  DW_TAG_member
    1822                      .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$19)
    1823                      .dwattr $C$DW$137, DW_AT_name("GPIO32")
    1824                      .dwattr $C$DW$137, DW_AT_TI_symbol_name("_GPIO32")
    1825                      .dwattr $C$DW$137, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x02)
    1826                      .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1827                      .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    1828              $C$DW$138       .dwtag  DW_TAG_member
    1829                      .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$19)
    1830                      .dwattr $C$DW$138, DW_AT_name("GPIO33")
    1831                      .dwattr $C$DW$138, DW_AT_TI_symbol_name("_GPIO33")
    1832                      .dwattr $C$DW$138, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x02)
    1833                      .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1834                      .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    1835              $C$DW$139       .dwtag  DW_TAG_member
    1836                      .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$19)
    1837                      .dwattr $C$DW$139, DW_AT_name("GPIO34")
    1838                      .dwattr $C$DW$139, DW_AT_TI_symbol_name("_GPIO34")
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:10 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0600410                           PAGE   36

    1839                      .dwattr $C$DW$139, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x02)
    1840                      .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1841                      .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    1842              $C$DW$140       .dwtag  DW_TAG_member
    1843                      .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$19)
    1844                      .dwattr $C$DW$140, DW_AT_name("GPIO35")
    1845                      .dwattr $C$DW$140, DW_AT_TI_symbol_name("_GPIO35")
    1846                      .dwattr $C$DW$140, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x02)
    1847                      .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1848                      .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    1849              $C$DW$141       .dwtag  DW_TAG_member
    1850                      .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$19)
    1851                      .dwattr $C$DW$141, DW_AT_name("GPIO36")
    1852                      .dwattr $C$DW$141, DW_AT_TI_symbol_name("_GPIO36")
    1853                      .dwattr $C$DW$141, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x02)
    1854                      .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1855                      .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    1856              $C$DW$142       .dwtag  DW_TAG_member
    1857                      .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$19)
    1858                      .dwattr $C$DW$142, DW_AT_name("GPIO37")
    1859                      .dwattr $C$DW$142, DW_AT_TI_symbol_name("_GPIO37")
    1860                      .dwattr $C$DW$142, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x02)
    1861                      .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1862                      .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    1863              $C$DW$143       .dwtag  DW_TAG_member
    1864                      .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$19)
    1865                      .dwattr $C$DW$143, DW_AT_name("GPIO38")
    1866                      .dwattr $C$DW$143, DW_AT_TI_symbol_name("_GPIO38")
    1867                      .dwattr $C$DW$143, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x02)
    1868                      .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1869                      .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    1870              $C$DW$144       .dwtag  DW_TAG_member
    1871                      .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$19)
    1872                      .dwattr $C$DW$144, DW_AT_name("GPIO39")
    1873                      .dwattr $C$DW$144, DW_AT_TI_symbol_name("_GPIO39")
    1874                      .dwattr $C$DW$144, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x02)
    1875                      .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1876                      .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    1877              $C$DW$145       .dwtag  DW_TAG_member
    1878                      .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$19)
    1879                      .dwattr $C$DW$145, DW_AT_name("GPIO40")
    1880                      .dwattr $C$DW$145, DW_AT_TI_symbol_name("_GPIO40")
    1881                      .dwattr $C$DW$145, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x02)
    1882                      .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1883                      .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    1884              $C$DW$146       .dwtag  DW_TAG_member
    1885                      .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$19)
    1886                      .dwattr $C$DW$146, DW_AT_name("GPIO41")
    1887                      .dwattr $C$DW$146, DW_AT_TI_symbol_name("_GPIO41")
    1888                      .dwattr $C$DW$146, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x02)
    1889                      .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1890                      .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
    1891              $C$DW$147       .dwtag  DW_TAG_member
    1892                      .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$19)
    1893                      .dwattr $C$DW$147, DW_AT_name("GPIO42")
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:10 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0600410                           PAGE   37

    1894                      .dwattr $C$DW$147, DW_AT_TI_symbol_name("_GPIO42")
    1895                      .dwattr $C$DW$147, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x02)
    1896                      .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1897                      .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
    1898              $C$DW$148       .dwtag  DW_TAG_member
    1899                      .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$19)
    1900                      .dwattr $C$DW$148, DW_AT_name("GPIO43")
    1901                      .dwattr $C$DW$148, DW_AT_TI_symbol_name("_GPIO43")
    1902                      .dwattr $C$DW$148, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x02)
    1903                      .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1904                      .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    1905              $C$DW$149       .dwtag  DW_TAG_member
    1906                      .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$19)
    1907                      .dwattr $C$DW$149, DW_AT_name("GPIO44")
    1908                      .dwattr $C$DW$149, DW_AT_TI_symbol_name("_GPIO44")
    1909                      .dwattr $C$DW$149, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x02)
    1910                      .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1911                      .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    1912              $C$DW$150       .dwtag  DW_TAG_member
    1913                      .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$19)
    1914                      .dwattr $C$DW$150, DW_AT_name("GPIO45")
    1915                      .dwattr $C$DW$150, DW_AT_TI_symbol_name("_GPIO45")
    1916                      .dwattr $C$DW$150, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x02)
    1917                      .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1918                      .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
    1919              $C$DW$151       .dwtag  DW_TAG_member
    1920                      .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$19)
    1921                      .dwattr $C$DW$151, DW_AT_name("GPIO46")
    1922                      .dwattr $C$DW$151, DW_AT_TI_symbol_name("_GPIO46")
    1923                      .dwattr $C$DW$151, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x02)
    1924                      .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1925                      .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    1926              $C$DW$152       .dwtag  DW_TAG_member
    1927                      .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$19)
    1928                      .dwattr $C$DW$152, DW_AT_name("GPIO47")
    1929                      .dwattr $C$DW$152, DW_AT_TI_symbol_name("_GPIO47")
    1930                      .dwattr $C$DW$152, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x02)
    1931                      .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1932                      .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    1933                      .dwendtag $C$DW$T$29
    1934              
    1935              
    1936              $C$DW$T$30      .dwtag  DW_TAG_union_type
    1937                      .dwattr $C$DW$T$30, DW_AT_name("GPB1_REG")
    1938                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x02)
    1939              $C$DW$153       .dwtag  DW_TAG_member
    1940                      .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$21)
    1941                      .dwattr $C$DW$153, DW_AT_name("all")
    1942                      .dwattr $C$DW$153, DW_AT_TI_symbol_name("_all")
    1943                      .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1944                      .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    1945              $C$DW$154       .dwtag  DW_TAG_member
    1946                      .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$29)
    1947                      .dwattr $C$DW$154, DW_AT_name("bit")
    1948                      .dwattr $C$DW$154, DW_AT_TI_symbol_name("_bit")
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:10 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0600410                           PAGE   38

    1949                      .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1950                      .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
    1951                      .dwendtag $C$DW$T$30
    1952              
    1953              
    1954              $C$DW$T$31      .dwtag  DW_TAG_structure_type
    1955                      .dwattr $C$DW$T$31, DW_AT_name("GPB2_BITS")
    1956                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x02)
    1957              $C$DW$155       .dwtag  DW_TAG_member
    1958                      .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$19)
    1959                      .dwattr $C$DW$155, DW_AT_name("GPIO48")
    1960                      .dwattr $C$DW$155, DW_AT_TI_symbol_name("_GPIO48")
    1961                      .dwattr $C$DW$155, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x02)
    1962                      .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1963                      .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
    1964              $C$DW$156       .dwtag  DW_TAG_member
    1965                      .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$19)
    1966                      .dwattr $C$DW$156, DW_AT_name("GPIO49")
    1967                      .dwattr $C$DW$156, DW_AT_TI_symbol_name("_GPIO49")
    1968                      .dwattr $C$DW$156, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x02)
    1969                      .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1970                      .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    1971              $C$DW$157       .dwtag  DW_TAG_member
    1972                      .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$19)
    1973                      .dwattr $C$DW$157, DW_AT_name("GPIO50")
    1974                      .dwattr $C$DW$157, DW_AT_TI_symbol_name("_GPIO50")
    1975                      .dwattr $C$DW$157, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x02)
    1976                      .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1977                      .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    1978              $C$DW$158       .dwtag  DW_TAG_member
    1979                      .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$19)
    1980                      .dwattr $C$DW$158, DW_AT_name("GPIO51")
    1981                      .dwattr $C$DW$158, DW_AT_TI_symbol_name("_GPIO51")
    1982                      .dwattr $C$DW$158, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x02)
    1983                      .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1984                      .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    1985              $C$DW$159       .dwtag  DW_TAG_member
    1986                      .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$19)
    1987                      .dwattr $C$DW$159, DW_AT_name("GPIO52")
    1988                      .dwattr $C$DW$159, DW_AT_TI_symbol_name("_GPIO52")
    1989                      .dwattr $C$DW$159, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x02)
    1990                      .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1991                      .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    1992              $C$DW$160       .dwtag  DW_TAG_member
    1993                      .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$19)
    1994                      .dwattr $C$DW$160, DW_AT_name("GPIO53")
    1995                      .dwattr $C$DW$160, DW_AT_TI_symbol_name("_GPIO53")
    1996                      .dwattr $C$DW$160, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x02)
    1997                      .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1998                      .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    1999              $C$DW$161       .dwtag  DW_TAG_member
    2000                      .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$19)
    2001                      .dwattr $C$DW$161, DW_AT_name("GPIO54")
    2002                      .dwattr $C$DW$161, DW_AT_TI_symbol_name("_GPIO54")
    2003                      .dwattr $C$DW$161, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x02)
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:10 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0600410                           PAGE   39

    2004                      .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2005                      .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    2006              $C$DW$162       .dwtag  DW_TAG_member
    2007                      .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$19)
    2008                      .dwattr $C$DW$162, DW_AT_name("GPIO55")
    2009                      .dwattr $C$DW$162, DW_AT_TI_symbol_name("_GPIO55")
    2010                      .dwattr $C$DW$162, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x02)
    2011                      .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2012                      .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    2013              $C$DW$163       .dwtag  DW_TAG_member
    2014                      .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$19)
    2015                      .dwattr $C$DW$163, DW_AT_name("GPIO56")
    2016                      .dwattr $C$DW$163, DW_AT_TI_symbol_name("_GPIO56")
    2017                      .dwattr $C$DW$163, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x02)
    2018                      .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2019                      .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    2020              $C$DW$164       .dwtag  DW_TAG_member
    2021                      .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$19)
    2022                      .dwattr $C$DW$164, DW_AT_name("GPIO57")
    2023                      .dwattr $C$DW$164, DW_AT_TI_symbol_name("_GPIO57")
    2024                      .dwattr $C$DW$164, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x02)
    2025                      .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2026                      .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    2027              $C$DW$165       .dwtag  DW_TAG_member
    2028                      .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$19)
    2029                      .dwattr $C$DW$165, DW_AT_name("GPIO58")
    2030                      .dwattr $C$DW$165, DW_AT_TI_symbol_name("_GPIO58")
    2031                      .dwattr $C$DW$165, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x02)
    2032                      .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2033                      .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    2034              $C$DW$166       .dwtag  DW_TAG_member
    2035                      .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$19)
    2036                      .dwattr $C$DW$166, DW_AT_name("GPIO59")
    2037                      .dwattr $C$DW$166, DW_AT_TI_symbol_name("_GPIO59")
    2038                      .dwattr $C$DW$166, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x02)
    2039                      .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2040                      .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    2041              $C$DW$167       .dwtag  DW_TAG_member
    2042                      .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$19)
    2043                      .dwattr $C$DW$167, DW_AT_name("GPIO60")
    2044                      .dwattr $C$DW$167, DW_AT_TI_symbol_name("_GPIO60")
    2045                      .dwattr $C$DW$167, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x02)
    2046                      .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2047                      .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    2048              $C$DW$168       .dwtag  DW_TAG_member
    2049                      .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$19)
    2050                      .dwattr $C$DW$168, DW_AT_name("GPIO61")
    2051                      .dwattr $C$DW$168, DW_AT_TI_symbol_name("_GPIO61")
    2052                      .dwattr $C$DW$168, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x02)
    2053                      .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2054                      .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    2055              $C$DW$169       .dwtag  DW_TAG_member
    2056                      .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$19)
    2057                      .dwattr $C$DW$169, DW_AT_name("GPIO62")
    2058                      .dwattr $C$DW$169, DW_AT_TI_symbol_name("_GPIO62")
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:10 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0600410                           PAGE   40

    2059                      .dwattr $C$DW$169, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x02)
    2060                      .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2061                      .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    2062              $C$DW$170       .dwtag  DW_TAG_member
    2063                      .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$19)
    2064                      .dwattr $C$DW$170, DW_AT_name("GPIO63")
    2065                      .dwattr $C$DW$170, DW_AT_TI_symbol_name("_GPIO63")
    2066                      .dwattr $C$DW$170, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x02)
    2067                      .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2068                      .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    2069                      .dwendtag $C$DW$T$31
    2070              
    2071              
    2072              $C$DW$T$32      .dwtag  DW_TAG_union_type
    2073                      .dwattr $C$DW$T$32, DW_AT_name("GPB2_REG")
    2074                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x02)
    2075              $C$DW$171       .dwtag  DW_TAG_member
    2076                      .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$21)
    2077                      .dwattr $C$DW$171, DW_AT_name("all")
    2078                      .dwattr $C$DW$171, DW_AT_TI_symbol_name("_all")
    2079                      .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2080                      .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    2081              $C$DW$172       .dwtag  DW_TAG_member
    2082                      .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$31)
    2083                      .dwattr $C$DW$172, DW_AT_name("bit")
    2084                      .dwattr $C$DW$172, DW_AT_TI_symbol_name("_bit")
    2085                      .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2086                      .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    2087                      .dwendtag $C$DW$T$32
    2088              
    2089              
    2090              $C$DW$T$33      .dwtag  DW_TAG_structure_type
    2091                      .dwattr $C$DW$T$33, DW_AT_name("GPBCTRL_BITS")
    2092                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x02)
    2093              $C$DW$173       .dwtag  DW_TAG_member
    2094                      .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$19)
    2095                      .dwattr $C$DW$173, DW_AT_name("QUALPRD0")
    2096                      .dwattr $C$DW$173, DW_AT_TI_symbol_name("_QUALPRD0")
    2097                      .dwattr $C$DW$173, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x08)
    2098                      .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2099                      .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
    2100              $C$DW$174       .dwtag  DW_TAG_member
    2101                      .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$19)
    2102                      .dwattr $C$DW$174, DW_AT_name("QUALPRD1")
    2103                      .dwattr $C$DW$174, DW_AT_TI_symbol_name("_QUALPRD1")
    2104                      .dwattr $C$DW$174, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x08)
    2105                      .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2106                      .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
    2107              $C$DW$175       .dwtag  DW_TAG_member
    2108                      .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$19)
    2109                      .dwattr $C$DW$175, DW_AT_name("QUALPRD2")
    2110                      .dwattr $C$DW$175, DW_AT_TI_symbol_name("_QUALPRD2")
    2111                      .dwattr $C$DW$175, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x08)
    2112                      .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2113                      .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:10 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0600410                           PAGE   41

    2114              $C$DW$176       .dwtag  DW_TAG_member
    2115                      .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$19)
    2116                      .dwattr $C$DW$176, DW_AT_name("QUALPRD3")
    2117                      .dwattr $C$DW$176, DW_AT_TI_symbol_name("_QUALPRD3")
    2118                      .dwattr $C$DW$176, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x08)
    2119                      .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2120                      .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
    2121                      .dwendtag $C$DW$T$33
    2122              
    2123              
    2124              $C$DW$T$34      .dwtag  DW_TAG_union_type
    2125                      .dwattr $C$DW$T$34, DW_AT_name("GPBCTRL_REG")
    2126                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x02)
    2127              $C$DW$177       .dwtag  DW_TAG_member
    2128                      .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$21)
    2129                      .dwattr $C$DW$177, DW_AT_name("all")
    2130                      .dwattr $C$DW$177, DW_AT_TI_symbol_name("_all")
    2131                      .dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2132                      .dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
    2133              $C$DW$178       .dwtag  DW_TAG_member
    2134                      .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$33)
    2135                      .dwattr $C$DW$178, DW_AT_name("bit")
    2136                      .dwattr $C$DW$178, DW_AT_TI_symbol_name("_bit")
    2137                      .dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2138                      .dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
    2139                      .dwendtag $C$DW$T$34
    2140              
    2141              
    2142              $C$DW$T$35      .dwtag  DW_TAG_structure_type
    2143                      .dwattr $C$DW$T$35, DW_AT_name("GPBDAT_BITS")
    2144                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x02)
    2145              $C$DW$179       .dwtag  DW_TAG_member
    2146                      .dwattr $C$DW$179, DW_AT_type(*$C$DW$T$19)
    2147                      .dwattr $C$DW$179, DW_AT_name("GPIO32")
    2148                      .dwattr $C$DW$179, DW_AT_TI_symbol_name("_GPIO32")
    2149                      .dwattr $C$DW$179, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    2150                      .dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2151                      .dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
    2152              $C$DW$180       .dwtag  DW_TAG_member
    2153                      .dwattr $C$DW$180, DW_AT_type(*$C$DW$T$19)
    2154                      .dwattr $C$DW$180, DW_AT_name("GPIO33")
    2155                      .dwattr $C$DW$180, DW_AT_TI_symbol_name("_GPIO33")
    2156                      .dwattr $C$DW$180, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    2157                      .dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2158                      .dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
    2159              $C$DW$181       .dwtag  DW_TAG_member
    2160                      .dwattr $C$DW$181, DW_AT_type(*$C$DW$T$19)
    2161                      .dwattr $C$DW$181, DW_AT_name("GPIO34")
    2162                      .dwattr $C$DW$181, DW_AT_TI_symbol_name("_GPIO34")
    2163                      .dwattr $C$DW$181, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    2164                      .dwattr $C$DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2165                      .dwattr $C$DW$181, DW_AT_accessibility(DW_ACCESS_public)
    2166              $C$DW$182       .dwtag  DW_TAG_member
    2167                      .dwattr $C$DW$182, DW_AT_type(*$C$DW$T$19)
    2168                      .dwattr $C$DW$182, DW_AT_name("GPIO35")
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:10 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0600410                           PAGE   42

    2169                      .dwattr $C$DW$182, DW_AT_TI_symbol_name("_GPIO35")
    2170                      .dwattr $C$DW$182, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    2171                      .dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2172                      .dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)
    2173              $C$DW$183       .dwtag  DW_TAG_member
    2174                      .dwattr $C$DW$183, DW_AT_type(*$C$DW$T$19)
    2175                      .dwattr $C$DW$183, DW_AT_name("GPIO36")
    2176                      .dwattr $C$DW$183, DW_AT_TI_symbol_name("_GPIO36")
    2177                      .dwattr $C$DW$183, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    2178                      .dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2179                      .dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
    2180              $C$DW$184       .dwtag  DW_TAG_member
    2181                      .dwattr $C$DW$184, DW_AT_type(*$C$DW$T$19)
    2182                      .dwattr $C$DW$184, DW_AT_name("GPIO37")
    2183                      .dwattr $C$DW$184, DW_AT_TI_symbol_name("_GPIO37")
    2184                      .dwattr $C$DW$184, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    2185                      .dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2186                      .dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
    2187              $C$DW$185       .dwtag  DW_TAG_member
    2188                      .dwattr $C$DW$185, DW_AT_type(*$C$DW$T$19)
    2189                      .dwattr $C$DW$185, DW_AT_name("GPIO38")
    2190                      .dwattr $C$DW$185, DW_AT_TI_symbol_name("_GPIO38")
    2191                      .dwattr $C$DW$185, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    2192                      .dwattr $C$DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2193                      .dwattr $C$DW$185, DW_AT_accessibility(DW_ACCESS_public)
    2194              $C$DW$186       .dwtag  DW_TAG_member
    2195                      .dwattr $C$DW$186, DW_AT_type(*$C$DW$T$19)
    2196                      .dwattr $C$DW$186, DW_AT_name("GPIO39")
    2197                      .dwattr $C$DW$186, DW_AT_TI_symbol_name("_GPIO39")
    2198                      .dwattr $C$DW$186, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    2199                      .dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2200                      .dwattr $C$DW$186, DW_AT_accessibility(DW_ACCESS_public)
    2201              $C$DW$187       .dwtag  DW_TAG_member
    2202                      .dwattr $C$DW$187, DW_AT_type(*$C$DW$T$19)
    2203                      .dwattr $C$DW$187, DW_AT_name("GPIO40")
    2204                      .dwattr $C$DW$187, DW_AT_TI_symbol_name("_GPIO40")
    2205                      .dwattr $C$DW$187, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
    2206                      .dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2207                      .dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)
    2208              $C$DW$188       .dwtag  DW_TAG_member
    2209                      .dwattr $C$DW$188, DW_AT_type(*$C$DW$T$19)
    2210                      .dwattr $C$DW$188, DW_AT_name("GPIO41")
    2211                      .dwattr $C$DW$188, DW_AT_TI_symbol_name("_GPIO41")
    2212                      .dwattr $C$DW$188, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    2213                      .dwattr $C$DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2214                      .dwattr $C$DW$188, DW_AT_accessibility(DW_ACCESS_public)
    2215              $C$DW$189       .dwtag  DW_TAG_member
    2216                      .dwattr $C$DW$189, DW_AT_type(*$C$DW$T$19)
    2217                      .dwattr $C$DW$189, DW_AT_name("GPIO42")
    2218                      .dwattr $C$DW$189, DW_AT_TI_symbol_name("_GPIO42")
    2219                      .dwattr $C$DW$189, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
    2220                      .dwattr $C$DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2221                      .dwattr $C$DW$189, DW_AT_accessibility(DW_ACCESS_public)
    2222              $C$DW$190       .dwtag  DW_TAG_member
    2223                      .dwattr $C$DW$190, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:10 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0600410                           PAGE   43

    2224                      .dwattr $C$DW$190, DW_AT_name("GPIO43")
    2225                      .dwattr $C$DW$190, DW_AT_TI_symbol_name("_GPIO43")
    2226                      .dwattr $C$DW$190, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
    2227                      .dwattr $C$DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2228                      .dwattr $C$DW$190, DW_AT_accessibility(DW_ACCESS_public)
    2229              $C$DW$191       .dwtag  DW_TAG_member
    2230                      .dwattr $C$DW$191, DW_AT_type(*$C$DW$T$19)
    2231                      .dwattr $C$DW$191, DW_AT_name("GPIO44")
    2232                      .dwattr $C$DW$191, DW_AT_TI_symbol_name("_GPIO44")
    2233                      .dwattr $C$DW$191, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
    2234                      .dwattr $C$DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2235                      .dwattr $C$DW$191, DW_AT_accessibility(DW_ACCESS_public)
    2236              $C$DW$192       .dwtag  DW_TAG_member
    2237                      .dwattr $C$DW$192, DW_AT_type(*$C$DW$T$19)
    2238                      .dwattr $C$DW$192, DW_AT_name("GPIO45")
    2239                      .dwattr $C$DW$192, DW_AT_TI_symbol_name("_GPIO45")
    2240                      .dwattr $C$DW$192, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
    2241                      .dwattr $C$DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2242                      .dwattr $C$DW$192, DW_AT_accessibility(DW_ACCESS_public)
    2243              $C$DW$193       .dwtag  DW_TAG_member
    2244                      .dwattr $C$DW$193, DW_AT_type(*$C$DW$T$19)
    2245                      .dwattr $C$DW$193, DW_AT_name("GPIO46")
    2246                      .dwattr $C$DW$193, DW_AT_TI_symbol_name("_GPIO46")
    2247                      .dwattr $C$DW$193, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
    2248                      .dwattr $C$DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2249                      .dwattr $C$DW$193, DW_AT_accessibility(DW_ACCESS_public)
    2250              $C$DW$194       .dwtag  DW_TAG_member
    2251                      .dwattr $C$DW$194, DW_AT_type(*$C$DW$T$19)
    2252                      .dwattr $C$DW$194, DW_AT_name("GPIO47")
    2253                      .dwattr $C$DW$194, DW_AT_TI_symbol_name("_GPIO47")
    2254                      .dwattr $C$DW$194, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    2255                      .dwattr $C$DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2256                      .dwattr $C$DW$194, DW_AT_accessibility(DW_ACCESS_public)
    2257              $C$DW$195       .dwtag  DW_TAG_member
    2258                      .dwattr $C$DW$195, DW_AT_type(*$C$DW$T$19)
    2259                      .dwattr $C$DW$195, DW_AT_name("GPIO48")
    2260                      .dwattr $C$DW$195, DW_AT_TI_symbol_name("_GPIO48")
    2261                      .dwattr $C$DW$195, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    2262                      .dwattr $C$DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2263                      .dwattr $C$DW$195, DW_AT_accessibility(DW_ACCESS_public)
    2264              $C$DW$196       .dwtag  DW_TAG_member
    2265                      .dwattr $C$DW$196, DW_AT_type(*$C$DW$T$19)
    2266                      .dwattr $C$DW$196, DW_AT_name("GPIO49")
    2267                      .dwattr $C$DW$196, DW_AT_TI_symbol_name("_GPIO49")
    2268                      .dwattr $C$DW$196, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    2269                      .dwattr $C$DW$196, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2270                      .dwattr $C$DW$196, DW_AT_accessibility(DW_ACCESS_public)
    2271              $C$DW$197       .dwtag  DW_TAG_member
    2272                      .dwattr $C$DW$197, DW_AT_type(*$C$DW$T$19)
    2273                      .dwattr $C$DW$197, DW_AT_name("GPIO50")
    2274                      .dwattr $C$DW$197, DW_AT_TI_symbol_name("_GPIO50")
    2275                      .dwattr $C$DW$197, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    2276                      .dwattr $C$DW$197, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2277                      .dwattr $C$DW$197, DW_AT_accessibility(DW_ACCESS_public)
    2278              $C$DW$198       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:10 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0600410                           PAGE   44

    2279                      .dwattr $C$DW$198, DW_AT_type(*$C$DW$T$19)
    2280                      .dwattr $C$DW$198, DW_AT_name("GPIO51")
    2281                      .dwattr $C$DW$198, DW_AT_TI_symbol_name("_GPIO51")
    2282                      .dwattr $C$DW$198, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    2283                      .dwattr $C$DW$198, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2284                      .dwattr $C$DW$198, DW_AT_accessibility(DW_ACCESS_public)
    2285              $C$DW$199       .dwtag  DW_TAG_member
    2286                      .dwattr $C$DW$199, DW_AT_type(*$C$DW$T$19)
    2287                      .dwattr $C$DW$199, DW_AT_name("GPIO52")
    2288                      .dwattr $C$DW$199, DW_AT_TI_symbol_name("_GPIO52")
    2289                      .dwattr $C$DW$199, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    2290                      .dwattr $C$DW$199, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2291                      .dwattr $C$DW$199, DW_AT_accessibility(DW_ACCESS_public)
    2292              $C$DW$200       .dwtag  DW_TAG_member
    2293                      .dwattr $C$DW$200, DW_AT_type(*$C$DW$T$19)
    2294                      .dwattr $C$DW$200, DW_AT_name("GPIO53")
    2295                      .dwattr $C$DW$200, DW_AT_TI_symbol_name("_GPIO53")
    2296                      .dwattr $C$DW$200, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    2297                      .dwattr $C$DW$200, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2298                      .dwattr $C$DW$200, DW_AT_accessibility(DW_ACCESS_public)
    2299              $C$DW$201       .dwtag  DW_TAG_member
    2300                      .dwattr $C$DW$201, DW_AT_type(*$C$DW$T$19)
    2301                      .dwattr $C$DW$201, DW_AT_name("GPIO54")
    2302                      .dwattr $C$DW$201, DW_AT_TI_symbol_name("_GPIO54")
    2303                      .dwattr $C$DW$201, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    2304                      .dwattr $C$DW$201, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2305                      .dwattr $C$DW$201, DW_AT_accessibility(DW_ACCESS_public)
    2306              $C$DW$202       .dwtag  DW_TAG_member
    2307                      .dwattr $C$DW$202, DW_AT_type(*$C$DW$T$19)
    2308                      .dwattr $C$DW$202, DW_AT_name("GPIO55")
    2309                      .dwattr $C$DW$202, DW_AT_TI_symbol_name("_GPIO55")
    2310                      .dwattr $C$DW$202, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    2311                      .dwattr $C$DW$202, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2312                      .dwattr $C$DW$202, DW_AT_accessibility(DW_ACCESS_public)
    2313              $C$DW$203       .dwtag  DW_TAG_member
    2314                      .dwattr $C$DW$203, DW_AT_type(*$C$DW$T$19)
    2315                      .dwattr $C$DW$203, DW_AT_name("GPIO56")
    2316                      .dwattr $C$DW$203, DW_AT_TI_symbol_name("_GPIO56")
    2317                      .dwattr $C$DW$203, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
    2318                      .dwattr $C$DW$203, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2319                      .dwattr $C$DW$203, DW_AT_accessibility(DW_ACCESS_public)
    2320              $C$DW$204       .dwtag  DW_TAG_member
    2321                      .dwattr $C$DW$204, DW_AT_type(*$C$DW$T$19)
    2322                      .dwattr $C$DW$204, DW_AT_name("GPIO57")
    2323                      .dwattr $C$DW$204, DW_AT_TI_symbol_name("_GPIO57")
    2324                      .dwattr $C$DW$204, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    2325                      .dwattr $C$DW$204, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2326                      .dwattr $C$DW$204, DW_AT_accessibility(DW_ACCESS_public)
    2327              $C$DW$205       .dwtag  DW_TAG_member
    2328                      .dwattr $C$DW$205, DW_AT_type(*$C$DW$T$19)
    2329                      .dwattr $C$DW$205, DW_AT_name("GPIO58")
    2330                      .dwattr $C$DW$205, DW_AT_TI_symbol_name("_GPIO58")
    2331                      .dwattr $C$DW$205, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
    2332                      .dwattr $C$DW$205, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2333                      .dwattr $C$DW$205, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:10 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0600410                           PAGE   45

    2334              $C$DW$206       .dwtag  DW_TAG_member
    2335                      .dwattr $C$DW$206, DW_AT_type(*$C$DW$T$19)
    2336                      .dwattr $C$DW$206, DW_AT_name("GPIO59")
    2337                      .dwattr $C$DW$206, DW_AT_TI_symbol_name("_GPIO59")
    2338                      .dwattr $C$DW$206, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
    2339                      .dwattr $C$DW$206, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2340                      .dwattr $C$DW$206, DW_AT_accessibility(DW_ACCESS_public)
    2341              $C$DW$207       .dwtag  DW_TAG_member
    2342                      .dwattr $C$DW$207, DW_AT_type(*$C$DW$T$19)
    2343                      .dwattr $C$DW$207, DW_AT_name("GPIO60")
    2344                      .dwattr $C$DW$207, DW_AT_TI_symbol_name("_GPIO60")
    2345                      .dwattr $C$DW$207, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
    2346                      .dwattr $C$DW$207, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2347                      .dwattr $C$DW$207, DW_AT_accessibility(DW_ACCESS_public)
    2348              $C$DW$208       .dwtag  DW_TAG_member
    2349                      .dwattr $C$DW$208, DW_AT_type(*$C$DW$T$19)
    2350                      .dwattr $C$DW$208, DW_AT_name("GPIO61")
    2351                      .dwattr $C$DW$208, DW_AT_TI_symbol_name("_GPIO61")
    2352                      .dwattr $C$DW$208, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
    2353                      .dwattr $C$DW$208, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2354                      .dwattr $C$DW$208, DW_AT_accessibility(DW_ACCESS_public)
    2355              $C$DW$209       .dwtag  DW_TAG_member
    2356                      .dwattr $C$DW$209, DW_AT_type(*$C$DW$T$19)
    2357                      .dwattr $C$DW$209, DW_AT_name("GPIO62")
    2358                      .dwattr $C$DW$209, DW_AT_TI_symbol_name("_GPIO62")
    2359                      .dwattr $C$DW$209, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
    2360                      .dwattr $C$DW$209, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2361                      .dwattr $C$DW$209, DW_AT_accessibility(DW_ACCESS_public)
    2362              $C$DW$210       .dwtag  DW_TAG_member
    2363                      .dwattr $C$DW$210, DW_AT_type(*$C$DW$T$19)
    2364                      .dwattr $C$DW$210, DW_AT_name("GPIO63")
    2365                      .dwattr $C$DW$210, DW_AT_TI_symbol_name("_GPIO63")
    2366                      .dwattr $C$DW$210, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    2367                      .dwattr $C$DW$210, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2368                      .dwattr $C$DW$210, DW_AT_accessibility(DW_ACCESS_public)
    2369                      .dwendtag $C$DW$T$35
    2370              
    2371              
    2372              $C$DW$T$36      .dwtag  DW_TAG_union_type
    2373                      .dwattr $C$DW$T$36, DW_AT_name("GPBDAT_REG")
    2374                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x02)
    2375              $C$DW$211       .dwtag  DW_TAG_member
    2376                      .dwattr $C$DW$211, DW_AT_type(*$C$DW$T$21)
    2377                      .dwattr $C$DW$211, DW_AT_name("all")
    2378                      .dwattr $C$DW$211, DW_AT_TI_symbol_name("_all")
    2379                      .dwattr $C$DW$211, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2380                      .dwattr $C$DW$211, DW_AT_accessibility(DW_ACCESS_public)
    2381              $C$DW$212       .dwtag  DW_TAG_member
    2382                      .dwattr $C$DW$212, DW_AT_type(*$C$DW$T$35)
    2383                      .dwattr $C$DW$212, DW_AT_name("bit")
    2384                      .dwattr $C$DW$212, DW_AT_TI_symbol_name("_bit")
    2385                      .dwattr $C$DW$212, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2386                      .dwattr $C$DW$212, DW_AT_accessibility(DW_ACCESS_public)
    2387                      .dwendtag $C$DW$T$36
    2388              
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:10 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0600410                           PAGE   46

    2389              
