TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:22 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0614010                           PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v6.2.7 *
       3              ;* Date/Time created: Thu Jul 02 08:31:22 2015                 *
       4              ;***************************************************************
       5                      .compiler_opts --diag_wrap=off --float_support=fpu32 --hll_source=on --mem_model:code=flat --mem_mode
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("../DiscretPin/DiscretInp.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v6.2.7 Copyright (c) 1996-2014 Texas I
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("D:\ActiveProject\EKT5\PKMT_NONBIOS\InvertorCntrl\ISPprg")
      13              $C$DW$1 .dwtag  DW_TAG_variable, DW_AT_name("GpioDataRegs")
      14                      .dwattr $C$DW$1, DW_AT_TI_symbol_name("_GpioDataRegs")
      15                      .dwattr $C$DW$1, DW_AT_type(*$C$DW$T$53)

     171                      .dwattr $C$DW$5, DW_AT_TI_begin_line(0x3d)
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:22 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0614010                           PAGE    5

     172                      .dwattr $C$DW$5, DW_AT_TI_begin_column(0x06)
     173                      .dwattr $C$DW$5, DW_AT_TI_max_frame_size(-4)
     174                      .dwpsn  file "../DiscretPin/DiscretInp.c",line 61,column 32,is_stmt,address _testDiscretInp
     175              
     176                      .dwfde $C$DW$CIE, _testDiscretInp
     177              $C$DW$6 .dwtag  DW_TAG_formal_parameter, DW_AT_name("pin")
     178                      .dwattr $C$DW$6, DW_AT_TI_symbol_name("_pin")
     179                      .dwattr $C$DW$6, DW_AT_type(*$C$DW$T$56)
     180                      .dwattr $C$DW$6, DW_AT_location[DW_OP_reg0]
     181              
     182              ;***************************************************************
     183              ;* FNAME: _testDiscretInp               FR SIZE:   2           *
     184              ;*                                                             *
     185              ;* FUNCTION ENVIRONMENT                                        *
     186              ;*                                                             *
     187              ;* FUNCTION PROPERTIES                                         *
     188              ;*                            0 Parameter,  2 Auto,  0 SOE     *
     189              ;***************************************************************
     190              
     191 0000006e       _testDiscretInp:
     192                      .dwcfi  cfa_offset, -2
     193                      .dwcfi  save_reg_to_mem, 26, 0
     194                      .dwcfi  save_reg_to_reg, 78, 26
     195 0000006e FE02          ADDB      SP,#2                 ; [CPU_U] 
     196                      .dwcfi  cfa_offset, -4
     197              $C$DW$7 .dwtag  DW_TAG_variable, DW_AT_name("pin")
     198                      .dwattr $C$DW$7, DW_AT_TI_symbol_name("_pin")
     199                      .dwattr $C$DW$7, DW_AT_type(*$C$DW$T$56)
     200                      .dwattr $C$DW$7, DW_AT_location[DW_OP_breg20 -2]
     201 0000006f 1E42          MOVL      *-SP[2],ACC           ; [CPU_] |61| 
     202                      .dwpsn  file "../DiscretPin/DiscretInp.c",line 62,column 2,is_stmt
     203 00000070 761F!         MOVW      DP,#_GpioDataRegs+8   ; [CPU_U] 
         00000071 0000 
     204 00000072 BE00          MOVB      XAR6,#0               ; [CPU_] |62| 
     205 00000073 0608!         MOVL      ACC,@_GpioDataRegs+8  ; [CPU_] |62| 
     206 00000074 CE42          AND       AL,*-SP[2]            ; [CPU_] |62| 
     207 00000075 CF41          AND       AH,*-SP[1]            ; [CPU_] |62| 
     208 00000076 0FA6          CMPL      ACC,XAR6              ; [CPU_] |62| 
     209 00000077 EC03          BF        $C$L1,EQ              ; [CPU_] |62| 
     210                      ; branchcc occurs ; [] |62| 
     211                      .dwpsn  file "../DiscretPin/DiscretInp.c",line 63,column 3,is_stmt
     212 00000078 9A00          MOVB      AL,#0                 ; [CPU_] |63| 
     213 00000079 6F02          B         $C$L2,UNC             ; [CPU_] |63| 
     214                      ; branch occurs ; [] |63| 
     215 0000007a       $C$L1:    
     216                      .dwpsn  file "../DiscretPin/DiscretInp.c",line 65,column 3,is_stmt
     217 0000007a 9A01          MOVB      AL,#1                 ; [CPU_] |65| 
     218 0000007b       $C$L2:    
     219                      .dwpsn  file "../DiscretPin/DiscretInp.c",line 66,column 1,is_stmt
     220 0000007b FE82          SUBB      SP,#2                 ; [CPU_U] 
     221                      .dwcfi  cfa_offset, -2
     222              $C$DW$8 .dwtag  DW_TAG_TI_branch
     223                      .dwattr $C$DW$8, DW_AT_low_pc(0x00)
     224                      .dwattr $C$DW$8, DW_AT_TI_return
     225 0000007c 0006          LRETR     ; [CPU_] 
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:22 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0614010                           PAGE    6

     226                      ; return occurs ; [] 
     227                      .dwattr $C$DW$5, DW_AT_TI_end_file("../DiscretPin/DiscretInp.c")
     228                      .dwattr $C$DW$5, DW_AT_TI_end_line(0x42)
     229                      .dwattr $C$DW$5, DW_AT_TI_end_column(0x01)
     230                      .dwendentry
     231                      .dwendtag $C$DW$5
     232              
     233              ;**************************************************************
     234              ;* UNDEFINED EXTERNAL REFERENCES                              *
     235              ;**************************************************************
     236                      .global _GpioDataRegs
     237                      .global _GpioCtrlRegs
     238              
     239              ;***************************************************************
     240              ;* TYPE INFORMATION                                            *
     241              ;***************************************************************
     242              
     243              $C$DW$T$20      .dwtag  DW_TAG_structure_type
     244                      .dwattr $C$DW$T$20, DW_AT_name("GPA1_BITS")
     245                      .dwattr $C$DW$T$20, DW_AT_byte_size(0x02)
     246              $C$DW$9 .dwtag  DW_TAG_member
     247                      .dwattr $C$DW$9, DW_AT_type(*$C$DW$T$19)
     248                      .dwattr $C$DW$9, DW_AT_name("GPIO0")
     249                      .dwattr $C$DW$9, DW_AT_TI_symbol_name("_GPIO0")
     250                      .dwattr $C$DW$9, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x02)
     251                      .dwattr $C$DW$9, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     252                      .dwattr $C$DW$9, DW_AT_accessibility(DW_ACCESS_public)
     253              $C$DW$10        .dwtag  DW_TAG_member
     254                      .dwattr $C$DW$10, DW_AT_type(*$C$DW$T$19)
     255                      .dwattr $C$DW$10, DW_AT_name("GPIO1")
     256                      .dwattr $C$DW$10, DW_AT_TI_symbol_name("_GPIO1")
     257                      .dwattr $C$DW$10, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x02)
     258                      .dwattr $C$DW$10, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     259                      .dwattr $C$DW$10, DW_AT_accessibility(DW_ACCESS_public)
     260              $C$DW$11        .dwtag  DW_TAG_member
     261                      .dwattr $C$DW$11, DW_AT_type(*$C$DW$T$19)
     262                      .dwattr $C$DW$11, DW_AT_name("GPIO2")
     263                      .dwattr $C$DW$11, DW_AT_TI_symbol_name("_GPIO2")
     264                      .dwattr $C$DW$11, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x02)
     265                      .dwattr $C$DW$11, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     266                      .dwattr $C$DW$11, DW_AT_accessibility(DW_ACCESS_public)
     267              $C$DW$12        .dwtag  DW_TAG_member
     268                      .dwattr $C$DW$12, DW_AT_type(*$C$DW$T$19)
     269                      .dwattr $C$DW$12, DW_AT_name("GPIO3")
     270                      .dwattr $C$DW$12, DW_AT_TI_symbol_name("_GPIO3")
     271                      .dwattr $C$DW$12, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x02)
     272                      .dwattr $C$DW$12, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     273                      .dwattr $C$DW$12, DW_AT_accessibility(DW_ACCESS_public)
     274              $C$DW$13        .dwtag  DW_TAG_member
     275                      .dwattr $C$DW$13, DW_AT_type(*$C$DW$T$19)
     276                      .dwattr $C$DW$13, DW_AT_name("GPIO4")
     277                      .dwattr $C$DW$13, DW_AT_TI_symbol_name("_GPIO4")
     278                      .dwattr $C$DW$13, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x02)
     279                      .dwattr $C$DW$13, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     280                      .dwattr $C$DW$13, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:22 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0614010                           PAGE    7

     281              $C$DW$14        .dwtag  DW_TAG_member
     282                      .dwattr $C$DW$14, DW_AT_type(*$C$DW$T$19)
     283                      .dwattr $C$DW$14, DW_AT_name("GPIO5")
     284                      .dwattr $C$DW$14, DW_AT_TI_symbol_name("_GPIO5")
     285                      .dwattr $C$DW$14, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x02)
     286                      .dwattr $C$DW$14, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     287                      .dwattr $C$DW$14, DW_AT_accessibility(DW_ACCESS_public)
     288              $C$DW$15        .dwtag  DW_TAG_member
     289                      .dwattr $C$DW$15, DW_AT_type(*$C$DW$T$19)
     290                      .dwattr $C$DW$15, DW_AT_name("GPIO6")
     291                      .dwattr $C$DW$15, DW_AT_TI_symbol_name("_GPIO6")
     292                      .dwattr $C$DW$15, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x02)
     293                      .dwattr $C$DW$15, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     294                      .dwattr $C$DW$15, DW_AT_accessibility(DW_ACCESS_public)
     295              $C$DW$16        .dwtag  DW_TAG_member
     296                      .dwattr $C$DW$16, DW_AT_type(*$C$DW$T$19)
     297                      .dwattr $C$DW$16, DW_AT_name("GPIO7")
     298                      .dwattr $C$DW$16, DW_AT_TI_symbol_name("_GPIO7")
     299                      .dwattr $C$DW$16, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x02)
     300                      .dwattr $C$DW$16, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     301                      .dwattr $C$DW$16, DW_AT_accessibility(DW_ACCESS_public)
     302              $C$DW$17        .dwtag  DW_TAG_member
     303                      .dwattr $C$DW$17, DW_AT_type(*$C$DW$T$19)
     304                      .dwattr $C$DW$17, DW_AT_name("GPIO8")
     305                      .dwattr $C$DW$17, DW_AT_TI_symbol_name("_GPIO8")
     306                      .dwattr $C$DW$17, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x02)
     307                      .dwattr $C$DW$17, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     308                      .dwattr $C$DW$17, DW_AT_accessibility(DW_ACCESS_public)
     309              $C$DW$18        .dwtag  DW_TAG_member
     310                      .dwattr $C$DW$18, DW_AT_type(*$C$DW$T$19)
     311                      .dwattr $C$DW$18, DW_AT_name("GPIO9")
     312                      .dwattr $C$DW$18, DW_AT_TI_symbol_name("_GPIO9")
     313                      .dwattr $C$DW$18, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x02)
     314                      .dwattr $C$DW$18, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     315                      .dwattr $C$DW$18, DW_AT_accessibility(DW_ACCESS_public)
     316              $C$DW$19        .dwtag  DW_TAG_member
     317                      .dwattr $C$DW$19, DW_AT_type(*$C$DW$T$19)
     318                      .dwattr $C$DW$19, DW_AT_name("GPIO10")
     319                      .dwattr $C$DW$19, DW_AT_TI_symbol_name("_GPIO10")
     320                      .dwattr $C$DW$19, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x02)
     321                      .dwattr $C$DW$19, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     322                      .dwattr $C$DW$19, DW_AT_accessibility(DW_ACCESS_public)
     323              $C$DW$20        .dwtag  DW_TAG_member
     324                      .dwattr $C$DW$20, DW_AT_type(*$C$DW$T$19)
     325                      .dwattr $C$DW$20, DW_AT_name("GPIO11")
     326                      .dwattr $C$DW$20, DW_AT_TI_symbol_name("_GPIO11")
     327                      .dwattr $C$DW$20, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x02)
     328                      .dwattr $C$DW$20, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     329                      .dwattr $C$DW$20, DW_AT_accessibility(DW_ACCESS_public)
     330              $C$DW$21        .dwtag  DW_TAG_member
     331                      .dwattr $C$DW$21, DW_AT_type(*$C$DW$T$19)
     332                      .dwattr $C$DW$21, DW_AT_name("GPIO12")
     333                      .dwattr $C$DW$21, DW_AT_TI_symbol_name("_GPIO12")
     334                      .dwattr $C$DW$21, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x02)
     335                      .dwattr $C$DW$21, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:22 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0614010                           PAGE    8

     336                      .dwattr $C$DW$21, DW_AT_accessibility(DW_ACCESS_public)
     337              $C$DW$22        .dwtag  DW_TAG_member
     338                      .dwattr $C$DW$22, DW_AT_type(*$C$DW$T$19)
     339                      .dwattr $C$DW$22, DW_AT_name("GPIO13")
     340                      .dwattr $C$DW$22, DW_AT_TI_symbol_name("_GPIO13")
     341                      .dwattr $C$DW$22, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x02)
     342                      .dwattr $C$DW$22, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     343                      .dwattr $C$DW$22, DW_AT_accessibility(DW_ACCESS_public)
     344              $C$DW$23        .dwtag  DW_TAG_member
     345                      .dwattr $C$DW$23, DW_AT_type(*$C$DW$T$19)
     346                      .dwattr $C$DW$23, DW_AT_name("GPIO14")
     347                      .dwattr $C$DW$23, DW_AT_TI_symbol_name("_GPIO14")
     348                      .dwattr $C$DW$23, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x02)
     349                      .dwattr $C$DW$23, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     350                      .dwattr $C$DW$23, DW_AT_accessibility(DW_ACCESS_public)
     351              $C$DW$24        .dwtag  DW_TAG_member
     352                      .dwattr $C$DW$24, DW_AT_type(*$C$DW$T$19)
     353                      .dwattr $C$DW$24, DW_AT_name("GPIO15")
     354                      .dwattr $C$DW$24, DW_AT_TI_symbol_name("_GPIO15")
     355                      .dwattr $C$DW$24, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x02)
     356                      .dwattr $C$DW$24, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     357                      .dwattr $C$DW$24, DW_AT_accessibility(DW_ACCESS_public)
     358                      .dwendtag $C$DW$T$20
     359              
     360              
     361              $C$DW$T$22      .dwtag  DW_TAG_union_type
     362                      .dwattr $C$DW$T$22, DW_AT_name("GPA1_REG")
     363                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x02)
     364              $C$DW$25        .dwtag  DW_TAG_member
     365                      .dwattr $C$DW$25, DW_AT_type(*$C$DW$T$21)
     366                      .dwattr $C$DW$25, DW_AT_name("all")
     367                      .dwattr $C$DW$25, DW_AT_TI_symbol_name("_all")
     368                      .dwattr $C$DW$25, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     369                      .dwattr $C$DW$25, DW_AT_accessibility(DW_ACCESS_public)
     370              $C$DW$26        .dwtag  DW_TAG_member
     371                      .dwattr $C$DW$26, DW_AT_type(*$C$DW$T$20)
     372                      .dwattr $C$DW$26, DW_AT_name("bit")
     373                      .dwattr $C$DW$26, DW_AT_TI_symbol_name("_bit")
     374                      .dwattr $C$DW$26, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     375                      .dwattr $C$DW$26, DW_AT_accessibility(DW_ACCESS_public)
     376                      .dwendtag $C$DW$T$22
     377              
     378              
     379              $C$DW$T$23      .dwtag  DW_TAG_structure_type
     380                      .dwattr $C$DW$T$23, DW_AT_name("GPA2_BITS")
     381                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x02)
     382              $C$DW$27        .dwtag  DW_TAG_member
     383                      .dwattr $C$DW$27, DW_AT_type(*$C$DW$T$19)
     384                      .dwattr $C$DW$27, DW_AT_name("GPIO16")
     385                      .dwattr $C$DW$27, DW_AT_TI_symbol_name("_GPIO16")
     386                      .dwattr $C$DW$27, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x02)
     387                      .dwattr $C$DW$27, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     388                      .dwattr $C$DW$27, DW_AT_accessibility(DW_ACCESS_public)
     389              $C$DW$28        .dwtag  DW_TAG_member
     390                      .dwattr $C$DW$28, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:22 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0614010                           PAGE    9

     391                      .dwattr $C$DW$28, DW_AT_name("GPIO17")
     392                      .dwattr $C$DW$28, DW_AT_TI_symbol_name("_GPIO17")
     393                      .dwattr $C$DW$28, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x02)
     394                      .dwattr $C$DW$28, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     395                      .dwattr $C$DW$28, DW_AT_accessibility(DW_ACCESS_public)
     396              $C$DW$29        .dwtag  DW_TAG_member
     397                      .dwattr $C$DW$29, DW_AT_type(*$C$DW$T$19)
     398                      .dwattr $C$DW$29, DW_AT_name("GPIO18")
     399                      .dwattr $C$DW$29, DW_AT_TI_symbol_name("_GPIO18")
     400                      .dwattr $C$DW$29, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x02)
     401                      .dwattr $C$DW$29, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     402                      .dwattr $C$DW$29, DW_AT_accessibility(DW_ACCESS_public)
     403              $C$DW$30        .dwtag  DW_TAG_member
     404                      .dwattr $C$DW$30, DW_AT_type(*$C$DW$T$19)
     405                      .dwattr $C$DW$30, DW_AT_name("GPIO19")
     406                      .dwattr $C$DW$30, DW_AT_TI_symbol_name("_GPIO19")
     407                      .dwattr $C$DW$30, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x02)
     408                      .dwattr $C$DW$30, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     409                      .dwattr $C$DW$30, DW_AT_accessibility(DW_ACCESS_public)
     410              $C$DW$31        .dwtag  DW_TAG_member
     411                      .dwattr $C$DW$31, DW_AT_type(*$C$DW$T$19)
     412                      .dwattr $C$DW$31, DW_AT_name("GPIO20")
     413                      .dwattr $C$DW$31, DW_AT_TI_symbol_name("_GPIO20")
     414                      .dwattr $C$DW$31, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x02)
     415                      .dwattr $C$DW$31, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     416                      .dwattr $C$DW$31, DW_AT_accessibility(DW_ACCESS_public)
     417              $C$DW$32        .dwtag  DW_TAG_member
     418                      .dwattr $C$DW$32, DW_AT_type(*$C$DW$T$19)
     419                      .dwattr $C$DW$32, DW_AT_name("GPIO21")
     420                      .dwattr $C$DW$32, DW_AT_TI_symbol_name("_GPIO21")
     421                      .dwattr $C$DW$32, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x02)
     422                      .dwattr $C$DW$32, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     423                      .dwattr $C$DW$32, DW_AT_accessibility(DW_ACCESS_public)
     424              $C$DW$33        .dwtag  DW_TAG_member
     425                      .dwattr $C$DW$33, DW_AT_type(*$C$DW$T$19)
     426                      .dwattr $C$DW$33, DW_AT_name("GPIO22")
     427                      .dwattr $C$DW$33, DW_AT_TI_symbol_name("_GPIO22")
     428                      .dwattr $C$DW$33, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x02)
     429                      .dwattr $C$DW$33, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     430                      .dwattr $C$DW$33, DW_AT_accessibility(DW_ACCESS_public)
     431              $C$DW$34        .dwtag  DW_TAG_member
     432                      .dwattr $C$DW$34, DW_AT_type(*$C$DW$T$19)
     433                      .dwattr $C$DW$34, DW_AT_name("GPIO23")
     434                      .dwattr $C$DW$34, DW_AT_TI_symbol_name("_GPIO23")
     435                      .dwattr $C$DW$34, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x02)
     436                      .dwattr $C$DW$34, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     437                      .dwattr $C$DW$34, DW_AT_accessibility(DW_ACCESS_public)
     438              $C$DW$35        .dwtag  DW_TAG_member
     439                      .dwattr $C$DW$35, DW_AT_type(*$C$DW$T$19)
     440                      .dwattr $C$DW$35, DW_AT_name("GPIO24")
     441                      .dwattr $C$DW$35, DW_AT_TI_symbol_name("_GPIO24")
     442                      .dwattr $C$DW$35, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x02)
     443                      .dwattr $C$DW$35, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     444                      .dwattr $C$DW$35, DW_AT_accessibility(DW_ACCESS_public)
     445              $C$DW$36        .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:22 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0614010                           PAGE   10

     446                      .dwattr $C$DW$36, DW_AT_type(*$C$DW$T$19)
     447                      .dwattr $C$DW$36, DW_AT_name("GPIO25")
     448                      .dwattr $C$DW$36, DW_AT_TI_symbol_name("_GPIO25")
     449                      .dwattr $C$DW$36, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x02)
     450                      .dwattr $C$DW$36, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     451                      .dwattr $C$DW$36, DW_AT_accessibility(DW_ACCESS_public)
     452              $C$DW$37        .dwtag  DW_TAG_member
     453                      .dwattr $C$DW$37, DW_AT_type(*$C$DW$T$19)
     454                      .dwattr $C$DW$37, DW_AT_name("GPIO26")
     455                      .dwattr $C$DW$37, DW_AT_TI_symbol_name("_GPIO26")
     456                      .dwattr $C$DW$37, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x02)
     457                      .dwattr $C$DW$37, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     458                      .dwattr $C$DW$37, DW_AT_accessibility(DW_ACCESS_public)
     459              $C$DW$38        .dwtag  DW_TAG_member
     460                      .dwattr $C$DW$38, DW_AT_type(*$C$DW$T$19)
     461                      .dwattr $C$DW$38, DW_AT_name("GPIO27")
     462                      .dwattr $C$DW$38, DW_AT_TI_symbol_name("_GPIO27")
     463                      .dwattr $C$DW$38, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x02)
     464                      .dwattr $C$DW$38, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     465                      .dwattr $C$DW$38, DW_AT_accessibility(DW_ACCESS_public)
     466              $C$DW$39        .dwtag  DW_TAG_member
     467                      .dwattr $C$DW$39, DW_AT_type(*$C$DW$T$19)
     468                      .dwattr $C$DW$39, DW_AT_name("GPIO28")
     469                      .dwattr $C$DW$39, DW_AT_TI_symbol_name("_GPIO28")
     470                      .dwattr $C$DW$39, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x02)
     471                      .dwattr $C$DW$39, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     472                      .dwattr $C$DW$39, DW_AT_accessibility(DW_ACCESS_public)
     473              $C$DW$40        .dwtag  DW_TAG_member
     474                      .dwattr $C$DW$40, DW_AT_type(*$C$DW$T$19)
     475                      .dwattr $C$DW$40, DW_AT_name("GPIO29")
     476                      .dwattr $C$DW$40, DW_AT_TI_symbol_name("_GPIO29")
     477                      .dwattr $C$DW$40, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x02)
     478                      .dwattr $C$DW$40, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     479                      .dwattr $C$DW$40, DW_AT_accessibility(DW_ACCESS_public)
     480              $C$DW$41        .dwtag  DW_TAG_member
     481                      .dwattr $C$DW$41, DW_AT_type(*$C$DW$T$19)
     482                      .dwattr $C$DW$41, DW_AT_name("GPIO30")
     483                      .dwattr $C$DW$41, DW_AT_TI_symbol_name("_GPIO30")
     484                      .dwattr $C$DW$41, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x02)
     485                      .dwattr $C$DW$41, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     486                      .dwattr $C$DW$41, DW_AT_accessibility(DW_ACCESS_public)
     487              $C$DW$42        .dwtag  DW_TAG_member
     488                      .dwattr $C$DW$42, DW_AT_type(*$C$DW$T$19)
     489                      .dwattr $C$DW$42, DW_AT_name("GPIO31")
     490                      .dwattr $C$DW$42, DW_AT_TI_symbol_name("_GPIO31")
     491                      .dwattr $C$DW$42, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x02)
     492                      .dwattr $C$DW$42, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     493                      .dwattr $C$DW$42, DW_AT_accessibility(DW_ACCESS_public)
     494                      .dwendtag $C$DW$T$23
     495              
     496              
     497              $C$DW$T$24      .dwtag  DW_TAG_union_type
     498                      .dwattr $C$DW$T$24, DW_AT_name("GPA2_REG")
     499                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x02)
     500              $C$DW$43        .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:22 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0614010                           PAGE   11

     501                      .dwattr $C$DW$43, DW_AT_type(*$C$DW$T$21)
     502                      .dwattr $C$DW$43, DW_AT_name("all")
     503                      .dwattr $C$DW$43, DW_AT_TI_symbol_name("_all")
     504                      .dwattr $C$DW$43, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     505                      .dwattr $C$DW$43, DW_AT_accessibility(DW_ACCESS_public)
     506              $C$DW$44        .dwtag  DW_TAG_member
     507                      .dwattr $C$DW$44, DW_AT_type(*$C$DW$T$23)
     508                      .dwattr $C$DW$44, DW_AT_name("bit")
     509                      .dwattr $C$DW$44, DW_AT_TI_symbol_name("_bit")
     510                      .dwattr $C$DW$44, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     511                      .dwattr $C$DW$44, DW_AT_accessibility(DW_ACCESS_public)
     512                      .dwendtag $C$DW$T$24
     513              
     514              
     515              $C$DW$T$25      .dwtag  DW_TAG_structure_type
     516                      .dwattr $C$DW$T$25, DW_AT_name("GPACTRL_BITS")
     517                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x02)
     518              $C$DW$45        .dwtag  DW_TAG_member
     519                      .dwattr $C$DW$45, DW_AT_type(*$C$DW$T$19)
     520                      .dwattr $C$DW$45, DW_AT_name("QUALPRD0")
     521                      .dwattr $C$DW$45, DW_AT_TI_symbol_name("_QUALPRD0")
     522                      .dwattr $C$DW$45, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x08)
     523                      .dwattr $C$DW$45, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     524                      .dwattr $C$DW$45, DW_AT_accessibility(DW_ACCESS_public)
     525              $C$DW$46        .dwtag  DW_TAG_member
     526                      .dwattr $C$DW$46, DW_AT_type(*$C$DW$T$19)
     527                      .dwattr $C$DW$46, DW_AT_name("QUALPRD1")
     528                      .dwattr $C$DW$46, DW_AT_TI_symbol_name("_QUALPRD1")
     529                      .dwattr $C$DW$46, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x08)
     530                      .dwattr $C$DW$46, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     531                      .dwattr $C$DW$46, DW_AT_accessibility(DW_ACCESS_public)
     532              $C$DW$47        .dwtag  DW_TAG_member
     533                      .dwattr $C$DW$47, DW_AT_type(*$C$DW$T$19)
     534                      .dwattr $C$DW$47, DW_AT_name("QUALPRD2")
     535                      .dwattr $C$DW$47, DW_AT_TI_symbol_name("_QUALPRD2")
     536                      .dwattr $C$DW$47, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x08)
     537                      .dwattr $C$DW$47, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     538                      .dwattr $C$DW$47, DW_AT_accessibility(DW_ACCESS_public)
     539              $C$DW$48        .dwtag  DW_TAG_member
     540                      .dwattr $C$DW$48, DW_AT_type(*$C$DW$T$19)
     541                      .dwattr $C$DW$48, DW_AT_name("QUALPRD3")
     542                      .dwattr $C$DW$48, DW_AT_TI_symbol_name("_QUALPRD3")
     543                      .dwattr $C$DW$48, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x08)
     544                      .dwattr $C$DW$48, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     545                      .dwattr $C$DW$48, DW_AT_accessibility(DW_ACCESS_public)
     546                      .dwendtag $C$DW$T$25
     547              
     548              
     549              $C$DW$T$26      .dwtag  DW_TAG_union_type
     550                      .dwattr $C$DW$T$26, DW_AT_name("GPACTRL_REG")
     551                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x02)
     552              $C$DW$49        .dwtag  DW_TAG_member
     553                      .dwattr $C$DW$49, DW_AT_type(*$C$DW$T$21)
     554                      .dwattr $C$DW$49, DW_AT_name("all")
     555                      .dwattr $C$DW$49, DW_AT_TI_symbol_name("_all")
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:22 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0614010                           PAGE   12

     556                      .dwattr $C$DW$49, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     557                      .dwattr $C$DW$49, DW_AT_accessibility(DW_ACCESS_public)
     558              $C$DW$50        .dwtag  DW_TAG_member
     559                      .dwattr $C$DW$50, DW_AT_type(*$C$DW$T$25)
     560                      .dwattr $C$DW$50, DW_AT_name("bit")
     561                      .dwattr $C$DW$50, DW_AT_TI_symbol_name("_bit")
     562                      .dwattr $C$DW$50, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     563                      .dwattr $C$DW$50, DW_AT_accessibility(DW_ACCESS_public)
     564                      .dwendtag $C$DW$T$26
     565              
     566              
     567              $C$DW$T$27      .dwtag  DW_TAG_structure_type
     568                      .dwattr $C$DW$T$27, DW_AT_name("GPADAT_BITS")
     569                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x02)
     570              $C$DW$51        .dwtag  DW_TAG_member
     571                      .dwattr $C$DW$51, DW_AT_type(*$C$DW$T$19)
     572                      .dwattr $C$DW$51, DW_AT_name("GPIO0")
     573                      .dwattr $C$DW$51, DW_AT_TI_symbol_name("_GPIO0")
     574                      .dwattr $C$DW$51, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
     575                      .dwattr $C$DW$51, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     576                      .dwattr $C$DW$51, DW_AT_accessibility(DW_ACCESS_public)
     577              $C$DW$52        .dwtag  DW_TAG_member
     578                      .dwattr $C$DW$52, DW_AT_type(*$C$DW$T$19)
     579                      .dwattr $C$DW$52, DW_AT_name("GPIO1")
     580                      .dwattr $C$DW$52, DW_AT_TI_symbol_name("_GPIO1")
     581                      .dwattr $C$DW$52, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
     582                      .dwattr $C$DW$52, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     583                      .dwattr $C$DW$52, DW_AT_accessibility(DW_ACCESS_public)
     584              $C$DW$53        .dwtag  DW_TAG_member
     585                      .dwattr $C$DW$53, DW_AT_type(*$C$DW$T$19)
     586                      .dwattr $C$DW$53, DW_AT_name("GPIO2")
     587                      .dwattr $C$DW$53, DW_AT_TI_symbol_name("_GPIO2")
     588                      .dwattr $C$DW$53, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
     589                      .dwattr $C$DW$53, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     590                      .dwattr $C$DW$53, DW_AT_accessibility(DW_ACCESS_public)
     591              $C$DW$54        .dwtag  DW_TAG_member
     592                      .dwattr $C$DW$54, DW_AT_type(*$C$DW$T$19)
     593                      .dwattr $C$DW$54, DW_AT_name("GPIO3")
     594                      .dwattr $C$DW$54, DW_AT_TI_symbol_name("_GPIO3")
     595                      .dwattr $C$DW$54, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
     596                      .dwattr $C$DW$54, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     597                      .dwattr $C$DW$54, DW_AT_accessibility(DW_ACCESS_public)
     598              $C$DW$55        .dwtag  DW_TAG_member
     599                      .dwattr $C$DW$55, DW_AT_type(*$C$DW$T$19)
     600                      .dwattr $C$DW$55, DW_AT_name("GPIO4")
     601                      .dwattr $C$DW$55, DW_AT_TI_symbol_name("_GPIO4")
     602                      .dwattr $C$DW$55, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
     603                      .dwattr $C$DW$55, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     604                      .dwattr $C$DW$55, DW_AT_accessibility(DW_ACCESS_public)
     605              $C$DW$56        .dwtag  DW_TAG_member
     606                      .dwattr $C$DW$56, DW_AT_type(*$C$DW$T$19)
     607                      .dwattr $C$DW$56, DW_AT_name("GPIO5")
     608                      .dwattr $C$DW$56, DW_AT_TI_symbol_name("_GPIO5")
     609                      .dwattr $C$DW$56, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
     610                      .dwattr $C$DW$56, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:22 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0614010                           PAGE   13

     611                      .dwattr $C$DW$56, DW_AT_accessibility(DW_ACCESS_public)
     612              $C$DW$57        .dwtag  DW_TAG_member
     613                      .dwattr $C$DW$57, DW_AT_type(*$C$DW$T$19)
     614                      .dwattr $C$DW$57, DW_AT_name("GPIO6")
     615                      .dwattr $C$DW$57, DW_AT_TI_symbol_name("_GPIO6")
     616                      .dwattr $C$DW$57, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
     617                      .dwattr $C$DW$57, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     618                      .dwattr $C$DW$57, DW_AT_accessibility(DW_ACCESS_public)
     619              $C$DW$58        .dwtag  DW_TAG_member
     620                      .dwattr $C$DW$58, DW_AT_type(*$C$DW$T$19)
     621                      .dwattr $C$DW$58, DW_AT_name("GPIO7")
     622                      .dwattr $C$DW$58, DW_AT_TI_symbol_name("_GPIO7")
     623                      .dwattr $C$DW$58, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
     624                      .dwattr $C$DW$58, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     625                      .dwattr $C$DW$58, DW_AT_accessibility(DW_ACCESS_public)
     626              $C$DW$59        .dwtag  DW_TAG_member
     627                      .dwattr $C$DW$59, DW_AT_type(*$C$DW$T$19)
     628                      .dwattr $C$DW$59, DW_AT_name("GPIO8")
     629                      .dwattr $C$DW$59, DW_AT_TI_symbol_name("_GPIO8")
     630                      .dwattr $C$DW$59, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
     631                      .dwattr $C$DW$59, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     632                      .dwattr $C$DW$59, DW_AT_accessibility(DW_ACCESS_public)
     633              $C$DW$60        .dwtag  DW_TAG_member
     634                      .dwattr $C$DW$60, DW_AT_type(*$C$DW$T$19)
     635                      .dwattr $C$DW$60, DW_AT_name("GPIO9")
     636                      .dwattr $C$DW$60, DW_AT_TI_symbol_name("_GPIO9")
     637                      .dwattr $C$DW$60, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
     638                      .dwattr $C$DW$60, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     639                      .dwattr $C$DW$60, DW_AT_accessibility(DW_ACCESS_public)
     640              $C$DW$61        .dwtag  DW_TAG_member
     641                      .dwattr $C$DW$61, DW_AT_type(*$C$DW$T$19)
     642                      .dwattr $C$DW$61, DW_AT_name("GPIO10")
     643                      .dwattr $C$DW$61, DW_AT_TI_symbol_name("_GPIO10")
     644                      .dwattr $C$DW$61, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
     645                      .dwattr $C$DW$61, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     646                      .dwattr $C$DW$61, DW_AT_accessibility(DW_ACCESS_public)
     647              $C$DW$62        .dwtag  DW_TAG_member
     648                      .dwattr $C$DW$62, DW_AT_type(*$C$DW$T$19)
     649                      .dwattr $C$DW$62, DW_AT_name("GPIO11")
     650                      .dwattr $C$DW$62, DW_AT_TI_symbol_name("_GPIO11")
     651                      .dwattr $C$DW$62, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
     652                      .dwattr $C$DW$62, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     653                      .dwattr $C$DW$62, DW_AT_accessibility(DW_ACCESS_public)
     654              $C$DW$63        .dwtag  DW_TAG_member
     655                      .dwattr $C$DW$63, DW_AT_type(*$C$DW$T$19)
     656                      .dwattr $C$DW$63, DW_AT_name("GPIO12")
     657                      .dwattr $C$DW$63, DW_AT_TI_symbol_name("_GPIO12")
     658                      .dwattr $C$DW$63, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
     659                      .dwattr $C$DW$63, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     660                      .dwattr $C$DW$63, DW_AT_accessibility(DW_ACCESS_public)
     661              $C$DW$64        .dwtag  DW_TAG_member
     662                      .dwattr $C$DW$64, DW_AT_type(*$C$DW$T$19)
     663                      .dwattr $C$DW$64, DW_AT_name("GPIO13")
     664                      .dwattr $C$DW$64, DW_AT_TI_symbol_name("_GPIO13")
     665                      .dwattr $C$DW$64, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:22 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0614010                           PAGE   14

     666                      .dwattr $C$DW$64, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     667                      .dwattr $C$DW$64, DW_AT_accessibility(DW_ACCESS_public)
     668              $C$DW$65        .dwtag  DW_TAG_member
     669                      .dwattr $C$DW$65, DW_AT_type(*$C$DW$T$19)
     670                      .dwattr $C$DW$65, DW_AT_name("GPIO14")
     671                      .dwattr $C$DW$65, DW_AT_TI_symbol_name("_GPIO14")
     672                      .dwattr $C$DW$65, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
     673                      .dwattr $C$DW$65, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     674                      .dwattr $C$DW$65, DW_AT_accessibility(DW_ACCESS_public)
     675              $C$DW$66        .dwtag  DW_TAG_member
     676                      .dwattr $C$DW$66, DW_AT_type(*$C$DW$T$19)
     677                      .dwattr $C$DW$66, DW_AT_name("GPIO15")
     678                      .dwattr $C$DW$66, DW_AT_TI_symbol_name("_GPIO15")
     679                      .dwattr $C$DW$66, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
     680                      .dwattr $C$DW$66, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     681                      .dwattr $C$DW$66, DW_AT_accessibility(DW_ACCESS_public)
     682              $C$DW$67        .dwtag  DW_TAG_member
     683                      .dwattr $C$DW$67, DW_AT_type(*$C$DW$T$19)
     684                      .dwattr $C$DW$67, DW_AT_name("GPIO16")
     685                      .dwattr $C$DW$67, DW_AT_TI_symbol_name("_GPIO16")
     686                      .dwattr $C$DW$67, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
     687                      .dwattr $C$DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     688                      .dwattr $C$DW$67, DW_AT_accessibility(DW_ACCESS_public)
     689              $C$DW$68        .dwtag  DW_TAG_member
     690                      .dwattr $C$DW$68, DW_AT_type(*$C$DW$T$19)
     691                      .dwattr $C$DW$68, DW_AT_name("GPIO17")
     692                      .dwattr $C$DW$68, DW_AT_TI_symbol_name("_GPIO17")
     693                      .dwattr $C$DW$68, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
     694                      .dwattr $C$DW$68, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     695                      .dwattr $C$DW$68, DW_AT_accessibility(DW_ACCESS_public)
     696              $C$DW$69        .dwtag  DW_TAG_member
     697                      .dwattr $C$DW$69, DW_AT_type(*$C$DW$T$19)
     698                      .dwattr $C$DW$69, DW_AT_name("GPIO18")
     699                      .dwattr $C$DW$69, DW_AT_TI_symbol_name("_GPIO18")
     700                      .dwattr $C$DW$69, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
     701                      .dwattr $C$DW$69, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     702                      .dwattr $C$DW$69, DW_AT_accessibility(DW_ACCESS_public)
     703              $C$DW$70        .dwtag  DW_TAG_member
     704                      .dwattr $C$DW$70, DW_AT_type(*$C$DW$T$19)
     705                      .dwattr $C$DW$70, DW_AT_name("GPIO19")
     706                      .dwattr $C$DW$70, DW_AT_TI_symbol_name("_GPIO19")
     707                      .dwattr $C$DW$70, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
     708                      .dwattr $C$DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     709                      .dwattr $C$DW$70, DW_AT_accessibility(DW_ACCESS_public)
     710              $C$DW$71        .dwtag  DW_TAG_member
     711                      .dwattr $C$DW$71, DW_AT_type(*$C$DW$T$19)
     712                      .dwattr $C$DW$71, DW_AT_name("GPIO20")
     713                      .dwattr $C$DW$71, DW_AT_TI_symbol_name("_GPIO20")
     714                      .dwattr $C$DW$71, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
     715                      .dwattr $C$DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     716                      .dwattr $C$DW$71, DW_AT_accessibility(DW_ACCESS_public)
     717              $C$DW$72        .dwtag  DW_TAG_member
     718                      .dwattr $C$DW$72, DW_AT_type(*$C$DW$T$19)
     719                      .dwattr $C$DW$72, DW_AT_name("GPIO21")
     720                      .dwattr $C$DW$72, DW_AT_TI_symbol_name("_GPIO21")
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:22 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0614010                           PAGE   15

     721                      .dwattr $C$DW$72, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
     722                      .dwattr $C$DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     723                      .dwattr $C$DW$72, DW_AT_accessibility(DW_ACCESS_public)
     724              $C$DW$73        .dwtag  DW_TAG_member
     725                      .dwattr $C$DW$73, DW_AT_type(*$C$DW$T$19)
     726                      .dwattr $C$DW$73, DW_AT_name("GPIO22")
     727                      .dwattr $C$DW$73, DW_AT_TI_symbol_name("_GPIO22")
     728                      .dwattr $C$DW$73, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
     729                      .dwattr $C$DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     730                      .dwattr $C$DW$73, DW_AT_accessibility(DW_ACCESS_public)
     731              $C$DW$74        .dwtag  DW_TAG_member
     732                      .dwattr $C$DW$74, DW_AT_type(*$C$DW$T$19)
     733                      .dwattr $C$DW$74, DW_AT_name("GPIO23")
     734                      .dwattr $C$DW$74, DW_AT_TI_symbol_name("_GPIO23")
     735                      .dwattr $C$DW$74, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
     736                      .dwattr $C$DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     737                      .dwattr $C$DW$74, DW_AT_accessibility(DW_ACCESS_public)
     738              $C$DW$75        .dwtag  DW_TAG_member
     739                      .dwattr $C$DW$75, DW_AT_type(*$C$DW$T$19)
     740                      .dwattr $C$DW$75, DW_AT_name("GPIO24")
     741                      .dwattr $C$DW$75, DW_AT_TI_symbol_name("_GPIO24")
     742                      .dwattr $C$DW$75, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
     743                      .dwattr $C$DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     744                      .dwattr $C$DW$75, DW_AT_accessibility(DW_ACCESS_public)
     745              $C$DW$76        .dwtag  DW_TAG_member
     746                      .dwattr $C$DW$76, DW_AT_type(*$C$DW$T$19)
     747                      .dwattr $C$DW$76, DW_AT_name("GPIO25")
     748                      .dwattr $C$DW$76, DW_AT_TI_symbol_name("_GPIO25")
     749                      .dwattr $C$DW$76, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
     750                      .dwattr $C$DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     751                      .dwattr $C$DW$76, DW_AT_accessibility(DW_ACCESS_public)
     752              $C$DW$77        .dwtag  DW_TAG_member
     753                      .dwattr $C$DW$77, DW_AT_type(*$C$DW$T$19)
     754                      .dwattr $C$DW$77, DW_AT_name("GPIO26")
     755                      .dwattr $C$DW$77, DW_AT_TI_symbol_name("_GPIO26")
     756                      .dwattr $C$DW$77, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
     757                      .dwattr $C$DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     758                      .dwattr $C$DW$77, DW_AT_accessibility(DW_ACCESS_public)
     759              $C$DW$78        .dwtag  DW_TAG_member
     760                      .dwattr $C$DW$78, DW_AT_type(*$C$DW$T$19)
     761                      .dwattr $C$DW$78, DW_AT_name("GPIO27")
     762                      .dwattr $C$DW$78, DW_AT_TI_symbol_name("_GPIO27")
     763                      .dwattr $C$DW$78, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
     764                      .dwattr $C$DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     765                      .dwattr $C$DW$78, DW_AT_accessibility(DW_ACCESS_public)
     766              $C$DW$79        .dwtag  DW_TAG_member
     767                      .dwattr $C$DW$79, DW_AT_type(*$C$DW$T$19)
     768                      .dwattr $C$DW$79, DW_AT_name("GPIO28")
     769                      .dwattr $C$DW$79, DW_AT_TI_symbol_name("_GPIO28")
     770                      .dwattr $C$DW$79, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
     771                      .dwattr $C$DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     772                      .dwattr $C$DW$79, DW_AT_accessibility(DW_ACCESS_public)
     773              $C$DW$80        .dwtag  DW_TAG_member
     774                      .dwattr $C$DW$80, DW_AT_type(*$C$DW$T$19)
     775                      .dwattr $C$DW$80, DW_AT_name("GPIO29")
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:22 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0614010                           PAGE   16

     776                      .dwattr $C$DW$80, DW_AT_TI_symbol_name("_GPIO29")
     777                      .dwattr $C$DW$80, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
     778                      .dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     779                      .dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
     780              $C$DW$81        .dwtag  DW_TAG_member
     781                      .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$19)
     782                      .dwattr $C$DW$81, DW_AT_name("GPIO30")
     783                      .dwattr $C$DW$81, DW_AT_TI_symbol_name("_GPIO30")
     784                      .dwattr $C$DW$81, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
     785                      .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     786                      .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
     787              $C$DW$82        .dwtag  DW_TAG_member
     788                      .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$19)
     789                      .dwattr $C$DW$82, DW_AT_name("GPIO31")
     790                      .dwattr $C$DW$82, DW_AT_TI_symbol_name("_GPIO31")
     791                      .dwattr $C$DW$82, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
     792                      .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     793                      .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
     794                      .dwendtag $C$DW$T$27
     795              
     796              
     797              $C$DW$T$28      .dwtag  DW_TAG_union_type
     798                      .dwattr $C$DW$T$28, DW_AT_name("GPADAT_REG")
     799                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x02)
     800              $C$DW$83        .dwtag  DW_TAG_member
     801                      .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$21)
     802                      .dwattr $C$DW$83, DW_AT_name("all")
     803                      .dwattr $C$DW$83, DW_AT_TI_symbol_name("_all")
     804                      .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     805                      .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
     806              $C$DW$84        .dwtag  DW_TAG_member
     807                      .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$27)
     808                      .dwattr $C$DW$84, DW_AT_name("bit")
     809                      .dwattr $C$DW$84, DW_AT_TI_symbol_name("_bit")
     810                      .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     811                      .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
     812                      .dwendtag $C$DW$T$28
     813              
     814              
     815              $C$DW$T$29      .dwtag  DW_TAG_structure_type
     816                      .dwattr $C$DW$T$29, DW_AT_name("GPB1_BITS")
     817                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x02)
     818              $C$DW$85        .dwtag  DW_TAG_member
     819                      .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$19)
     820                      .dwattr $C$DW$85, DW_AT_name("GPIO32")
     821                      .dwattr $C$DW$85, DW_AT_TI_symbol_name("_GPIO32")
     822                      .dwattr $C$DW$85, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x02)
     823                      .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     824                      .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
     825              $C$DW$86        .dwtag  DW_TAG_member
     826                      .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$19)
     827                      .dwattr $C$DW$86, DW_AT_name("GPIO33")
     828                      .dwattr $C$DW$86, DW_AT_TI_symbol_name("_GPIO33")
     829                      .dwattr $C$DW$86, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x02)
     830                      .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:22 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0614010                           PAGE   17

     831                      .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
     832              $C$DW$87        .dwtag  DW_TAG_member
     833                      .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$19)
     834                      .dwattr $C$DW$87, DW_AT_name("GPIO34")
     835                      .dwattr $C$DW$87, DW_AT_TI_symbol_name("_GPIO34")
     836                      .dwattr $C$DW$87, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x02)
     837                      .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     838                      .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
     839              $C$DW$88        .dwtag  DW_TAG_member
     840                      .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$19)
     841                      .dwattr $C$DW$88, DW_AT_name("GPIO35")
     842                      .dwattr $C$DW$88, DW_AT_TI_symbol_name("_GPIO35")
     843                      .dwattr $C$DW$88, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x02)
     844                      .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     845                      .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
     846              $C$DW$89        .dwtag  DW_TAG_member
     847                      .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$19)
     848                      .dwattr $C$DW$89, DW_AT_name("GPIO36")
     849                      .dwattr $C$DW$89, DW_AT_TI_symbol_name("_GPIO36")
     850                      .dwattr $C$DW$89, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x02)
     851                      .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     852                      .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
     853              $C$DW$90        .dwtag  DW_TAG_member
     854                      .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$19)
     855                      .dwattr $C$DW$90, DW_AT_name("GPIO37")
     856                      .dwattr $C$DW$90, DW_AT_TI_symbol_name("_GPIO37")
     857                      .dwattr $C$DW$90, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x02)
     858                      .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     859                      .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
     860              $C$DW$91        .dwtag  DW_TAG_member
     861                      .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$19)
     862                      .dwattr $C$DW$91, DW_AT_name("GPIO38")
     863                      .dwattr $C$DW$91, DW_AT_TI_symbol_name("_GPIO38")
     864                      .dwattr $C$DW$91, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x02)
     865                      .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     866                      .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
     867              $C$DW$92        .dwtag  DW_TAG_member
     868                      .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$19)
     869                      .dwattr $C$DW$92, DW_AT_name("GPIO39")
     870                      .dwattr $C$DW$92, DW_AT_TI_symbol_name("_GPIO39")
     871                      .dwattr $C$DW$92, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x02)
     872                      .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     873                      .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
     874              $C$DW$93        .dwtag  DW_TAG_member
     875                      .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$19)
     876                      .dwattr $C$DW$93, DW_AT_name("GPIO40")
     877                      .dwattr $C$DW$93, DW_AT_TI_symbol_name("_GPIO40")
     878                      .dwattr $C$DW$93, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x02)
     879                      .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     880                      .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
     881              $C$DW$94        .dwtag  DW_TAG_member
     882                      .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$19)
     883                      .dwattr $C$DW$94, DW_AT_name("GPIO41")
     884                      .dwattr $C$DW$94, DW_AT_TI_symbol_name("_GPIO41")
     885                      .dwattr $C$DW$94, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x02)
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:22 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0614010                           PAGE   18

     886                      .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     887                      .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
     888              $C$DW$95        .dwtag  DW_TAG_member
     889                      .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$19)
     890                      .dwattr $C$DW$95, DW_AT_name("GPIO42")
     891                      .dwattr $C$DW$95, DW_AT_TI_symbol_name("_GPIO42")
     892                      .dwattr $C$DW$95, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x02)
     893                      .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     894                      .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
     895              $C$DW$96        .dwtag  DW_TAG_member
     896                      .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$19)
     897                      .dwattr $C$DW$96, DW_AT_name("GPIO43")
     898                      .dwattr $C$DW$96, DW_AT_TI_symbol_name("_GPIO43")
     899                      .dwattr $C$DW$96, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x02)
     900                      .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     901                      .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
     902              $C$DW$97        .dwtag  DW_TAG_member
     903                      .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$19)
     904                      .dwattr $C$DW$97, DW_AT_name("GPIO44")
     905                      .dwattr $C$DW$97, DW_AT_TI_symbol_name("_GPIO44")
     906                      .dwattr $C$DW$97, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x02)
     907                      .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     908                      .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
     909              $C$DW$98        .dwtag  DW_TAG_member
     910                      .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$19)
     911                      .dwattr $C$DW$98, DW_AT_name("GPIO45")
     912                      .dwattr $C$DW$98, DW_AT_TI_symbol_name("_GPIO45")
     913                      .dwattr $C$DW$98, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x02)
     914                      .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     915                      .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
     916              $C$DW$99        .dwtag  DW_TAG_member
     917                      .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$19)
     918                      .dwattr $C$DW$99, DW_AT_name("GPIO46")
     919                      .dwattr $C$DW$99, DW_AT_TI_symbol_name("_GPIO46")
     920                      .dwattr $C$DW$99, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x02)
     921                      .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     922                      .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
     923              $C$DW$100       .dwtag  DW_TAG_member
     924                      .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$19)
     925                      .dwattr $C$DW$100, DW_AT_name("GPIO47")
     926                      .dwattr $C$DW$100, DW_AT_TI_symbol_name("_GPIO47")
     927                      .dwattr $C$DW$100, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x02)
     928                      .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     929                      .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
     930                      .dwendtag $C$DW$T$29
     931              
     932              
     933              $C$DW$T$30      .dwtag  DW_TAG_union_type
     934                      .dwattr $C$DW$T$30, DW_AT_name("GPB1_REG")
     935                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x02)
     936              $C$DW$101       .dwtag  DW_TAG_member
     937                      .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$21)
     938                      .dwattr $C$DW$101, DW_AT_name("all")
     939                      .dwattr $C$DW$101, DW_AT_TI_symbol_name("_all")
     940                      .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:22 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0614010                           PAGE   19

     941                      .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
     942              $C$DW$102       .dwtag  DW_TAG_member
     943                      .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$29)
     944                      .dwattr $C$DW$102, DW_AT_name("bit")
     945                      .dwattr $C$DW$102, DW_AT_TI_symbol_name("_bit")
     946                      .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     947                      .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
     948                      .dwendtag $C$DW$T$30
     949              
     950              
     951              $C$DW$T$31      .dwtag  DW_TAG_structure_type
     952                      .dwattr $C$DW$T$31, DW_AT_name("GPB2_BITS")
     953                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x02)
     954              $C$DW$103       .dwtag  DW_TAG_member
     955                      .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$19)
     956                      .dwattr $C$DW$103, DW_AT_name("GPIO48")
     957                      .dwattr $C$DW$103, DW_AT_TI_symbol_name("_GPIO48")
     958                      .dwattr $C$DW$103, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x02)
     959                      .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     960                      .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
     961              $C$DW$104       .dwtag  DW_TAG_member
     962                      .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$19)
     963                      .dwattr $C$DW$104, DW_AT_name("GPIO49")
     964                      .dwattr $C$DW$104, DW_AT_TI_symbol_name("_GPIO49")
     965                      .dwattr $C$DW$104, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x02)
     966                      .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     967                      .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
     968              $C$DW$105       .dwtag  DW_TAG_member
     969                      .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$19)
     970                      .dwattr $C$DW$105, DW_AT_name("GPIO50")
     971                      .dwattr $C$DW$105, DW_AT_TI_symbol_name("_GPIO50")
     972                      .dwattr $C$DW$105, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x02)
     973                      .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     974                      .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
     975              $C$DW$106       .dwtag  DW_TAG_member
     976                      .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$19)
     977                      .dwattr $C$DW$106, DW_AT_name("GPIO51")
     978                      .dwattr $C$DW$106, DW_AT_TI_symbol_name("_GPIO51")
     979                      .dwattr $C$DW$106, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x02)
     980                      .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     981                      .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
     982              $C$DW$107       .dwtag  DW_TAG_member
     983                      .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$19)
     984                      .dwattr $C$DW$107, DW_AT_name("GPIO52")
     985                      .dwattr $C$DW$107, DW_AT_TI_symbol_name("_GPIO52")
     986                      .dwattr $C$DW$107, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x02)
     987                      .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     988                      .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
     989              $C$DW$108       .dwtag  DW_TAG_member
     990                      .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$19)
     991                      .dwattr $C$DW$108, DW_AT_name("GPIO53")
     992                      .dwattr $C$DW$108, DW_AT_TI_symbol_name("_GPIO53")
     993                      .dwattr $C$DW$108, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x02)
     994                      .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     995                      .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:22 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0614010                           PAGE   20

     996              $C$DW$109       .dwtag  DW_TAG_member
     997                      .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$19)
     998                      .dwattr $C$DW$109, DW_AT_name("GPIO54")
     999                      .dwattr $C$DW$109, DW_AT_TI_symbol_name("_GPIO54")
    1000                      .dwattr $C$DW$109, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x02)
    1001                      .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1002                      .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    1003              $C$DW$110       .dwtag  DW_TAG_member
    1004                      .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$19)
    1005                      .dwattr $C$DW$110, DW_AT_name("GPIO55")
    1006                      .dwattr $C$DW$110, DW_AT_TI_symbol_name("_GPIO55")
    1007                      .dwattr $C$DW$110, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x02)
    1008                      .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1009                      .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    1010              $C$DW$111       .dwtag  DW_TAG_member
    1011                      .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$19)
    1012                      .dwattr $C$DW$111, DW_AT_name("GPIO56")
    1013                      .dwattr $C$DW$111, DW_AT_TI_symbol_name("_GPIO56")
    1014                      .dwattr $C$DW$111, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x02)
    1015                      .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1016                      .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    1017              $C$DW$112       .dwtag  DW_TAG_member
    1018                      .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$19)
    1019                      .dwattr $C$DW$112, DW_AT_name("GPIO57")
    1020                      .dwattr $C$DW$112, DW_AT_TI_symbol_name("_GPIO57")
    1021                      .dwattr $C$DW$112, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x02)
    1022                      .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1023                      .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    1024              $C$DW$113       .dwtag  DW_TAG_member
    1025                      .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$19)
    1026                      .dwattr $C$DW$113, DW_AT_name("GPIO58")
    1027                      .dwattr $C$DW$113, DW_AT_TI_symbol_name("_GPIO58")
    1028                      .dwattr $C$DW$113, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x02)
    1029                      .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1030                      .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    1031              $C$DW$114       .dwtag  DW_TAG_member
    1032                      .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$19)
    1033                      .dwattr $C$DW$114, DW_AT_name("GPIO59")
    1034                      .dwattr $C$DW$114, DW_AT_TI_symbol_name("_GPIO59")
    1035                      .dwattr $C$DW$114, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x02)
    1036                      .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1037                      .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    1038              $C$DW$115       .dwtag  DW_TAG_member
    1039                      .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$19)
    1040                      .dwattr $C$DW$115, DW_AT_name("GPIO60")
    1041                      .dwattr $C$DW$115, DW_AT_TI_symbol_name("_GPIO60")
    1042                      .dwattr $C$DW$115, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x02)
    1043                      .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1044                      .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    1045              $C$DW$116       .dwtag  DW_TAG_member
    1046                      .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$19)
    1047                      .dwattr $C$DW$116, DW_AT_name("GPIO61")
    1048                      .dwattr $C$DW$116, DW_AT_TI_symbol_name("_GPIO61")
    1049                      .dwattr $C$DW$116, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x02)
    1050                      .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:22 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0614010                           PAGE   21

    1051                      .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    1052              $C$DW$117       .dwtag  DW_TAG_member
    1053                      .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$19)
    1054                      .dwattr $C$DW$117, DW_AT_name("GPIO62")
    1055                      .dwattr $C$DW$117, DW_AT_TI_symbol_name("_GPIO62")
    1056                      .dwattr $C$DW$117, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x02)
    1057                      .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1058                      .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    1059              $C$DW$118       .dwtag  DW_TAG_member
    1060                      .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$19)
    1061                      .dwattr $C$DW$118, DW_AT_name("GPIO63")
    1062                      .dwattr $C$DW$118, DW_AT_TI_symbol_name("_GPIO63")
    1063                      .dwattr $C$DW$118, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x02)
    1064                      .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1065                      .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    1066                      .dwendtag $C$DW$T$31
    1067              
    1068              
    1069              $C$DW$T$32      .dwtag  DW_TAG_union_type
    1070                      .dwattr $C$DW$T$32, DW_AT_name("GPB2_REG")
    1071                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x02)
    1072              $C$DW$119       .dwtag  DW_TAG_member
    1073                      .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$21)
    1074                      .dwattr $C$DW$119, DW_AT_name("all")
    1075                      .dwattr $C$DW$119, DW_AT_TI_symbol_name("_all")
    1076                      .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1077                      .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    1078              $C$DW$120       .dwtag  DW_TAG_member
    1079                      .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$31)
    1080                      .dwattr $C$DW$120, DW_AT_name("bit")
    1081                      .dwattr $C$DW$120, DW_AT_TI_symbol_name("_bit")
    1082                      .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1083                      .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    1084                      .dwendtag $C$DW$T$32
    1085              
    1086              
    1087              $C$DW$T$33      .dwtag  DW_TAG_structure_type
    1088                      .dwattr $C$DW$T$33, DW_AT_name("GPBCTRL_BITS")
    1089                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x02)
    1090              $C$DW$121       .dwtag  DW_TAG_member
    1091                      .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$19)
    1092                      .dwattr $C$DW$121, DW_AT_name("QUALPRD0")
    1093                      .dwattr $C$DW$121, DW_AT_TI_symbol_name("_QUALPRD0")
    1094                      .dwattr $C$DW$121, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x08)
    1095                      .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1096                      .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    1097              $C$DW$122       .dwtag  DW_TAG_member
    1098                      .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$19)
    1099                      .dwattr $C$DW$122, DW_AT_name("QUALPRD1")
    1100                      .dwattr $C$DW$122, DW_AT_TI_symbol_name("_QUALPRD1")
    1101                      .dwattr $C$DW$122, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x08)
    1102                      .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1103                      .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    1104              $C$DW$123       .dwtag  DW_TAG_member
    1105                      .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:22 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0614010                           PAGE   22

    1106                      .dwattr $C$DW$123, DW_AT_name("QUALPRD2")
    1107                      .dwattr $C$DW$123, DW_AT_TI_symbol_name("_QUALPRD2")
    1108                      .dwattr $C$DW$123, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x08)
    1109                      .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1110                      .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    1111              $C$DW$124       .dwtag  DW_TAG_member
    1112                      .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$19)
    1113                      .dwattr $C$DW$124, DW_AT_name("QUALPRD3")
    1114                      .dwattr $C$DW$124, DW_AT_TI_symbol_name("_QUALPRD3")
    1115                      .dwattr $C$DW$124, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x08)
    1116                      .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1117                      .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    1118                      .dwendtag $C$DW$T$33
    1119              
    1120              
    1121              $C$DW$T$34      .dwtag  DW_TAG_union_type
    1122                      .dwattr $C$DW$T$34, DW_AT_name("GPBCTRL_REG")
    1123                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x02)
    1124              $C$DW$125       .dwtag  DW_TAG_member
    1125                      .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$21)
    1126                      .dwattr $C$DW$125, DW_AT_name("all")
    1127                      .dwattr $C$DW$125, DW_AT_TI_symbol_name("_all")
    1128                      .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1129                      .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    1130              $C$DW$126       .dwtag  DW_TAG_member
    1131                      .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$33)
    1132                      .dwattr $C$DW$126, DW_AT_name("bit")
    1133                      .dwattr $C$DW$126, DW_AT_TI_symbol_name("_bit")
    1134                      .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1135                      .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    1136                      .dwendtag $C$DW$T$34
    1137              
    1138              
    1139              $C$DW$T$35      .dwtag  DW_TAG_structure_type
    1140                      .dwattr $C$DW$T$35, DW_AT_name("GPBDAT_BITS")
    1141                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x02)
    1142              $C$DW$127       .dwtag  DW_TAG_member
    1143                      .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$19)
    1144                      .dwattr $C$DW$127, DW_AT_name("GPIO32")
    1145                      .dwattr $C$DW$127, DW_AT_TI_symbol_name("_GPIO32")
    1146                      .dwattr $C$DW$127, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    1147                      .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1148                      .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    1149              $C$DW$128       .dwtag  DW_TAG_member
    1150                      .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$19)
    1151                      .dwattr $C$DW$128, DW_AT_name("GPIO33")
    1152                      .dwattr $C$DW$128, DW_AT_TI_symbol_name("_GPIO33")
    1153                      .dwattr $C$DW$128, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    1154                      .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1155                      .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    1156              $C$DW$129       .dwtag  DW_TAG_member
    1157                      .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$19)
    1158                      .dwattr $C$DW$129, DW_AT_name("GPIO34")
    1159                      .dwattr $C$DW$129, DW_AT_TI_symbol_name("_GPIO34")
    1160                      .dwattr $C$DW$129, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:22 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0614010                           PAGE   23

    1161                      .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1162                      .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    1163              $C$DW$130       .dwtag  DW_TAG_member
    1164                      .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$19)
    1165                      .dwattr $C$DW$130, DW_AT_name("GPIO35")
    1166                      .dwattr $C$DW$130, DW_AT_TI_symbol_name("_GPIO35")
    1167                      .dwattr $C$DW$130, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    1168                      .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1169                      .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    1170              $C$DW$131       .dwtag  DW_TAG_member
    1171                      .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$19)
    1172                      .dwattr $C$DW$131, DW_AT_name("GPIO36")
    1173                      .dwattr $C$DW$131, DW_AT_TI_symbol_name("_GPIO36")
    1174                      .dwattr $C$DW$131, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    1175                      .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1176                      .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    1177              $C$DW$132       .dwtag  DW_TAG_member
    1178                      .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$19)
    1179                      .dwattr $C$DW$132, DW_AT_name("GPIO37")
    1180                      .dwattr $C$DW$132, DW_AT_TI_symbol_name("_GPIO37")
    1181                      .dwattr $C$DW$132, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    1182                      .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1183                      .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    1184              $C$DW$133       .dwtag  DW_TAG_member
    1185                      .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$19)
    1186                      .dwattr $C$DW$133, DW_AT_name("GPIO38")
    1187                      .dwattr $C$DW$133, DW_AT_TI_symbol_name("_GPIO38")
    1188                      .dwattr $C$DW$133, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    1189                      .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1190                      .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    1191              $C$DW$134       .dwtag  DW_TAG_member
    1192                      .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$19)
    1193                      .dwattr $C$DW$134, DW_AT_name("GPIO39")
    1194                      .dwattr $C$DW$134, DW_AT_TI_symbol_name("_GPIO39")
    1195                      .dwattr $C$DW$134, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    1196                      .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1197                      .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    1198              $C$DW$135       .dwtag  DW_TAG_member
    1199                      .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$19)
    1200                      .dwattr $C$DW$135, DW_AT_name("GPIO40")
    1201                      .dwattr $C$DW$135, DW_AT_TI_symbol_name("_GPIO40")
    1202                      .dwattr $C$DW$135, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
    1203                      .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1204                      .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    1205              $C$DW$136       .dwtag  DW_TAG_member
    1206                      .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$19)
    1207                      .dwattr $C$DW$136, DW_AT_name("GPIO41")
    1208                      .dwattr $C$DW$136, DW_AT_TI_symbol_name("_GPIO41")
    1209                      .dwattr $C$DW$136, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    1210                      .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1211                      .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    1212              $C$DW$137       .dwtag  DW_TAG_member
    1213                      .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$19)
    1214                      .dwattr $C$DW$137, DW_AT_name("GPIO42")
    1215                      .dwattr $C$DW$137, DW_AT_TI_symbol_name("_GPIO42")
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:22 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0614010                           PAGE   24

    1216                      .dwattr $C$DW$137, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
    1217                      .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1218                      .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    1219              $C$DW$138       .dwtag  DW_TAG_member
    1220                      .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$19)
    1221                      .dwattr $C$DW$138, DW_AT_name("GPIO43")
    1222                      .dwattr $C$DW$138, DW_AT_TI_symbol_name("_GPIO43")
    1223                      .dwattr $C$DW$138, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
    1224                      .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1225                      .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    1226              $C$DW$139       .dwtag  DW_TAG_member
    1227                      .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$19)
    1228                      .dwattr $C$DW$139, DW_AT_name("GPIO44")
    1229                      .dwattr $C$DW$139, DW_AT_TI_symbol_name("_GPIO44")
    1230                      .dwattr $C$DW$139, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
    1231                      .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1232                      .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    1233              $C$DW$140       .dwtag  DW_TAG_member
    1234                      .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$19)
    1235                      .dwattr $C$DW$140, DW_AT_name("GPIO45")
    1236                      .dwattr $C$DW$140, DW_AT_TI_symbol_name("_GPIO45")
    1237                      .dwattr $C$DW$140, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
    1238                      .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1239                      .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    1240              $C$DW$141       .dwtag  DW_TAG_member
    1241                      .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$19)
    1242                      .dwattr $C$DW$141, DW_AT_name("GPIO46")
    1243                      .dwattr $C$DW$141, DW_AT_TI_symbol_name("_GPIO46")
    1244                      .dwattr $C$DW$141, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
    1245                      .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1246                      .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    1247              $C$DW$142       .dwtag  DW_TAG_member
    1248                      .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$19)
    1249                      .dwattr $C$DW$142, DW_AT_name("GPIO47")
    1250                      .dwattr $C$DW$142, DW_AT_TI_symbol_name("_GPIO47")
    1251                      .dwattr $C$DW$142, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    1252                      .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1253                      .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    1254              $C$DW$143       .dwtag  DW_TAG_member
    1255                      .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$19)
    1256                      .dwattr $C$DW$143, DW_AT_name("GPIO48")
    1257                      .dwattr $C$DW$143, DW_AT_TI_symbol_name("_GPIO48")
    1258                      .dwattr $C$DW$143, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    1259                      .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1260                      .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    1261              $C$DW$144       .dwtag  DW_TAG_member
    1262                      .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$19)
    1263                      .dwattr $C$DW$144, DW_AT_name("GPIO49")
    1264                      .dwattr $C$DW$144, DW_AT_TI_symbol_name("_GPIO49")
    1265                      .dwattr $C$DW$144, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    1266                      .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1267                      .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    1268              $C$DW$145       .dwtag  DW_TAG_member
    1269                      .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$19)
    1270                      .dwattr $C$DW$145, DW_AT_name("GPIO50")
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:22 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0614010                           PAGE   25

    1271                      .dwattr $C$DW$145, DW_AT_TI_symbol_name("_GPIO50")
    1272                      .dwattr $C$DW$145, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    1273                      .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1274                      .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    1275              $C$DW$146       .dwtag  DW_TAG_member
    1276                      .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$19)
    1277                      .dwattr $C$DW$146, DW_AT_name("GPIO51")
    1278                      .dwattr $C$DW$146, DW_AT_TI_symbol_name("_GPIO51")
    1279                      .dwattr $C$DW$146, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    1280                      .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1281                      .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
    1282              $C$DW$147       .dwtag  DW_TAG_member
    1283                      .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$19)
    1284                      .dwattr $C$DW$147, DW_AT_name("GPIO52")
    1285                      .dwattr $C$DW$147, DW_AT_TI_symbol_name("_GPIO52")
    1286                      .dwattr $C$DW$147, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    1287                      .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1288                      .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
    1289              $C$DW$148       .dwtag  DW_TAG_member
    1290                      .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$19)
    1291                      .dwattr $C$DW$148, DW_AT_name("GPIO53")
    1292                      .dwattr $C$DW$148, DW_AT_TI_symbol_name("_GPIO53")
    1293                      .dwattr $C$DW$148, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    1294                      .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1295                      .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    1296              $C$DW$149       .dwtag  DW_TAG_member
    1297                      .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$19)
    1298                      .dwattr $C$DW$149, DW_AT_name("GPIO54")
    1299                      .dwattr $C$DW$149, DW_AT_TI_symbol_name("_GPIO54")
    1300                      .dwattr $C$DW$149, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    1301                      .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1302                      .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    1303              $C$DW$150       .dwtag  DW_TAG_member
    1304                      .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$19)
    1305                      .dwattr $C$DW$150, DW_AT_name("GPIO55")
    1306                      .dwattr $C$DW$150, DW_AT_TI_symbol_name("_GPIO55")
    1307                      .dwattr $C$DW$150, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    1308                      .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1309                      .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
    1310              $C$DW$151       .dwtag  DW_TAG_member
    1311                      .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$19)
    1312                      .dwattr $C$DW$151, DW_AT_name("GPIO56")
    1313                      .dwattr $C$DW$151, DW_AT_TI_symbol_name("_GPIO56")
    1314                      .dwattr $C$DW$151, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
    1315                      .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1316                      .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    1317              $C$DW$152       .dwtag  DW_TAG_member
    1318                      .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$19)
    1319                      .dwattr $C$DW$152, DW_AT_name("GPIO57")
    1320                      .dwattr $C$DW$152, DW_AT_TI_symbol_name("_GPIO57")
    1321                      .dwattr $C$DW$152, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    1322                      .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1323                      .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    1324              $C$DW$153       .dwtag  DW_TAG_member
    1325                      .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:22 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0614010                           PAGE   26

    1326                      .dwattr $C$DW$153, DW_AT_name("GPIO58")
    1327                      .dwattr $C$DW$153, DW_AT_TI_symbol_name("_GPIO58")
    1328                      .dwattr $C$DW$153, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
    1329                      .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1330                      .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    1331              $C$DW$154       .dwtag  DW_TAG_member
    1332                      .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$19)
    1333                      .dwattr $C$DW$154, DW_AT_name("GPIO59")
    1334                      .dwattr $C$DW$154, DW_AT_TI_symbol_name("_GPIO59")
    1335                      .dwattr $C$DW$154, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
    1336                      .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1337                      .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
    1338              $C$DW$155       .dwtag  DW_TAG_member
    1339                      .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$19)
    1340                      .dwattr $C$DW$155, DW_AT_name("GPIO60")
    1341                      .dwattr $C$DW$155, DW_AT_TI_symbol_name("_GPIO60")
    1342                      .dwattr $C$DW$155, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
    1343                      .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1344                      .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
    1345              $C$DW$156       .dwtag  DW_TAG_member
    1346                      .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$19)
    1347                      .dwattr $C$DW$156, DW_AT_name("GPIO61")
    1348                      .dwattr $C$DW$156, DW_AT_TI_symbol_name("_GPIO61")
    1349                      .dwattr $C$DW$156, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
    1350                      .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1351                      .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    1352              $C$DW$157       .dwtag  DW_TAG_member
    1353                      .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$19)
    1354                      .dwattr $C$DW$157, DW_AT_name("GPIO62")
    1355                      .dwattr $C$DW$157, DW_AT_TI_symbol_name("_GPIO62")
    1356                      .dwattr $C$DW$157, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
    1357                      .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1358                      .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    1359              $C$DW$158       .dwtag  DW_TAG_member
    1360                      .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$19)
    1361                      .dwattr $C$DW$158, DW_AT_name("GPIO63")
    1362                      .dwattr $C$DW$158, DW_AT_TI_symbol_name("_GPIO63")
    1363                      .dwattr $C$DW$158, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    1364                      .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1365                      .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    1366                      .dwendtag $C$DW$T$35
    1367              
    1368              
    1369              $C$DW$T$36      .dwtag  DW_TAG_union_type
    1370                      .dwattr $C$DW$T$36, DW_AT_name("GPBDAT_REG")
    1371                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x02)
    1372              $C$DW$159       .dwtag  DW_TAG_member
    1373                      .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$21)
    1374                      .dwattr $C$DW$159, DW_AT_name("all")
    1375                      .dwattr $C$DW$159, DW_AT_TI_symbol_name("_all")
    1376                      .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1377                      .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    1378              $C$DW$160       .dwtag  DW_TAG_member
    1379                      .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$35)
    1380                      .dwattr $C$DW$160, DW_AT_name("bit")
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:22 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0614010                           PAGE   27

    1381                      .dwattr $C$DW$160, DW_AT_TI_symbol_name("_bit")
    1382                      .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1383                      .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    1384                      .dwendtag $C$DW$T$36
    1385              
    1386              
    1387              $C$DW$T$37      .dwtag  DW_TAG_structure_type
    1388                      .dwattr $C$DW$T$37, DW_AT_name("GPC1_BITS")
    1389                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x02)
    1390              $C$DW$161       .dwtag  DW_TAG_member
    1391                      .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$19)
