/**********************************************************

преобразование сообщений при приеме и передаче

**********************************************************/

#ifndef __MESSAGE__
#define __MESSAGE__

char Bin ( char );

char ASCII ( char );

/*************************************************
преобразование принятой в ASCII строки в двоичную 
in-указатель на начало принятой строки
out-указатель на строку результата
возвращается длинна преобразованной строки
0 при ошибки преобразования
*************************************************/
char ConvertString ( char *in, char cntByte, char *out);

/*********************************************************
преобразование сообщения в строку символов
in, out - входное сообщение и результат преобразования
lenth - длинна входного сообщения
**********************************************************/
char ConvertMessag ( char*, char*, char );

/**********************************************************
вычисление CRC сообщения.
начало - str,
длинна - lenth
возвращает char LRC
**********************************************************/

char LRC ( char*, char );

#endif
