TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:38 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0504010                           PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v6.2.7 *
       3              ;* Date/Time created: Thu Jul 02 08:31:38 2015                 *
       4              ;***************************************************************
       5                      .compiler_opts --diag_wrap=off --float_support=fpu32 --hll_source=on --mem_model:code=flat --mem_mode
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("../AdcCntrl/AdcCntrl.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v6.2.7 Copyright (c) 1996-2014 Texas I
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("D:\ActiveProject\EKT5\PKMT_NONBIOS\InvertorCntrl\ISPprg")
      13                      .global _cntIntgrADC
      14 00000000       _cntIntgrADC:   .usect  ".ebss",1,1,0
      15              $C$DW$1 .dwtag  DW_TAG_variable, DW_AT_name("cntIntgrADC")
      16                      .dwattr $C$DW$1, DW_AT_TI_symbol_name("_cntIntgrADC")

     728                      .dwattr $C$DW$31, DW_AT_type(*$C$DW$T$106)
     729                      .dwattr $C$DW$31, DW_AT_location[DW_OP_breg20 -1]
     730              $C$DW$32        .dwtag  DW_TAG_variable, DW_AT_name("val")
     731                      .dwattr $C$DW$32, DW_AT_TI_symbol_name("_val")
     732                      .dwattr $C$DW$32, DW_AT_type(*$C$DW$T$104)
     733                      .dwattr $C$DW$32, DW_AT_location[DW_OP_breg20 -2]
     734              $C$DW$33        .dwtag  DW_TAG_variable, DW_AT_name("tmp")
     735                      .dwattr $C$DW$33, DW_AT_TI_symbol_name("_tmp")
     736                      .dwattr $C$DW$33, DW_AT_type(*$C$DW$T$112)
     737                      .dwattr $C$DW$33, DW_AT_location[DW_OP_breg20 -4]
     738 000000ec 9641          MOV       *-SP[1],AL            ; [CPU_] |218| 
     739                      .dwpsn  file "../AdcCntrl/AdcCntrl.c",line 221,column 2,is_stmt
     740 000000ed 0200          MOVB      ACC,#0                ; [CPU_] |221| 
     741 000000ee 1E44          MOVL      *-SP[4],ACC           ; [CPU_] |221| 
     742                      .dwpsn  file "../AdcCntrl/AdcCntrl.c",line 222,column 2,is_stmt
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:38 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0504010                           PAGE   16

     743 000000ef 56BF          MOVB      *-SP[2],#127,UNC      ; [CPU_] |222| 
         000000f0 7F42 
     744 000000f1       $C$L11:    
     745                      .dwpsn  file "../AdcCntrl/AdcCntrl.c",line 224,column 3,is_stmt
     746 000000f1 8842          MOVZ      AR6,*-SP[2]           ; [CPU_] |224| 
     747 000000f2 0E41          MOVU      ACC,*-SP[1]           ; [CPU_] |224| 
     748 000000f3 8F00-         MOVL      XAR4,#_adcIntegrSumm  ; [CPU_U] |224| 
         000000f4 0040 
     749 000000f5 0B42          DEC       *-SP[2]               ; [CPU_] |224| 
     750 000000f6 FF37          LSL       ACC,8                 ; [CPU_] |224| 
     751 000000f7 5601          ADDL      XAR4,ACC              ; [CPU_] |224| 
         000000f8 00A4 
     752 000000f9 0EA6          MOVU      ACC,AR6               ; [CPU_] |224| 
     753 000000fa FF30          LSL       ACC,1                 ; [CPU_] |224| 
     754 000000fb 5601          ADDL      XAR4,ACC              ; [CPU_] |224| 
         000000fc 00A4 
     755 000000fd 06C4          MOVL      ACC,*+XAR4[0]         ; [CPU_] |224| 
     756 000000fe 0744          ADDL      ACC,*-SP[4]           ; [CPU_] |224| 
     757 000000ff 1E44          MOVL      *-SP[4],ACC           ; [CPU_] |224| 
     758                      .dwpsn  file "../AdcCntrl/AdcCntrl.c",line 225,column 2,is_stmt
     759 00000100 9242          MOV       AL,*-SP[2]            ; [CPU_] |225| 
     760 00000101 EDF0          BF        $C$L11,NEQ            ; [CPU_] |225| 
     761                      ; branchcc occurs ; [] |225| 
     762                      .dwpsn  file "../AdcCntrl/AdcCntrl.c",line 226,column 2,is_stmt
     763 00000102 0644          MOVL      ACC,*-SP[4]           ; [CPU_] |226| 
     764 00000103 2901          CLRC      SXM                   ; [CPU_] 
     765 00000104 FF46          SFR       ACC,7                 ; [CPU_] |226| 
     766 00000105 1E44          MOVL      *-SP[4],ACC           ; [CPU_] |226| 
     767                      .dwpsn  file "../AdcCntrl/AdcCntrl.c",line 227,column 2,is_stmt
     768 00000106 9244          MOV       AL,*-SP[4]            ; [CPU_] |227| 
     769                      .dwpsn  file "../AdcCntrl/AdcCntrl.c",line 228,column 1,is_stmt
     770 00000107 FE84          SUBB      SP,#4                 ; [CPU_U] 
     771                      .dwcfi  cfa_offset, -2
     772              $C$DW$34        .dwtag  DW_TAG_TI_branch
     773                      .dwattr $C$DW$34, DW_AT_low_pc(0x00)
     774                      .dwattr $C$DW$34, DW_AT_TI_return
     775 00000108 0006          LRETR     ; [CPU_] 
     776                      ; return occurs ; [] 
     777                      .dwattr $C$DW$29, DW_AT_TI_end_file("../AdcCntrl/AdcCntrl.c")
     778                      .dwattr $C$DW$29, DW_AT_TI_end_line(0xe4)
     779                      .dwattr $C$DW$29, DW_AT_TI_end_column(0x01)
     780                      .dwendentry
     781                      .dwendtag $C$DW$29
     782              
     783              ;**************************************************************
     784              ;* UNDEFINED EXTERNAL REFERENCES                              *
     785              ;**************************************************************
     786                      .global _PieCtrlRegs
     787                      .global _AdcRegs
     788                      .global _SysCtrlRegs
     789                      .global _PieVectTable
     790              
     791              ;***************************************************************
     792              ;* TYPE INFORMATION                                            *
     793              ;***************************************************************
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:38 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0504010                           PAGE   17

     794              
     795              $C$DW$T$20      .dwtag  DW_TAG_structure_type
     796                      .dwattr $C$DW$T$20, DW_AT_name("ADCASEQSR_BITS")
     797                      .dwattr $C$DW$T$20, DW_AT_byte_size(0x01)
     798              $C$DW$35        .dwtag  DW_TAG_member
     799                      .dwattr $C$DW$35, DW_AT_type(*$C$DW$T$19)
     800                      .dwattr $C$DW$35, DW_AT_name("SEQ1_STATE")
     801                      .dwattr $C$DW$35, DW_AT_TI_symbol_name("_SEQ1_STATE")
     802                      .dwattr $C$DW$35, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x04)
     803                      .dwattr $C$DW$35, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     804                      .dwattr $C$DW$35, DW_AT_accessibility(DW_ACCESS_public)
     805              $C$DW$36        .dwtag  DW_TAG_member
     806                      .dwattr $C$DW$36, DW_AT_type(*$C$DW$T$19)
     807                      .dwattr $C$DW$36, DW_AT_name("SEQ2_STATE")
     808                      .dwattr $C$DW$36, DW_AT_TI_symbol_name("_SEQ2_STATE")
     809                      .dwattr $C$DW$36, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x03)
     810                      .dwattr $C$DW$36, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     811                      .dwattr $C$DW$36, DW_AT_accessibility(DW_ACCESS_public)
     812              $C$DW$37        .dwtag  DW_TAG_member
     813                      .dwattr $C$DW$37, DW_AT_type(*$C$DW$T$19)
     814                      .dwattr $C$DW$37, DW_AT_name("rsvd1")
     815                      .dwattr $C$DW$37, DW_AT_TI_symbol_name("_rsvd1")
     816                      .dwattr $C$DW$37, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
     817                      .dwattr $C$DW$37, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     818                      .dwattr $C$DW$37, DW_AT_accessibility(DW_ACCESS_public)
     819              $C$DW$38        .dwtag  DW_TAG_member
     820                      .dwattr $C$DW$38, DW_AT_type(*$C$DW$T$19)
     821                      .dwattr $C$DW$38, DW_AT_name("SEQ_CNTR")
     822                      .dwattr $C$DW$38, DW_AT_TI_symbol_name("_SEQ_CNTR")
     823                      .dwattr $C$DW$38, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x04)
     824                      .dwattr $C$DW$38, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     825                      .dwattr $C$DW$38, DW_AT_accessibility(DW_ACCESS_public)
     826              $C$DW$39        .dwtag  DW_TAG_member
     827                      .dwattr $C$DW$39, DW_AT_type(*$C$DW$T$19)
     828                      .dwattr $C$DW$39, DW_AT_name("rsvd2")
     829                      .dwattr $C$DW$39, DW_AT_TI_symbol_name("_rsvd2")
     830                      .dwattr $C$DW$39, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x04)
     831                      .dwattr $C$DW$39, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     832                      .dwattr $C$DW$39, DW_AT_accessibility(DW_ACCESS_public)
     833                      .dwendtag $C$DW$T$20
     834              
     835              
     836              $C$DW$T$21      .dwtag  DW_TAG_union_type
     837                      .dwattr $C$DW$T$21, DW_AT_name("ADCASEQSR_REG")
     838                      .dwattr $C$DW$T$21, DW_AT_byte_size(0x01)
     839              $C$DW$40        .dwtag  DW_TAG_member
     840                      .dwattr $C$DW$40, DW_AT_type(*$C$DW$T$19)
     841                      .dwattr $C$DW$40, DW_AT_name("all")
     842                      .dwattr $C$DW$40, DW_AT_TI_symbol_name("_all")
     843                      .dwattr $C$DW$40, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     844                      .dwattr $C$DW$40, DW_AT_accessibility(DW_ACCESS_public)
     845              $C$DW$41        .dwtag  DW_TAG_member
     846                      .dwattr $C$DW$41, DW_AT_type(*$C$DW$T$20)
     847                      .dwattr $C$DW$41, DW_AT_name("bit")
     848                      .dwattr $C$DW$41, DW_AT_TI_symbol_name("_bit")
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:38 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0504010                           PAGE   18

     849                      .dwattr $C$DW$41, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     850                      .dwattr $C$DW$41, DW_AT_accessibility(DW_ACCESS_public)
     851                      .dwendtag $C$DW$T$21
     852              
     853              
     854              $C$DW$T$22      .dwtag  DW_TAG_structure_type
     855                      .dwattr $C$DW$T$22, DW_AT_name("ADCCHSELSEQ1_BITS")
     856                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x01)
     857              $C$DW$42        .dwtag  DW_TAG_member
     858                      .dwattr $C$DW$42, DW_AT_type(*$C$DW$T$19)
     859                      .dwattr $C$DW$42, DW_AT_name("CONV00")
     860                      .dwattr $C$DW$42, DW_AT_TI_symbol_name("_CONV00")
     861                      .dwattr $C$DW$42, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x04)
     862                      .dwattr $C$DW$42, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     863                      .dwattr $C$DW$42, DW_AT_accessibility(DW_ACCESS_public)
     864              $C$DW$43        .dwtag  DW_TAG_member
     865                      .dwattr $C$DW$43, DW_AT_type(*$C$DW$T$19)
     866                      .dwattr $C$DW$43, DW_AT_name("CONV01")
     867                      .dwattr $C$DW$43, DW_AT_TI_symbol_name("_CONV01")
     868                      .dwattr $C$DW$43, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x04)
     869                      .dwattr $C$DW$43, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     870                      .dwattr $C$DW$43, DW_AT_accessibility(DW_ACCESS_public)
     871              $C$DW$44        .dwtag  DW_TAG_member
     872                      .dwattr $C$DW$44, DW_AT_type(*$C$DW$T$19)
     873                      .dwattr $C$DW$44, DW_AT_name("CONV02")
     874                      .dwattr $C$DW$44, DW_AT_TI_symbol_name("_CONV02")
     875                      .dwattr $C$DW$44, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x04)
     876                      .dwattr $C$DW$44, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     877                      .dwattr $C$DW$44, DW_AT_accessibility(DW_ACCESS_public)
     878              $C$DW$45        .dwtag  DW_TAG_member
     879                      .dwattr $C$DW$45, DW_AT_type(*$C$DW$T$19)
     880                      .dwattr $C$DW$45, DW_AT_name("CONV03")
     881                      .dwattr $C$DW$45, DW_AT_TI_symbol_name("_CONV03")
     882                      .dwattr $C$DW$45, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x04)
     883                      .dwattr $C$DW$45, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     884                      .dwattr $C$DW$45, DW_AT_accessibility(DW_ACCESS_public)
     885                      .dwendtag $C$DW$T$22
     886              
     887              
     888              $C$DW$T$23      .dwtag  DW_TAG_union_type
     889                      .dwattr $C$DW$T$23, DW_AT_name("ADCCHSELSEQ1_REG")
     890                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x01)
     891              $C$DW$46        .dwtag  DW_TAG_member
     892                      .dwattr $C$DW$46, DW_AT_type(*$C$DW$T$19)
     893                      .dwattr $C$DW$46, DW_AT_name("all")
     894                      .dwattr $C$DW$46, DW_AT_TI_symbol_name("_all")
     895                      .dwattr $C$DW$46, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     896                      .dwattr $C$DW$46, DW_AT_accessibility(DW_ACCESS_public)
     897              $C$DW$47        .dwtag  DW_TAG_member
     898                      .dwattr $C$DW$47, DW_AT_type(*$C$DW$T$22)
     899                      .dwattr $C$DW$47, DW_AT_name("bit")
     900                      .dwattr $C$DW$47, DW_AT_TI_symbol_name("_bit")
     901                      .dwattr $C$DW$47, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     902                      .dwattr $C$DW$47, DW_AT_accessibility(DW_ACCESS_public)
     903                      .dwendtag $C$DW$T$23
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:38 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0504010                           PAGE   19

     904              
     905              
     906              $C$DW$T$24      .dwtag  DW_TAG_structure_type
     907                      .dwattr $C$DW$T$24, DW_AT_name("ADCCHSELSEQ2_BITS")
     908                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x01)
     909              $C$DW$48        .dwtag  DW_TAG_member
     910                      .dwattr $C$DW$48, DW_AT_type(*$C$DW$T$19)
     911                      .dwattr $C$DW$48, DW_AT_name("CONV04")
     912                      .dwattr $C$DW$48, DW_AT_TI_symbol_name("_CONV04")
     913                      .dwattr $C$DW$48, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x04)
     914                      .dwattr $C$DW$48, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     915                      .dwattr $C$DW$48, DW_AT_accessibility(DW_ACCESS_public)
     916              $C$DW$49        .dwtag  DW_TAG_member
     917                      .dwattr $C$DW$49, DW_AT_type(*$C$DW$T$19)
     918                      .dwattr $C$DW$49, DW_AT_name("CONV05")
     919                      .dwattr $C$DW$49, DW_AT_TI_symbol_name("_CONV05")
     920                      .dwattr $C$DW$49, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x04)
     921                      .dwattr $C$DW$49, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     922                      .dwattr $C$DW$49, DW_AT_accessibility(DW_ACCESS_public)
     923              $C$DW$50        .dwtag  DW_TAG_member
     924                      .dwattr $C$DW$50, DW_AT_type(*$C$DW$T$19)
     925                      .dwattr $C$DW$50, DW_AT_name("CONV06")
     926                      .dwattr $C$DW$50, DW_AT_TI_symbol_name("_CONV06")
     927                      .dwattr $C$DW$50, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x04)
     928                      .dwattr $C$DW$50, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     929                      .dwattr $C$DW$50, DW_AT_accessibility(DW_ACCESS_public)
     930              $C$DW$51        .dwtag  DW_TAG_member
     931                      .dwattr $C$DW$51, DW_AT_type(*$C$DW$T$19)
     932                      .dwattr $C$DW$51, DW_AT_name("CONV07")
     933                      .dwattr $C$DW$51, DW_AT_TI_symbol_name("_CONV07")
     934                      .dwattr $C$DW$51, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x04)
     935                      .dwattr $C$DW$51, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     936                      .dwattr $C$DW$51, DW_AT_accessibility(DW_ACCESS_public)
     937                      .dwendtag $C$DW$T$24
     938              
     939              
     940              $C$DW$T$25      .dwtag  DW_TAG_union_type
     941                      .dwattr $C$DW$T$25, DW_AT_name("ADCCHSELSEQ2_REG")
     942                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x01)
     943              $C$DW$52        .dwtag  DW_TAG_member
     944                      .dwattr $C$DW$52, DW_AT_type(*$C$DW$T$19)
     945                      .dwattr $C$DW$52, DW_AT_name("all")
     946                      .dwattr $C$DW$52, DW_AT_TI_symbol_name("_all")
     947                      .dwattr $C$DW$52, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     948                      .dwattr $C$DW$52, DW_AT_accessibility(DW_ACCESS_public)
     949              $C$DW$53        .dwtag  DW_TAG_member
     950                      .dwattr $C$DW$53, DW_AT_type(*$C$DW$T$24)
     951                      .dwattr $C$DW$53, DW_AT_name("bit")
     952                      .dwattr $C$DW$53, DW_AT_TI_symbol_name("_bit")
     953                      .dwattr $C$DW$53, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     954                      .dwattr $C$DW$53, DW_AT_accessibility(DW_ACCESS_public)
     955                      .dwendtag $C$DW$T$25
     956              
     957              
     958              $C$DW$T$26      .dwtag  DW_TAG_structure_type
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:38 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0504010                           PAGE   20

     959                      .dwattr $C$DW$T$26, DW_AT_name("ADCCHSELSEQ3_BITS")
     960                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x01)
     961              $C$DW$54        .dwtag  DW_TAG_member
     962                      .dwattr $C$DW$54, DW_AT_type(*$C$DW$T$19)
     963                      .dwattr $C$DW$54, DW_AT_name("CONV08")
     964                      .dwattr $C$DW$54, DW_AT_TI_symbol_name("_CONV08")
     965                      .dwattr $C$DW$54, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x04)
     966                      .dwattr $C$DW$54, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     967                      .dwattr $C$DW$54, DW_AT_accessibility(DW_ACCESS_public)
     968              $C$DW$55        .dwtag  DW_TAG_member
     969                      .dwattr $C$DW$55, DW_AT_type(*$C$DW$T$19)
     970                      .dwattr $C$DW$55, DW_AT_name("CONV09")
     971                      .dwattr $C$DW$55, DW_AT_TI_symbol_name("_CONV09")
     972                      .dwattr $C$DW$55, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x04)
     973                      .dwattr $C$DW$55, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     974                      .dwattr $C$DW$55, DW_AT_accessibility(DW_ACCESS_public)
     975              $C$DW$56        .dwtag  DW_TAG_member
     976                      .dwattr $C$DW$56, DW_AT_type(*$C$DW$T$19)
     977                      .dwattr $C$DW$56, DW_AT_name("CONV10")
     978                      .dwattr $C$DW$56, DW_AT_TI_symbol_name("_CONV10")
     979                      .dwattr $C$DW$56, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x04)
     980                      .dwattr $C$DW$56, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     981                      .dwattr $C$DW$56, DW_AT_accessibility(DW_ACCESS_public)
     982              $C$DW$57        .dwtag  DW_TAG_member
     983                      .dwattr $C$DW$57, DW_AT_type(*$C$DW$T$19)
     984                      .dwattr $C$DW$57, DW_AT_name("CONV11")
     985                      .dwattr $C$DW$57, DW_AT_TI_symbol_name("_CONV11")
     986                      .dwattr $C$DW$57, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x04)
     987                      .dwattr $C$DW$57, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     988                      .dwattr $C$DW$57, DW_AT_accessibility(DW_ACCESS_public)
     989                      .dwendtag $C$DW$T$26
     990              
     991              
     992              $C$DW$T$27      .dwtag  DW_TAG_union_type
     993                      .dwattr $C$DW$T$27, DW_AT_name("ADCCHSELSEQ3_REG")
     994                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x01)
     995              $C$DW$58        .dwtag  DW_TAG_member
     996                      .dwattr $C$DW$58, DW_AT_type(*$C$DW$T$19)
     997                      .dwattr $C$DW$58, DW_AT_name("all")
     998                      .dwattr $C$DW$58, DW_AT_TI_symbol_name("_all")
     999                      .dwattr $C$DW$58, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1000                      .dwattr $C$DW$58, DW_AT_accessibility(DW_ACCESS_public)
    1001              $C$DW$59        .dwtag  DW_TAG_member
    1002                      .dwattr $C$DW$59, DW_AT_type(*$C$DW$T$26)
    1003                      .dwattr $C$DW$59, DW_AT_name("bit")
    1004                      .dwattr $C$DW$59, DW_AT_TI_symbol_name("_bit")
    1005                      .dwattr $C$DW$59, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1006                      .dwattr $C$DW$59, DW_AT_accessibility(DW_ACCESS_public)
    1007                      .dwendtag $C$DW$T$27
    1008              
    1009              
    1010              $C$DW$T$28      .dwtag  DW_TAG_structure_type
    1011                      .dwattr $C$DW$T$28, DW_AT_name("ADCCHSELSEQ4_BITS")
    1012                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x01)
    1013              $C$DW$60        .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:38 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0504010                           PAGE   21

    1014                      .dwattr $C$DW$60, DW_AT_type(*$C$DW$T$19)
    1015                      .dwattr $C$DW$60, DW_AT_name("CONV12")
    1016                      .dwattr $C$DW$60, DW_AT_TI_symbol_name("_CONV12")
    1017                      .dwattr $C$DW$60, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x04)
    1018                      .dwattr $C$DW$60, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1019                      .dwattr $C$DW$60, DW_AT_accessibility(DW_ACCESS_public)
    1020              $C$DW$61        .dwtag  DW_TAG_member
    1021                      .dwattr $C$DW$61, DW_AT_type(*$C$DW$T$19)
    1022                      .dwattr $C$DW$61, DW_AT_name("CONV13")
    1023                      .dwattr $C$DW$61, DW_AT_TI_symbol_name("_CONV13")
    1024                      .dwattr $C$DW$61, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x04)
    1025                      .dwattr $C$DW$61, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1026                      .dwattr $C$DW$61, DW_AT_accessibility(DW_ACCESS_public)
    1027              $C$DW$62        .dwtag  DW_TAG_member
    1028                      .dwattr $C$DW$62, DW_AT_type(*$C$DW$T$19)
    1029                      .dwattr $C$DW$62, DW_AT_name("CONV14")
    1030                      .dwattr $C$DW$62, DW_AT_TI_symbol_name("_CONV14")
    1031                      .dwattr $C$DW$62, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x04)
    1032                      .dwattr $C$DW$62, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1033                      .dwattr $C$DW$62, DW_AT_accessibility(DW_ACCESS_public)
    1034              $C$DW$63        .dwtag  DW_TAG_member
    1035                      .dwattr $C$DW$63, DW_AT_type(*$C$DW$T$19)
    1036                      .dwattr $C$DW$63, DW_AT_name("CONV15")
    1037                      .dwattr $C$DW$63, DW_AT_TI_symbol_name("_CONV15")
    1038                      .dwattr $C$DW$63, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x04)
    1039                      .dwattr $C$DW$63, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1040                      .dwattr $C$DW$63, DW_AT_accessibility(DW_ACCESS_public)
    1041                      .dwendtag $C$DW$T$28
    1042              
    1043              
    1044              $C$DW$T$29      .dwtag  DW_TAG_union_type
    1045                      .dwattr $C$DW$T$29, DW_AT_name("ADCCHSELSEQ4_REG")
    1046                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x01)
    1047              $C$DW$64        .dwtag  DW_TAG_member
    1048                      .dwattr $C$DW$64, DW_AT_type(*$C$DW$T$19)
    1049                      .dwattr $C$DW$64, DW_AT_name("all")
    1050                      .dwattr $C$DW$64, DW_AT_TI_symbol_name("_all")
    1051                      .dwattr $C$DW$64, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1052                      .dwattr $C$DW$64, DW_AT_accessibility(DW_ACCESS_public)
    1053              $C$DW$65        .dwtag  DW_TAG_member
    1054                      .dwattr $C$DW$65, DW_AT_type(*$C$DW$T$28)
    1055                      .dwattr $C$DW$65, DW_AT_name("bit")
    1056                      .dwattr $C$DW$65, DW_AT_TI_symbol_name("_bit")
    1057                      .dwattr $C$DW$65, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1058                      .dwattr $C$DW$65, DW_AT_accessibility(DW_ACCESS_public)
    1059                      .dwendtag $C$DW$T$29
    1060              
    1061              
    1062              $C$DW$T$30      .dwtag  DW_TAG_structure_type
    1063                      .dwattr $C$DW$T$30, DW_AT_name("ADCMAXCONV_BITS")
    1064                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x01)
    1065              $C$DW$66        .dwtag  DW_TAG_member
    1066                      .dwattr $C$DW$66, DW_AT_type(*$C$DW$T$19)
    1067                      .dwattr $C$DW$66, DW_AT_name("MAX_CONV1")
    1068                      .dwattr $C$DW$66, DW_AT_TI_symbol_name("_MAX_CONV1")
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:38 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0504010                           PAGE   22

    1069                      .dwattr $C$DW$66, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x04)
    1070                      .dwattr $C$DW$66, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1071                      .dwattr $C$DW$66, DW_AT_accessibility(DW_ACCESS_public)
    1072              $C$DW$67        .dwtag  DW_TAG_member
    1073                      .dwattr $C$DW$67, DW_AT_type(*$C$DW$T$19)
    1074                      .dwattr $C$DW$67, DW_AT_name("MAX_CONV2")
    1075                      .dwattr $C$DW$67, DW_AT_TI_symbol_name("_MAX_CONV2")
    1076                      .dwattr $C$DW$67, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x03)
    1077                      .dwattr $C$DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1078                      .dwattr $C$DW$67, DW_AT_accessibility(DW_ACCESS_public)
    1079              $C$DW$68        .dwtag  DW_TAG_member
    1080                      .dwattr $C$DW$68, DW_AT_type(*$C$DW$T$19)
    1081                      .dwattr $C$DW$68, DW_AT_name("rsvd1")
    1082                      .dwattr $C$DW$68, DW_AT_TI_symbol_name("_rsvd1")
    1083                      .dwattr $C$DW$68, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x09)
    1084                      .dwattr $C$DW$68, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1085                      .dwattr $C$DW$68, DW_AT_accessibility(DW_ACCESS_public)
    1086                      .dwendtag $C$DW$T$30
    1087              
    1088              
    1089              $C$DW$T$31      .dwtag  DW_TAG_union_type
    1090                      .dwattr $C$DW$T$31, DW_AT_name("ADCMAXCONV_REG")
    1091                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x01)
    1092              $C$DW$69        .dwtag  DW_TAG_member
    1093                      .dwattr $C$DW$69, DW_AT_type(*$C$DW$T$19)
    1094                      .dwattr $C$DW$69, DW_AT_name("all")
    1095                      .dwattr $C$DW$69, DW_AT_TI_symbol_name("_all")
    1096                      .dwattr $C$DW$69, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1097                      .dwattr $C$DW$69, DW_AT_accessibility(DW_ACCESS_public)
    1098              $C$DW$70        .dwtag  DW_TAG_member
    1099                      .dwattr $C$DW$70, DW_AT_type(*$C$DW$T$30)
    1100                      .dwattr $C$DW$70, DW_AT_name("bit")
    1101                      .dwattr $C$DW$70, DW_AT_TI_symbol_name("_bit")
    1102                      .dwattr $C$DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1103                      .dwattr $C$DW$70, DW_AT_accessibility(DW_ACCESS_public)
    1104                      .dwendtag $C$DW$T$31
    1105              
    1106              
    1107              $C$DW$T$33      .dwtag  DW_TAG_structure_type
    1108                      .dwattr $C$DW$T$33, DW_AT_name("ADCOFFTRIM_BITS")
    1109                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x01)
    1110              $C$DW$71        .dwtag  DW_TAG_member
    1111                      .dwattr $C$DW$71, DW_AT_type(*$C$DW$T$32)
    1112                      .dwattr $C$DW$71, DW_AT_name("OFFSET_TRIM")
    1113                      .dwattr $C$DW$71, DW_AT_TI_symbol_name("_OFFSET_TRIM")
    1114                      .dwattr $C$DW$71, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x09)
    1115                      .dwattr $C$DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1116                      .dwattr $C$DW$71, DW_AT_accessibility(DW_ACCESS_public)
    1117              $C$DW$72        .dwtag  DW_TAG_member
    1118                      .dwattr $C$DW$72, DW_AT_type(*$C$DW$T$19)
    1119                      .dwattr $C$DW$72, DW_AT_name("rsvd1")
    1120                      .dwattr $C$DW$72, DW_AT_TI_symbol_name("_rsvd1")
    1121                      .dwattr $C$DW$72, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x07)
    1122                      .dwattr $C$DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1123                      .dwattr $C$DW$72, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:38 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0504010                           PAGE   23

    1124                      .dwendtag $C$DW$T$33
    1125              
    1126              
    1127              $C$DW$T$34      .dwtag  DW_TAG_union_type
    1128                      .dwattr $C$DW$T$34, DW_AT_name("ADCOFFTRIM_REG")
    1129                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x01)
    1130              $C$DW$73        .dwtag  DW_TAG_member
    1131                      .dwattr $C$DW$73, DW_AT_type(*$C$DW$T$19)
    1132                      .dwattr $C$DW$73, DW_AT_name("all")
    1133                      .dwattr $C$DW$73, DW_AT_TI_symbol_name("_all")
    1134                      .dwattr $C$DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1135                      .dwattr $C$DW$73, DW_AT_accessibility(DW_ACCESS_public)
    1136              $C$DW$74        .dwtag  DW_TAG_member
    1137                      .dwattr $C$DW$74, DW_AT_type(*$C$DW$T$33)
    1138                      .dwattr $C$DW$74, DW_AT_name("bit")
    1139                      .dwattr $C$DW$74, DW_AT_TI_symbol_name("_bit")
    1140                      .dwattr $C$DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1141                      .dwattr $C$DW$74, DW_AT_accessibility(DW_ACCESS_public)
    1142                      .dwendtag $C$DW$T$34
    1143              
    1144              
    1145              $C$DW$T$35      .dwtag  DW_TAG_structure_type
    1146                      .dwattr $C$DW$T$35, DW_AT_name("ADCREFSEL_BITS")
    1147                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x01)
    1148              $C$DW$75        .dwtag  DW_TAG_member
    1149                      .dwattr $C$DW$75, DW_AT_type(*$C$DW$T$19)
    1150                      .dwattr $C$DW$75, DW_AT_name("rsvd1")
    1151                      .dwattr $C$DW$75, DW_AT_TI_symbol_name("_rsvd1")
    1152                      .dwattr $C$DW$75, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x0e)
    1153                      .dwattr $C$DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1154                      .dwattr $C$DW$75, DW_AT_accessibility(DW_ACCESS_public)
    1155              $C$DW$76        .dwtag  DW_TAG_member
    1156                      .dwattr $C$DW$76, DW_AT_type(*$C$DW$T$19)
    1157                      .dwattr $C$DW$76, DW_AT_name("REF_SEL")
    1158                      .dwattr $C$DW$76, DW_AT_TI_symbol_name("_REF_SEL")
    1159                      .dwattr $C$DW$76, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x02)
    1160                      .dwattr $C$DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1161                      .dwattr $C$DW$76, DW_AT_accessibility(DW_ACCESS_public)
    1162                      .dwendtag $C$DW$T$35
    1163              
    1164              
    1165              $C$DW$T$36      .dwtag  DW_TAG_union_type
    1166                      .dwattr $C$DW$T$36, DW_AT_name("ADCREFSEL_REG")
    1167                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x01)
    1168              $C$DW$77        .dwtag  DW_TAG_member
    1169                      .dwattr $C$DW$77, DW_AT_type(*$C$DW$T$19)
    1170                      .dwattr $C$DW$77, DW_AT_name("all")
    1171                      .dwattr $C$DW$77, DW_AT_TI_symbol_name("_all")
    1172                      .dwattr $C$DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1173                      .dwattr $C$DW$77, DW_AT_accessibility(DW_ACCESS_public)
    1174              $C$DW$78        .dwtag  DW_TAG_member
    1175                      .dwattr $C$DW$78, DW_AT_type(*$C$DW$T$35)
    1176                      .dwattr $C$DW$78, DW_AT_name("bit")
    1177                      .dwattr $C$DW$78, DW_AT_TI_symbol_name("_bit")
    1178                      .dwattr $C$DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:38 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0504010                           PAGE   24

    1179                      .dwattr $C$DW$78, DW_AT_accessibility(DW_ACCESS_public)
    1180                      .dwendtag $C$DW$T$36
    1181              
    1182              
    1183              $C$DW$T$37      .dwtag  DW_TAG_structure_type
    1184                      .dwattr $C$DW$T$37, DW_AT_name("ADCST_BITS")
    1185                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x01)
    1186              $C$DW$79        .dwtag  DW_TAG_member
    1187                      .dwattr $C$DW$79, DW_AT_type(*$C$DW$T$19)
    1188                      .dwattr $C$DW$79, DW_AT_name("INT_SEQ1")
    1189                      .dwattr $C$DW$79, DW_AT_TI_symbol_name("_INT_SEQ1")
    1190                      .dwattr $C$DW$79, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    1191                      .dwattr $C$DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1192                      .dwattr $C$DW$79, DW_AT_accessibility(DW_ACCESS_public)
    1193              $C$DW$80        .dwtag  DW_TAG_member
    1194                      .dwattr $C$DW$80, DW_AT_type(*$C$DW$T$19)
    1195                      .dwattr $C$DW$80, DW_AT_name("INT_SEQ2")
    1196                      .dwattr $C$DW$80, DW_AT_TI_symbol_name("_INT_SEQ2")
    1197                      .dwattr $C$DW$80, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    1198                      .dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1199                      .dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
    1200              $C$DW$81        .dwtag  DW_TAG_member
    1201                      .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$19)
    1202                      .dwattr $C$DW$81, DW_AT_name("SEQ1_BSY")
    1203                      .dwattr $C$DW$81, DW_AT_TI_symbol_name("_SEQ1_BSY")
    1204                      .dwattr $C$DW$81, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    1205                      .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1206                      .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
    1207              $C$DW$82        .dwtag  DW_TAG_member
    1208                      .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$19)
    1209                      .dwattr $C$DW$82, DW_AT_name("SEQ2_BSY")
    1210                      .dwattr $C$DW$82, DW_AT_TI_symbol_name("_SEQ2_BSY")
    1211                      .dwattr $C$DW$82, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    1212                      .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1213                      .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
    1214              $C$DW$83        .dwtag  DW_TAG_member
    1215                      .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$19)
    1216                      .dwattr $C$DW$83, DW_AT_name("INT_SEQ1_CLR")
    1217                      .dwattr $C$DW$83, DW_AT_TI_symbol_name("_INT_SEQ1_CLR")
    1218                      .dwattr $C$DW$83, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    1219                      .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1220                      .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
    1221              $C$DW$84        .dwtag  DW_TAG_member
    1222                      .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$19)
    1223                      .dwattr $C$DW$84, DW_AT_name("INT_SEQ2_CLR")
    1224                      .dwattr $C$DW$84, DW_AT_TI_symbol_name("_INT_SEQ2_CLR")
    1225                      .dwattr $C$DW$84, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    1226                      .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1227                      .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
    1228              $C$DW$85        .dwtag  DW_TAG_member
    1229                      .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$19)
    1230                      .dwattr $C$DW$85, DW_AT_name("EOS_BUF1")
    1231                      .dwattr $C$DW$85, DW_AT_TI_symbol_name("_EOS_BUF1")
    1232                      .dwattr $C$DW$85, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    1233                      .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:38 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0504010                           PAGE   25

    1234                      .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
    1235              $C$DW$86        .dwtag  DW_TAG_member
    1236                      .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$19)
    1237                      .dwattr $C$DW$86, DW_AT_name("EOS_BUF2")
    1238                      .dwattr $C$DW$86, DW_AT_TI_symbol_name("_EOS_BUF2")
    1239                      .dwattr $C$DW$86, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    1240                      .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1241                      .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
    1242              $C$DW$87        .dwtag  DW_TAG_member
    1243                      .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$19)
    1244                      .dwattr $C$DW$87, DW_AT_name("rsvd1")
    1245                      .dwattr $C$DW$87, DW_AT_TI_symbol_name("_rsvd1")
    1246                      .dwattr $C$DW$87, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x08)
    1247                      .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1248                      .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
    1249                      .dwendtag $C$DW$T$37
    1250              
    1251              
    1252              $C$DW$T$38      .dwtag  DW_TAG_union_type
    1253                      .dwattr $C$DW$T$38, DW_AT_name("ADCST_REG")
    1254                      .dwattr $C$DW$T$38, DW_AT_byte_size(0x01)
    1255              $C$DW$88        .dwtag  DW_TAG_member
    1256                      .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$19)
    1257                      .dwattr $C$DW$88, DW_AT_name("all")
    1258                      .dwattr $C$DW$88, DW_AT_TI_symbol_name("_all")
    1259                      .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1260                      .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
    1261              $C$DW$89        .dwtag  DW_TAG_member
    1262                      .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$37)
    1263                      .dwattr $C$DW$89, DW_AT_name("bit")
    1264                      .dwattr $C$DW$89, DW_AT_TI_symbol_name("_bit")
    1265                      .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1266                      .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
    1267                      .dwendtag $C$DW$T$38
    1268              
    1269              
    1270              $C$DW$T$39      .dwtag  DW_TAG_structure_type
    1271                      .dwattr $C$DW$T$39, DW_AT_name("ADCTRL1_BITS")
    1272                      .dwattr $C$DW$T$39, DW_AT_byte_size(0x01)
    1273              $C$DW$90        .dwtag  DW_TAG_member
    1274                      .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$19)
    1275                      .dwattr $C$DW$90, DW_AT_name("rsvd1")
    1276                      .dwattr $C$DW$90, DW_AT_TI_symbol_name("_rsvd1")
    1277                      .dwattr $C$DW$90, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x04)
    1278                      .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1279                      .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
    1280              $C$DW$91        .dwtag  DW_TAG_member
    1281                      .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$19)
    1282                      .dwattr $C$DW$91, DW_AT_name("SEQ_CASC")
    1283                      .dwattr $C$DW$91, DW_AT_TI_symbol_name("_SEQ_CASC")
    1284                      .dwattr $C$DW$91, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    1285                      .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1286                      .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
    1287              $C$DW$92        .dwtag  DW_TAG_member
    1288                      .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:38 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0504010                           PAGE   26

    1289                      .dwattr $C$DW$92, DW_AT_name("SEQ_OVRD")
    1290                      .dwattr $C$DW$92, DW_AT_TI_symbol_name("_SEQ_OVRD")
    1291                      .dwattr $C$DW$92, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    1292                      .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1293                      .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
    1294              $C$DW$93        .dwtag  DW_TAG_member
    1295                      .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$19)
    1296                      .dwattr $C$DW$93, DW_AT_name("CONT_RUN")
    1297                      .dwattr $C$DW$93, DW_AT_TI_symbol_name("_CONT_RUN")
    1298                      .dwattr $C$DW$93, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    1299                      .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1300                      .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
    1301              $C$DW$94        .dwtag  DW_TAG_member
    1302                      .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$19)
    1303                      .dwattr $C$DW$94, DW_AT_name("CPS")
    1304                      .dwattr $C$DW$94, DW_AT_TI_symbol_name("_CPS")
    1305                      .dwattr $C$DW$94, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    1306                      .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1307                      .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
    1308              $C$DW$95        .dwtag  DW_TAG_member
    1309                      .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$19)
    1310                      .dwattr $C$DW$95, DW_AT_name("ACQ_PS")
    1311                      .dwattr $C$DW$95, DW_AT_TI_symbol_name("_ACQ_PS")
    1312                      .dwattr $C$DW$95, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x04)
    1313                      .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1314                      .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
    1315              $C$DW$96        .dwtag  DW_TAG_member
    1316                      .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$19)
    1317                      .dwattr $C$DW$96, DW_AT_name("SUSMOD")
    1318                      .dwattr $C$DW$96, DW_AT_TI_symbol_name("_SUSMOD")
    1319                      .dwattr $C$DW$96, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x02)
    1320                      .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1321                      .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
    1322              $C$DW$97        .dwtag  DW_TAG_member
    1323                      .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$19)
    1324                      .dwattr $C$DW$97, DW_AT_name("RESET")
    1325                      .dwattr $C$DW$97, DW_AT_TI_symbol_name("_RESET")
    1326                      .dwattr $C$DW$97, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
    1327                      .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1328                      .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
    1329              $C$DW$98        .dwtag  DW_TAG_member
    1330                      .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$19)
    1331                      .dwattr $C$DW$98, DW_AT_name("rsvd2")
    1332                      .dwattr $C$DW$98, DW_AT_TI_symbol_name("_rsvd2")
    1333                      .dwattr $C$DW$98, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    1334                      .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1335                      .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
    1336                      .dwendtag $C$DW$T$39
    1337              
    1338              
    1339              $C$DW$T$40      .dwtag  DW_TAG_union_type
    1340                      .dwattr $C$DW$T$40, DW_AT_name("ADCTRL1_REG")
    1341                      .dwattr $C$DW$T$40, DW_AT_byte_size(0x01)
    1342              $C$DW$99        .dwtag  DW_TAG_member
    1343                      .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:38 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0504010                           PAGE   27

    1344                      .dwattr $C$DW$99, DW_AT_name("all")
    1345                      .dwattr $C$DW$99, DW_AT_TI_symbol_name("_all")
    1346                      .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1347                      .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
    1348              $C$DW$100       .dwtag  DW_TAG_member
    1349                      .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$39)
    1350                      .dwattr $C$DW$100, DW_AT_name("bit")
    1351                      .dwattr $C$DW$100, DW_AT_TI_symbol_name("_bit")
    1352                      .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1353                      .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
    1354                      .dwendtag $C$DW$T$40
    1355              
    1356              
    1357              $C$DW$T$41      .dwtag  DW_TAG_structure_type
    1358                      .dwattr $C$DW$T$41, DW_AT_name("ADCTRL2_BITS")
    1359                      .dwattr $C$DW$T$41, DW_AT_byte_size(0x01)
    1360              $C$DW$101       .dwtag  DW_TAG_member
    1361                      .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$19)
    1362                      .dwattr $C$DW$101, DW_AT_name("EPWM_SOCB_SEQ2")
    1363                      .dwattr $C$DW$101, DW_AT_TI_symbol_name("_EPWM_SOCB_SEQ2")
    1364                      .dwattr $C$DW$101, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    1365                      .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1366                      .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
    1367              $C$DW$102       .dwtag  DW_TAG_member
    1368                      .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$19)
    1369                      .dwattr $C$DW$102, DW_AT_name("rsvd1")
    1370                      .dwattr $C$DW$102, DW_AT_TI_symbol_name("_rsvd1")
    1371                      .dwattr $C$DW$102, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    1372                      .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1373                      .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
    1374              $C$DW$103       .dwtag  DW_TAG_member
    1375                      .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$19)
    1376                      .dwattr $C$DW$103, DW_AT_name("INT_MOD_SEQ2")
    1377                      .dwattr $C$DW$103, DW_AT_TI_symbol_name("_INT_MOD_SEQ2")
    1378                      .dwattr $C$DW$103, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    1379                      .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1380                      .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
    1381              $C$DW$104       .dwtag  DW_TAG_member
    1382                      .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$19)
    1383                      .dwattr $C$DW$104, DW_AT_name("INT_ENA_SEQ2")
    1384                      .dwattr $C$DW$104, DW_AT_TI_symbol_name("_INT_ENA_SEQ2")
    1385                      .dwattr $C$DW$104, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    1386                      .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1387                      .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
    1388              $C$DW$105       .dwtag  DW_TAG_member
    1389                      .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$19)
    1390                      .dwattr $C$DW$105, DW_AT_name("rsvd2")
    1391                      .dwattr $C$DW$105, DW_AT_TI_symbol_name("_rsvd2")
    1392                      .dwattr $C$DW$105, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    1393                      .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1394                      .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
    1395              $C$DW$106       .dwtag  DW_TAG_member
    1396                      .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$19)
    1397                      .dwattr $C$DW$106, DW_AT_name("SOC_SEQ2")
    1398                      .dwattr $C$DW$106, DW_AT_TI_symbol_name("_SOC_SEQ2")
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:38 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0504010                           PAGE   28

    1399                      .dwattr $C$DW$106, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    1400                      .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1401                      .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    1402              $C$DW$107       .dwtag  DW_TAG_member
    1403                      .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$19)
    1404                      .dwattr $C$DW$107, DW_AT_name("RST_SEQ2")
    1405                      .dwattr $C$DW$107, DW_AT_TI_symbol_name("_RST_SEQ2")
    1406                      .dwattr $C$DW$107, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    1407                      .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1408                      .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
    1409              $C$DW$108       .dwtag  DW_TAG_member
    1410                      .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$19)
    1411                      .dwattr $C$DW$108, DW_AT_name("EXT_SOC_SEQ1")
    1412                      .dwattr $C$DW$108, DW_AT_TI_symbol_name("_EXT_SOC_SEQ1")
    1413                      .dwattr $C$DW$108, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    1414                      .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1415                      .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    1416              $C$DW$109       .dwtag  DW_TAG_member
    1417                      .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$19)
    1418                      .dwattr $C$DW$109, DW_AT_name("EPWM_SOCA_SEQ1")
    1419                      .dwattr $C$DW$109, DW_AT_TI_symbol_name("_EPWM_SOCA_SEQ1")
    1420                      .dwattr $C$DW$109, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
    1421                      .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1422                      .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    1423              $C$DW$110       .dwtag  DW_TAG_member
    1424                      .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$19)
    1425                      .dwattr $C$DW$110, DW_AT_name("rsvd3")
    1426                      .dwattr $C$DW$110, DW_AT_TI_symbol_name("_rsvd3")
    1427                      .dwattr $C$DW$110, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    1428                      .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1429                      .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    1430              $C$DW$111       .dwtag  DW_TAG_member
    1431                      .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$19)
    1432                      .dwattr $C$DW$111, DW_AT_name("INT_MOD_SEQ1")
    1433                      .dwattr $C$DW$111, DW_AT_TI_symbol_name("_INT_MOD_SEQ1")
    1434                      .dwattr $C$DW$111, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
    1435                      .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1436                      .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    1437              $C$DW$112       .dwtag  DW_TAG_member
    1438                      .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$19)
    1439                      .dwattr $C$DW$112, DW_AT_name("INT_ENA_SEQ1")
    1440                      .dwattr $C$DW$112, DW_AT_TI_symbol_name("_INT_ENA_SEQ1")
    1441                      .dwattr $C$DW$112, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
    1442                      .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1443                      .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    1444              $C$DW$113       .dwtag  DW_TAG_member
    1445                      .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$19)
    1446                      .dwattr $C$DW$113, DW_AT_name("rsvd4")
    1447                      .dwattr $C$DW$113, DW_AT_TI_symbol_name("_rsvd4")
    1448                      .dwattr $C$DW$113, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
    1449                      .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1450                      .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    1451              $C$DW$114       .dwtag  DW_TAG_member
    1452                      .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$19)
    1453                      .dwattr $C$DW$114, DW_AT_name("SOC_SEQ1")
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:38 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0504010                           PAGE   29

    1454                      .dwattr $C$DW$114, DW_AT_TI_symbol_name("_SOC_SEQ1")
    1455                      .dwattr $C$DW$114, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
    1456                      .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1457                      .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    1458              $C$DW$115       .dwtag  DW_TAG_member
    1459                      .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$19)
    1460                      .dwattr $C$DW$115, DW_AT_name("RST_SEQ1")
    1461                      .dwattr $C$DW$115, DW_AT_TI_symbol_name("_RST_SEQ1")
    1462                      .dwattr $C$DW$115, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
    1463                      .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1464                      .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    1465              $C$DW$116       .dwtag  DW_TAG_member
    1466                      .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$19)
    1467                      .dwattr $C$DW$116, DW_AT_name("EPWM_SOCB_SEQ")
    1468                      .dwattr $C$DW$116, DW_AT_TI_symbol_name("_EPWM_SOCB_SEQ")
    1469                      .dwattr $C$DW$116, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    1470                      .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1471                      .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    1472                      .dwendtag $C$DW$T$41
    1473              
    1474              
    1475              $C$DW$T$42      .dwtag  DW_TAG_union_type
    1476                      .dwattr $C$DW$T$42, DW_AT_name("ADCTRL2_REG")
    1477                      .dwattr $C$DW$T$42, DW_AT_byte_size(0x01)
    1478              $C$DW$117       .dwtag  DW_TAG_member
    1479                      .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$19)
    1480                      .dwattr $C$DW$117, DW_AT_name("all")
    1481                      .dwattr $C$DW$117, DW_AT_TI_symbol_name("_all")
    1482                      .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1483                      .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    1484              $C$DW$118       .dwtag  DW_TAG_member
    1485                      .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$41)
    1486                      .dwattr $C$DW$118, DW_AT_name("bit")
    1487                      .dwattr $C$DW$118, DW_AT_TI_symbol_name("_bit")
    1488                      .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1489                      .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    1490                      .dwendtag $C$DW$T$42
    1491              
    1492              
    1493              $C$DW$T$43      .dwtag  DW_TAG_structure_type
    1494                      .dwattr $C$DW$T$43, DW_AT_name("ADCTRL3_BITS")
    1495                      .dwattr $C$DW$T$43, DW_AT_byte_size(0x01)
    1496              $C$DW$119       .dwtag  DW_TAG_member
    1497                      .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$19)
    1498                      .dwattr $C$DW$119, DW_AT_name("SMODE_SEL")
    1499                      .dwattr $C$DW$119, DW_AT_TI_symbol_name("_SMODE_SEL")
    1500                      .dwattr $C$DW$119, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    1501                      .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1502                      .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    1503              $C$DW$120       .dwtag  DW_TAG_member
    1504                      .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$19)
    1505                      .dwattr $C$DW$120, DW_AT_name("ADCCLKPS")
    1506                      .dwattr $C$DW$120, DW_AT_TI_symbol_name("_ADCCLKPS")
    1507                      .dwattr $C$DW$120, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x04)
    1508                      .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:38 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0504010                           PAGE   30

    1509                      .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    1510              $C$DW$121       .dwtag  DW_TAG_member
    1511                      .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$19)
    1512                      .dwattr $C$DW$121, DW_AT_name("ADCPWDN")
    1513                      .dwattr $C$DW$121, DW_AT_TI_symbol_name("_ADCPWDN")
    1514                      .dwattr $C$DW$121, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    1515                      .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1516                      .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    1517              $C$DW$122       .dwtag  DW_TAG_member
    1518                      .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$19)
    1519                      .dwattr $C$DW$122, DW_AT_name("ADCBGRFDN")
    1520                      .dwattr $C$DW$122, DW_AT_TI_symbol_name("_ADCBGRFDN")
    1521                      .dwattr $C$DW$122, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x02)
    1522                      .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1523                      .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    1524              $C$DW$123       .dwtag  DW_TAG_member
    1525                      .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$19)
    1526                      .dwattr $C$DW$123, DW_AT_name("rsvd1")
    1527                      .dwattr $C$DW$123, DW_AT_TI_symbol_name("_rsvd1")
    1528                      .dwattr $C$DW$123, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x08)
    1529                      .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1530                      .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    1531                      .dwendtag $C$DW$T$43
    1532              
    1533              
    1534              $C$DW$T$44      .dwtag  DW_TAG_union_type
    1535                      .dwattr $C$DW$T$44, DW_AT_name("ADCTRL3_REG")
    1536                      .dwattr $C$DW$T$44, DW_AT_byte_size(0x01)
    1537              $C$DW$124       .dwtag  DW_TAG_member
    1538                      .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$19)
    1539                      .dwattr $C$DW$124, DW_AT_name("all")
    1540                      .dwattr $C$DW$124, DW_AT_TI_symbol_name("_all")
    1541                      .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1542                      .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    1543              $C$DW$125       .dwtag  DW_TAG_member
    1544                      .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$43)
    1545                      .dwattr $C$DW$125, DW_AT_name("bit")
    1546                      .dwattr $C$DW$125, DW_AT_TI_symbol_name("_bit")
    1547                      .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1548                      .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    1549                      .dwendtag $C$DW$T$44
    1550              
    1551              
    1552              $C$DW$T$45      .dwtag  DW_TAG_structure_type
    1553                      .dwattr $C$DW$T$45, DW_AT_name("ADC_REGS")
    1554                      .dwattr $C$DW$T$45, DW_AT_byte_size(0x1e)
    1555              $C$DW$126       .dwtag  DW_TAG_member
    1556                      .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$40)
    1557                      .dwattr $C$DW$126, DW_AT_name("ADCTRL1")
    1558                      .dwattr $C$DW$126, DW_AT_TI_symbol_name("_ADCTRL1")
    1559                      .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1560                      .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    1561              $C$DW$127       .dwtag  DW_TAG_member
    1562                      .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$42)
    1563                      .dwattr $C$DW$127, DW_AT_name("ADCTRL2")
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:38 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0504010                           PAGE   31

    1564                      .dwattr $C$DW$127, DW_AT_TI_symbol_name("_ADCTRL2")
    1565                      .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1566                      .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    1567              $C$DW$128       .dwtag  DW_TAG_member
    1568                      .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$31)
    1569                      .dwattr $C$DW$128, DW_AT_name("ADCMAXCONV")
    1570                      .dwattr $C$DW$128, DW_AT_TI_symbol_name("_ADCMAXCONV")
    1571                      .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1572                      .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    1573              $C$DW$129       .dwtag  DW_TAG_member
    1574                      .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$23)
    1575                      .dwattr $C$DW$129, DW_AT_name("ADCCHSELSEQ1")
    1576                      .dwattr $C$DW$129, DW_AT_TI_symbol_name("_ADCCHSELSEQ1")
    1577                      .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    1578                      .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    1579              $C$DW$130       .dwtag  DW_TAG_member
    1580                      .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$25)
    1581                      .dwattr $C$DW$130, DW_AT_name("ADCCHSELSEQ2")
    1582                      .dwattr $C$DW$130, DW_AT_TI_symbol_name("_ADCCHSELSEQ2")
    1583                      .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1584                      .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    1585              $C$DW$131       .dwtag  DW_TAG_member
    1586                      .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$27)
    1587                      .dwattr $C$DW$131, DW_AT_name("ADCCHSELSEQ3")
    1588                      .dwattr $C$DW$131, DW_AT_TI_symbol_name("_ADCCHSELSEQ3")
    1589                      .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    1590                      .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    1591              $C$DW$132       .dwtag  DW_TAG_member
    1592                      .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$29)
    1593                      .dwattr $C$DW$132, DW_AT_name("ADCCHSELSEQ4")
    1594                      .dwattr $C$DW$132, DW_AT_TI_symbol_name("_ADCCHSELSEQ4")
    1595                      .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1596                      .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    1597              $C$DW$133       .dwtag  DW_TAG_member
    1598                      .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$21)
    1599                      .dwattr $C$DW$133, DW_AT_name("ADCASEQSR")
    1600                      .dwattr $C$DW$133, DW_AT_TI_symbol_name("_ADCASEQSR")
    1601                      .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    1602                      .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    1603              $C$DW$134       .dwtag  DW_TAG_member
    1604                      .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$19)
    1605                      .dwattr $C$DW$134, DW_AT_name("ADCRESULT0")
    1606                      .dwattr $C$DW$134, DW_AT_TI_symbol_name("_ADCRESULT0")
    1607                      .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1608                      .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    1609              $C$DW$135       .dwtag  DW_TAG_member
    1610                      .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$19)
    1611                      .dwattr $C$DW$135, DW_AT_name("ADCRESULT1")
    1612                      .dwattr $C$DW$135, DW_AT_TI_symbol_name("_ADCRESULT1")
    1613                      .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    1614                      .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    1615              $C$DW$136       .dwtag  DW_TAG_member
    1616                      .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$19)
    1617                      .dwattr $C$DW$136, DW_AT_name("ADCRESULT2")
    1618                      .dwattr $C$DW$136, DW_AT_TI_symbol_name("_ADCRESULT2")
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:38 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0504010                           PAGE   32

    1619                      .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1620                      .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    1621              $C$DW$137       .dwtag  DW_TAG_member
    1622                      .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$19)
    1623                      .dwattr $C$DW$137, DW_AT_name("ADCRESULT3")
    1624                      .dwattr $C$DW$137, DW_AT_TI_symbol_name("_ADCRESULT3")
    1625                      .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    1626                      .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    1627              $C$DW$138       .dwtag  DW_TAG_member
    1628                      .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$19)
    1629                      .dwattr $C$DW$138, DW_AT_name("ADCRESULT4")
    1630                      .dwattr $C$DW$138, DW_AT_TI_symbol_name("_ADCRESULT4")
    1631                      .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1632                      .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    1633              $C$DW$139       .dwtag  DW_TAG_member
    1634                      .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$19)
    1635                      .dwattr $C$DW$139, DW_AT_name("ADCRESULT5")
    1636                      .dwattr $C$DW$139, DW_AT_TI_symbol_name("_ADCRESULT5")
    1637                      .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    1638                      .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    1639              $C$DW$140       .dwtag  DW_TAG_member
    1640                      .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$19)
    1641                      .dwattr $C$DW$140, DW_AT_name("ADCRESULT6")
    1642                      .dwattr $C$DW$140, DW_AT_TI_symbol_name("_ADCRESULT6")
    1643                      .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1644                      .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    1645              $C$DW$141       .dwtag  DW_TAG_member
    1646                      .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$19)
    1647                      .dwattr $C$DW$141, DW_AT_name("ADCRESULT7")
    1648                      .dwattr $C$DW$141, DW_AT_TI_symbol_name("_ADCRESULT7")
    1649                      .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
    1650                      .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    1651              $C$DW$142       .dwtag  DW_TAG_member
    1652                      .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$19)
    1653                      .dwattr $C$DW$142, DW_AT_name("ADCRESULT8")
    1654                      .dwattr $C$DW$142, DW_AT_TI_symbol_name("_ADCRESULT8")
    1655                      .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1656                      .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    1657              $C$DW$143       .dwtag  DW_TAG_member
    1658                      .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$19)
    1659                      .dwattr $C$DW$143, DW_AT_name("ADCRESULT9")
    1660                      .dwattr $C$DW$143, DW_AT_TI_symbol_name("_ADCRESULT9")
    1661                      .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    1662                      .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    1663              $C$DW$144       .dwtag  DW_TAG_member
    1664                      .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$19)
    1665                      .dwattr $C$DW$144, DW_AT_name("ADCRESULT10")
    1666                      .dwattr $C$DW$144, DW_AT_TI_symbol_name("_ADCRESULT10")
    1667                      .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    1668                      .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    1669              $C$DW$145       .dwtag  DW_TAG_member
    1670                      .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$19)
    1671                      .dwattr $C$DW$145, DW_AT_name("ADCRESULT11")
    1672                      .dwattr $C$DW$145, DW_AT_TI_symbol_name("_ADCRESULT11")
    1673                      .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x13]
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:38 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0504010                           PAGE   33

    1674                      .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    1675              $C$DW$146       .dwtag  DW_TAG_member
    1676                      .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$19)
    1677                      .dwattr $C$DW$146, DW_AT_name("ADCRESULT12")
    1678                      .dwattr $C$DW$146, DW_AT_TI_symbol_name("_ADCRESULT12")
    1679                      .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1680                      .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
    1681              $C$DW$147       .dwtag  DW_TAG_member
    1682                      .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$19)
    1683                      .dwattr $C$DW$147, DW_AT_name("ADCRESULT13")
    1684                      .dwattr $C$DW$147, DW_AT_TI_symbol_name("_ADCRESULT13")
    1685                      .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    1686                      .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
    1687              $C$DW$148       .dwtag  DW_TAG_member
    1688                      .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$19)
    1689                      .dwattr $C$DW$148, DW_AT_name("ADCRESULT14")
    1690                      .dwattr $C$DW$148, DW_AT_TI_symbol_name("_ADCRESULT14")
    1691                      .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    1692                      .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    1693              $C$DW$149       .dwtag  DW_TAG_member
    1694                      .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$19)
    1695                      .dwattr $C$DW$149, DW_AT_name("ADCRESULT15")
    1696                      .dwattr $C$DW$149, DW_AT_TI_symbol_name("_ADCRESULT15")
    1697                      .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
    1698                      .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    1699              $C$DW$150       .dwtag  DW_TAG_member
    1700                      .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$44)
    1701                      .dwattr $C$DW$150, DW_AT_name("ADCTRL3")
    1702                      .dwattr $C$DW$150, DW_AT_TI_symbol_name("_ADCTRL3")
    1703                      .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1704                      .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
    1705              $C$DW$151       .dwtag  DW_TAG_member
    1706                      .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$38)
    1707                      .dwattr $C$DW$151, DW_AT_name("ADCST")
    1708                      .dwattr $C$DW$151, DW_AT_TI_symbol_name("_ADCST")
    1709                      .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
    1710                      .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    1711              $C$DW$152       .dwtag  DW_TAG_member
    1712                      .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$19)
    1713                      .dwattr $C$DW$152, DW_AT_name("rsvd1")
    1714                      .dwattr $C$DW$152, DW_AT_TI_symbol_name("_rsvd1")
    1715                      .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    1716                      .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    1717              $C$DW$153       .dwtag  DW_TAG_member
    1718                      .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$19)
    1719                      .dwattr $C$DW$153, DW_AT_name("rsvd2")
    1720                      .dwattr $C$DW$153, DW_AT_TI_symbol_name("_rsvd2")
    1721                      .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b]
    1722                      .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    1723              $C$DW$154       .dwtag  DW_TAG_member
    1724                      .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$36)
    1725                      .dwattr $C$DW$154, DW_AT_name("ADCREFSEL")
    1726                      .dwattr $C$DW$154, DW_AT_TI_symbol_name("_ADCREFSEL")
    1727                      .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    1728                      .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:38 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0504010                           PAGE   34

    1729              $C$DW$155       .dwtag  DW_TAG_member
    1730                      .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$34)
    1731                      .dwattr $C$DW$155, DW_AT_name("ADCOFFTRIM")
    1732                      .dwattr $C$DW$155, DW_AT_TI_symbol_name("_ADCOFFTRIM")
    1733                      .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
    1734                      .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
    1735                      .dwendtag $C$DW$T$45
    1736              
    1737              $C$DW$156       .dwtag  DW_TAG_TI_far_type
    1738                      .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$45)
    1739              $C$DW$T$95      .dwtag  DW_TAG_volatile_type
    1740                      .dwattr $C$DW$T$95, DW_AT_type(*$C$DW$156)
    1741              
    1742              $C$DW$T$46      .dwtag  DW_TAG_structure_type
    1743                      .dwattr $C$DW$T$46, DW_AT_name("HISPCP_BITS")
    1744                      .dwattr $C$DW$T$46, DW_AT_byte_size(0x01)
    1745              $C$DW$157       .dwtag  DW_TAG_member
    1746                      .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$19)
    1747                      .dwattr $C$DW$157, DW_AT_name("HSPCLK")
    1748                      .dwattr $C$DW$157, DW_AT_TI_symbol_name("_HSPCLK")
    1749                      .dwattr $C$DW$157, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x03)
    1750                      .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1751                      .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    1752              $C$DW$158       .dwtag  DW_TAG_member
    1753                      .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$19)
    1754                      .dwattr $C$DW$158, DW_AT_name("rsvd1")
    1755                      .dwattr $C$DW$158, DW_AT_TI_symbol_name("_rsvd1")
    1756                      .dwattr $C$DW$158, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0d)
    1757                      .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1758                      .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    1759                      .dwendtag $C$DW$T$46
    1760              
    1761              
    1762              $C$DW$T$47      .dwtag  DW_TAG_union_type
    1763                      .dwattr $C$DW$T$47, DW_AT_name("HISPCP_REG")
    1764                      .dwattr $C$DW$T$47, DW_AT_byte_size(0x01)
    1765              $C$DW$159       .dwtag  DW_TAG_member
    1766                      .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$19)
    1767                      .dwattr $C$DW$159, DW_AT_name("all")
    1768                      .dwattr $C$DW$159, DW_AT_TI_symbol_name("_all")
    1769                      .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1770                      .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    1771              $C$DW$160       .dwtag  DW_TAG_member
    1772                      .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$46)
    1773                      .dwattr $C$DW$160, DW_AT_name("bit")
    1774                      .dwattr $C$DW$160, DW_AT_TI_symbol_name("_bit")
    1775                      .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1776                      .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    1777                      .dwendtag $C$DW$T$47
    1778              
    1779              
    1780              $C$DW$T$48      .dwtag  DW_TAG_structure_type
    1781                      .dwattr $C$DW$T$48, DW_AT_name("LOSPCP_BITS")
    1782                      .dwattr $C$DW$T$48, DW_AT_byte_size(0x01)
    1783              $C$DW$161       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:38 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0504010                           PAGE   35

    1784                      .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$19)
    1785                      .dwattr $C$DW$161, DW_AT_name("LSPCLK")
    1786                      .dwattr $C$DW$161, DW_AT_TI_symbol_name("_LSPCLK")
    1787                      .dwattr $C$DW$161, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x03)
    1788                      .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1789                      .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    1790              $C$DW$162       .dwtag  DW_TAG_member
    1791                      .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$19)
    1792                      .dwattr $C$DW$162, DW_AT_name("rsvd1")
    1793                      .dwattr $C$DW$162, DW_AT_TI_symbol_name("_rsvd1")
    1794                      .dwattr $C$DW$162, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0d)
    1795                      .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1796                      .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    1797                      .dwendtag $C$DW$T$48
    1798              
    1799              
    1800              $C$DW$T$49      .dwtag  DW_TAG_union_type
    1801                      .dwattr $C$DW$T$49, DW_AT_name("LOSPCP_REG")
    1802                      .dwattr $C$DW$T$49, DW_AT_byte_size(0x01)
    1803              $C$DW$163       .dwtag  DW_TAG_member
    1804                      .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$19)
    1805                      .dwattr $C$DW$163, DW_AT_name("all")
    1806                      .dwattr $C$DW$163, DW_AT_TI_symbol_name("_all")
    1807                      .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1808                      .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    1809              $C$DW$164       .dwtag  DW_TAG_member
    1810                      .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$48)
    1811                      .dwattr $C$DW$164, DW_AT_name("bit")
    1812                      .dwattr $C$DW$164, DW_AT_TI_symbol_name("_bit")
    1813                      .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1814                      .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    1815                      .dwendtag $C$DW$T$49
    1816              
    1817              
    1818              $C$DW$T$50      .dwtag  DW_TAG_structure_type
    1819                      .dwattr $C$DW$T$50, DW_AT_name("LPMCR0_BITS")
    1820                      .dwattr $C$DW$T$50, DW_AT_byte_size(0x01)
    1821              $C$DW$165       .dwtag  DW_TAG_member
    1822                      .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$19)
    1823                      .dwattr $C$DW$165, DW_AT_name("LPM")
    1824                      .dwattr $C$DW$165, DW_AT_TI_symbol_name("_LPM")
    1825                      .dwattr $C$DW$165, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x02)
    1826                      .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1827                      .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    1828              $C$DW$166       .dwtag  DW_TAG_member
    1829                      .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$19)
    1830                      .dwattr $C$DW$166, DW_AT_name("QUALSTDBY")
    1831                      .dwattr $C$DW$166, DW_AT_TI_symbol_name("_QUALSTDBY")
    1832                      .dwattr $C$DW$166, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x06)
    1833                      .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1834                      .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    1835              $C$DW$167       .dwtag  DW_TAG_member
    1836                      .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$19)
    1837                      .dwattr $C$DW$167, DW_AT_name("rsvd1")
    1838                      .dwattr $C$DW$167, DW_AT_TI_symbol_name("_rsvd1")
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:38 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0504010                           PAGE   36

    1839                      .dwattr $C$DW$167, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x07)
    1840                      .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1841                      .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    1842              $C$DW$168       .dwtag  DW_TAG_member
    1843                      .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$19)
    1844                      .dwattr $C$DW$168, DW_AT_name("WDINTE")
    1845                      .dwattr $C$DW$168, DW_AT_TI_symbol_name("_WDINTE")
    1846                      .dwattr $C$DW$168, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    1847                      .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1848                      .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    1849                      .dwendtag $C$DW$T$50
    1850              
    1851              
    1852              $C$DW$T$51      .dwtag  DW_TAG_union_type
    1853                      .dwattr $C$DW$T$51, DW_AT_name("LPMCR0_REG")
    1854                      .dwattr $C$DW$T$51, DW_AT_byte_size(0x01)
    1855              $C$DW$169       .dwtag  DW_TAG_member
    1856                      .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$19)
    1857                      .dwattr $C$DW$169, DW_AT_name("all")
    1858                      .dwattr $C$DW$169, DW_AT_TI_symbol_name("_all")
    1859                      .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1860                      .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    1861              $C$DW$170       .dwtag  DW_TAG_member
    1862                      .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$50)
    1863                      .dwattr $C$DW$170, DW_AT_name("bit")
    1864                      .dwattr $C$DW$170, DW_AT_TI_symbol_name("_bit")
    1865                      .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1866                      .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    1867                      .dwendtag $C$DW$T$51
    1868              
    1869              
    1870              $C$DW$T$52      .dwtag  DW_TAG_structure_type
    1871                      .dwattr $C$DW$T$52, DW_AT_name("MAPCNF_BITS")
    1872                      .dwattr $C$DW$T$52, DW_AT_byte_size(0x01)
    1873              $C$DW$171       .dwtag  DW_TAG_member
    1874                      .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$19)
    1875                      .dwattr $C$DW$171, DW_AT_name("MAPEPWM")
    1876                      .dwattr $C$DW$171, DW_AT_TI_symbol_name("_MAPEPWM")
    1877                      .dwattr $C$DW$171, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    1878                      .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1879                      .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    1880              $C$DW$172       .dwtag  DW_TAG_member
    1881                      .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$19)
    1882                      .dwattr $C$DW$172, DW_AT_name("rsvd1")
    1883                      .dwattr $C$DW$172, DW_AT_TI_symbol_name("_rsvd1")
    1884                      .dwattr $C$DW$172, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0f)
    1885                      .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1886                      .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    1887                      .dwendtag $C$DW$T$52
    1888              
    1889              
    1890              $C$DW$T$53      .dwtag  DW_TAG_union_type
    1891                      .dwattr $C$DW$T$53, DW_AT_name("MAPCNF_REG")
    1892                      .dwattr $C$DW$T$53, DW_AT_byte_size(0x01)
    1893              $C$DW$173       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:38 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0504010                           PAGE   37

    1894                      .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$19)
    1895                      .dwattr $C$DW$173, DW_AT_name("all")
    1896                      .dwattr $C$DW$173, DW_AT_TI_symbol_name("_all")
    1897                      .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1898                      .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
    1899              $C$DW$174       .dwtag  DW_TAG_member
    1900                      .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$52)
    1901                      .dwattr $C$DW$174, DW_AT_name("bit")
    1902                      .dwattr $C$DW$174, DW_AT_TI_symbol_name("_bit")
    1903                      .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1904                      .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
    1905                      .dwendtag $C$DW$T$53
    1906              
    1907              
    1908              $C$DW$T$54      .dwtag  DW_TAG_structure_type
    1909                      .dwattr $C$DW$T$54, DW_AT_name("PCLKCR0_BITS")
    1910                      .dwattr $C$DW$T$54, DW_AT_byte_size(0x01)
    1911              $C$DW$175       .dwtag  DW_TAG_member
    1912                      .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$19)
    1913                      .dwattr $C$DW$175, DW_AT_name("rsvd1")
    1914                      .dwattr $C$DW$175, DW_AT_TI_symbol_name("_rsvd1")
    1915                      .dwattr $C$DW$175, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x02)
    1916                      .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1917                      .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
    1918              $C$DW$176       .dwtag  DW_TAG_member
    1919                      .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$19)
    1920                      .dwattr $C$DW$176, DW_AT_name("TBCLKSYNC")
    1921                      .dwattr $C$DW$176, DW_AT_TI_symbol_name("_TBCLKSYNC")
    1922                      .dwattr $C$DW$176, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    1923                      .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1924                      .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
    1925              $C$DW$177       .dwtag  DW_TAG_member
    1926                      .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$19)
    1927                      .dwattr $C$DW$177, DW_AT_name("ADCENCLK")
    1928                      .dwattr $C$DW$177, DW_AT_TI_symbol_name("_ADCENCLK")
    1929                      .dwattr $C$DW$177, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    1930                      .dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1931                      .dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
    1932              $C$DW$178       .dwtag  DW_TAG_member
    1933                      .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$19)
    1934                      .dwattr $C$DW$178, DW_AT_name("I2CAENCLK")
    1935                      .dwattr $C$DW$178, DW_AT_TI_symbol_name("_I2CAENCLK")
    1936                      .dwattr $C$DW$178, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    1937                      .dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1938                      .dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
    1939              $C$DW$179       .dwtag  DW_TAG_member
    1940                      .dwattr $C$DW$179, DW_AT_type(*$C$DW$T$19)
    1941                      .dwattr $C$DW$179, DW_AT_name("SCICENCLK")
    1942                      .dwattr $C$DW$179, DW_AT_TI_symbol_name("_SCICENCLK")
    1943                      .dwattr $C$DW$179, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    1944                      .dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1945                      .dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
    1946              $C$DW$180       .dwtag  DW_TAG_member
    1947                      .dwattr $C$DW$180, DW_AT_type(*$C$DW$T$19)
    1948                      .dwattr $C$DW$180, DW_AT_name("rsvd2")
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:38 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0504010                           PAGE   38

    1949                      .dwattr $C$DW$180, DW_AT_TI_symbol_name("_rsvd2")
    1950                      .dwattr $C$DW$180, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x02)
    1951                      .dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1952                      .dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
    1953              $C$DW$181       .dwtag  DW_TAG_member
    1954                      .dwattr $C$DW$181, DW_AT_type(*$C$DW$T$19)
    1955                      .dwattr $C$DW$181, DW_AT_name("SPIAENCLK")
    1956                      .dwattr $C$DW$181, DW_AT_TI_symbol_name("_SPIAENCLK")
    1957                      .dwattr $C$DW$181, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
    1958                      .dwattr $C$DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1959                      .dwattr $C$DW$181, DW_AT_accessibility(DW_ACCESS_public)
    1960              $C$DW$182       .dwtag  DW_TAG_member
    1961                      .dwattr $C$DW$182, DW_AT_type(*$C$DW$T$19)
    1962                      .dwattr $C$DW$182, DW_AT_name("rsvd3")
    1963                      .dwattr $C$DW$182, DW_AT_TI_symbol_name("_rsvd3")
    1964                      .dwattr $C$DW$182, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    1965                      .dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1966                      .dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)
    1967              $C$DW$183       .dwtag  DW_TAG_member
    1968                      .dwattr $C$DW$183, DW_AT_type(*$C$DW$T$19)
    1969                      .dwattr $C$DW$183, DW_AT_name("SCIAENCLK")
    1970                      .dwattr $C$DW$183, DW_AT_TI_symbol_name("_SCIAENCLK")
    1971                      .dwattr $C$DW$183, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
    1972                      .dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1973                      .dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
    1974              $C$DW$184       .dwtag  DW_TAG_member
    1975                      .dwattr $C$DW$184, DW_AT_type(*$C$DW$T$19)
    1976                      .dwattr $C$DW$184, DW_AT_name("SCIBENCLK")
    1977                      .dwattr $C$DW$184, DW_AT_TI_symbol_name("_SCIBENCLK")
    1978                      .dwattr $C$DW$184, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
    1979                      .dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
