TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:24 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0594010                           PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v6.2.7 *
       3              ;* Date/Time created: Thu Jul 02 08:31:24 2015                 *
       4              ;***************************************************************
       5                      .compiler_opts --diag_wrap=off --float_support=fpu32 --hll_source=on --mem_model:code=flat --mem_mode
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("../DSP2833x_headers/source/DefaultIsr_nonBIOS.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v6.2.7 Copyright (c) 1996-2014 Texas I
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("D:\ActiveProject\EKT5\PKMT_NONBIOS\InvertorCntrl\ISPprg")
      13              $C$DW$1 .dwtag  DW_TAG_variable, DW_AT_name("PieCtrlRegs")
      14                      .dwattr $C$DW$1, DW_AT_TI_symbol_name("_PieCtrlRegs")
      15                      .dwattr $C$DW$1, DW_AT_type(*$C$DW$T$30)

TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:24 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0594010                           PAGE   88

    4514 000003ef       $C$L75:    
    4515 000003ef 6F00          B         $C$L75,UNC            ; [CPU_] |794| 
    4516                      ; branch occurs ; [] |794| 
    4517                      .dwattr $C$DW$80, DW_AT_TI_end_file("../DSP2833x_headers/source/DefaultIsr_nonBIOS.c")
    4518                      .dwattr $C$DW$80, DW_AT_TI_end_line(0x31b)
    4519                      .dwattr $C$DW$80, DW_AT_TI_end_column(0x01)
    4520                      .dwendentry
    4521                      .dwendtag $C$DW$80
    4522              
    4523 000003f0               .sect   ".text:retain"
    4524                      .retain
    4525                      .retainrefs
    4526                      .global _rsvd_ISR
    4527              
    4528              $C$DW$81        .dwtag  DW_TAG_subprogram, DW_AT_name("rsvd_ISR")
    4529                      .dwattr $C$DW$81, DW_AT_low_pc(_rsvd_ISR)
    4530                      .dwattr $C$DW$81, DW_AT_high_pc(0x00)
    4531                      .dwattr $C$DW$81, DW_AT_TI_symbol_name("_rsvd_ISR")
    4532                      .dwattr $C$DW$81, DW_AT_external
    4533                      .dwattr $C$DW$81, DW_AT_TI_begin_file("../DSP2833x_headers/source/DefaultIsr_nonBIOS.c")
    4534                      .dwattr $C$DW$81, DW_AT_TI_begin_line(0x31e)
    4535                      .dwattr $C$DW$81, DW_AT_TI_begin_column(0x10)
    4536                      .dwattr $C$DW$81, DW_AT_TI_interrupt
    4537                      .dwattr $C$DW$81, DW_AT_TI_max_frame_size(-6)
    4538                      .dwpsn  file "../DSP2833x_headers/source/DefaultIsr_nonBIOS.c",line 799,column 1,is_stmt,address _rsv
    4539              
    4540                      .dwfde $C$DW$CIE, _rsvd_ISR
    4541              
    4542              ;***************************************************************
    4543              ;* FNAME: _rsvd_ISR                     FR SIZE:   4           *
    4544              ;*                                                             *
    4545              ;* FUNCTION ENVIRONMENT                                        *
    4546              ;*                                                             *
    4547              ;* FUNCTION PROPERTIES                                         *
    4548              ;*                            0 Parameter,  0 Auto,  4 SOE     *
    4549              ;***************************************************************
    4550              
    4551 000003f0       _rsvd_ISR:
    4552                      .dwcfi  cfa_offset, -2
    4553                      .dwcfi  save_reg_to_mem, 26, 0
    4554                      .dwcfi  save_reg_to_reg, 78, 26
    4555 000003f0 761B          ASP       ; [CPU_] 
    4556 000003f1 FFF0          PUSH      RB                    ; [CPU_] 
    4557                      .dwcfi  save_reg_to_mem, 73, 2
    4558                      .dwcfi  save_reg_to_mem, 74, 3
    4559                      .dwcfi  cfa_offset, -4
    4560 000003f2 E200          MOV32     *SP++,STF             ; [CPU_] 
         000003f3 00BD 
    4561                      .dwcfi  save_reg_to_mem, 39, 4
    4562                      .dwcfi  save_reg_to_mem, 40, 5
    4563                      .dwcfi  cfa_offset, -6
    4564 000003f4 E630          SETFLG    RNDF32=1, RNDF64=1    ; [CPU_] 
         000003f5 0600 
    4565 000003f6 2942          CLRC      PAGE0,OVM             ; [CPU_] 
    4566 000003f7 5616          CLRC      AMODE                 ; [CPU_] 
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:24 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0594010                           PAGE   89

    4567                      .dwpsn  file "../DSP2833x_headers/source/DefaultIsr_nonBIOS.c",line 804,column 2,is_stmt
    4568 000003f8 7625   ESTOP0
    4569                      .dwpsn  file "../DSP2833x_headers/source/DefaultIsr_nonBIOS.c",line 805,column 8,is_stmt
    4570 000003f9       $C$L76:    
    4571 000003f9 6F00          B         $C$L76,UNC            ; [CPU_] |805| 
    4572                      ; branch occurs ; [] |805| 
    4573                      .dwattr $C$DW$81, DW_AT_TI_end_file("../DSP2833x_headers/source/DefaultIsr_nonBIOS.c")
    4574                      .dwattr $C$DW$81, DW_AT_TI_end_line(0x326)
    4575                      .dwattr $C$DW$81, DW_AT_TI_end_column(0x01)
    4576                      .dwendentry
    4577                      .dwendtag $C$DW$81
    4578              
    4579              ;**************************************************************
    4580              ;* UNDEFINED EXTERNAL REFERENCES                              *
    4581              ;**************************************************************
    4582                      .global _PieCtrlRegs
    4583              
    4584              ;***************************************************************
    4585              ;* TYPE INFORMATION                                            *
    4586              ;***************************************************************
    4587              
    4588              $C$DW$T$20      .dwtag  DW_TAG_structure_type
    4589                      .dwattr $C$DW$T$20, DW_AT_name("PIEACK_BITS")
    4590                      .dwattr $C$DW$T$20, DW_AT_byte_size(0x01)
    4591              $C$DW$82        .dwtag  DW_TAG_member
    4592                      .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$19)
    4593                      .dwattr $C$DW$82, DW_AT_name("ACK1")
    4594                      .dwattr $C$DW$82, DW_AT_TI_symbol_name("_ACK1")
    4595                      .dwattr $C$DW$82, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    4596                      .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4597                      .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
    4598              $C$DW$83        .dwtag  DW_TAG_member
    4599                      .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$19)
    4600                      .dwattr $C$DW$83, DW_AT_name("ACK2")
    4601                      .dwattr $C$DW$83, DW_AT_TI_symbol_name("_ACK2")
    4602                      .dwattr $C$DW$83, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    4603                      .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4604                      .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
    4605              $C$DW$84        .dwtag  DW_TAG_member
    4606                      .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$19)
    4607                      .dwattr $C$DW$84, DW_AT_name("ACK3")
    4608                      .dwattr $C$DW$84, DW_AT_TI_symbol_name("_ACK3")
    4609                      .dwattr $C$DW$84, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    4610                      .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4611                      .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
    4612              $C$DW$85        .dwtag  DW_TAG_member
    4613                      .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$19)
    4614                      .dwattr $C$DW$85, DW_AT_name("ACK4")
    4615                      .dwattr $C$DW$85, DW_AT_TI_symbol_name("_ACK4")
    4616                      .dwattr $C$DW$85, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    4617                      .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4618                      .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
    4619              $C$DW$86        .dwtag  DW_TAG_member
    4620                      .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$19)
    4621                      .dwattr $C$DW$86, DW_AT_name("ACK5")
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:24 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0594010                           PAGE   90

    4622                      .dwattr $C$DW$86, DW_AT_TI_symbol_name("_ACK5")
    4623                      .dwattr $C$DW$86, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    4624                      .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4625                      .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
    4626              $C$DW$87        .dwtag  DW_TAG_member
    4627                      .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$19)
    4628                      .dwattr $C$DW$87, DW_AT_name("ACK6")
    4629                      .dwattr $C$DW$87, DW_AT_TI_symbol_name("_ACK6")
    4630                      .dwattr $C$DW$87, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    4631                      .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4632                      .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
    4633              $C$DW$88        .dwtag  DW_TAG_member
    4634                      .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$19)
    4635                      .dwattr $C$DW$88, DW_AT_name("ACK7")
    4636                      .dwattr $C$DW$88, DW_AT_TI_symbol_name("_ACK7")
    4637                      .dwattr $C$DW$88, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    4638                      .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4639                      .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
    4640              $C$DW$89        .dwtag  DW_TAG_member
    4641                      .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$19)
    4642                      .dwattr $C$DW$89, DW_AT_name("ACK8")
    4643                      .dwattr $C$DW$89, DW_AT_TI_symbol_name("_ACK8")
    4644                      .dwattr $C$DW$89, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    4645                      .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4646                      .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
    4647              $C$DW$90        .dwtag  DW_TAG_member
    4648                      .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$19)
    4649                      .dwattr $C$DW$90, DW_AT_name("ACK9")
    4650                      .dwattr $C$DW$90, DW_AT_TI_symbol_name("_ACK9")
    4651                      .dwattr $C$DW$90, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
    4652                      .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4653                      .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
    4654              $C$DW$91        .dwtag  DW_TAG_member
    4655                      .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$19)
    4656                      .dwattr $C$DW$91, DW_AT_name("ACK10")
    4657                      .dwattr $C$DW$91, DW_AT_TI_symbol_name("_ACK10")
    4658                      .dwattr $C$DW$91, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    4659                      .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4660                      .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
    4661              $C$DW$92        .dwtag  DW_TAG_member
    4662                      .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$19)
    4663                      .dwattr $C$DW$92, DW_AT_name("ACK11")
    4664                      .dwattr $C$DW$92, DW_AT_TI_symbol_name("_ACK11")
    4665                      .dwattr $C$DW$92, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
    4666                      .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4667                      .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
    4668              $C$DW$93        .dwtag  DW_TAG_member
    4669                      .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$19)
    4670                      .dwattr $C$DW$93, DW_AT_name("ACK12")
    4671                      .dwattr $C$DW$93, DW_AT_TI_symbol_name("_ACK12")
    4672                      .dwattr $C$DW$93, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
    4673                      .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4674                      .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
    4675              $C$DW$94        .dwtag  DW_TAG_member
    4676                      .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:24 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0594010                           PAGE   91

    4677                      .dwattr $C$DW$94, DW_AT_name("rsvd")
    4678                      .dwattr $C$DW$94, DW_AT_TI_symbol_name("_rsvd")
    4679                      .dwattr $C$DW$94, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x04)
    4680                      .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4681                      .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
    4682                      .dwendtag $C$DW$T$20
    4683              
    4684              
    4685              $C$DW$T$21      .dwtag  DW_TAG_union_type
    4686                      .dwattr $C$DW$T$21, DW_AT_name("PIEACK_REG")
    4687                      .dwattr $C$DW$T$21, DW_AT_byte_size(0x01)
    4688              $C$DW$95        .dwtag  DW_TAG_member
    4689                      .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$19)
    4690                      .dwattr $C$DW$95, DW_AT_name("all")
    4691                      .dwattr $C$DW$95, DW_AT_TI_symbol_name("_all")
    4692                      .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4693                      .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
    4694              $C$DW$96        .dwtag  DW_TAG_member
    4695                      .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$20)
    4696                      .dwattr $C$DW$96, DW_AT_name("bit")
    4697                      .dwattr $C$DW$96, DW_AT_TI_symbol_name("_bit")
    4698                      .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4699                      .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
    4700                      .dwendtag $C$DW$T$21
    4701              
    4702              
    4703              $C$DW$T$22      .dwtag  DW_TAG_structure_type
    4704                      .dwattr $C$DW$T$22, DW_AT_name("PIECTRL_BITS")
    4705                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x01)
    4706              $C$DW$97        .dwtag  DW_TAG_member
    4707                      .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$19)
    4708                      .dwattr $C$DW$97, DW_AT_name("ENPIE")
    4709                      .dwattr $C$DW$97, DW_AT_TI_symbol_name("_ENPIE")
    4710                      .dwattr $C$DW$97, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    4711                      .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4712                      .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
    4713              $C$DW$98        .dwtag  DW_TAG_member
    4714                      .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$19)
    4715                      .dwattr $C$DW$98, DW_AT_name("PIEVECT")
    4716                      .dwattr $C$DW$98, DW_AT_TI_symbol_name("_PIEVECT")
    4717                      .dwattr $C$DW$98, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0f)
    4718                      .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4719                      .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
    4720                      .dwendtag $C$DW$T$22
    4721              
    4722              
    4723              $C$DW$T$23      .dwtag  DW_TAG_union_type
    4724                      .dwattr $C$DW$T$23, DW_AT_name("PIECTRL_REG")
    4725                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x01)
    4726              $C$DW$99        .dwtag  DW_TAG_member
    4727                      .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$19)
    4728                      .dwattr $C$DW$99, DW_AT_name("all")
    4729                      .dwattr $C$DW$99, DW_AT_TI_symbol_name("_all")
    4730                      .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4731                      .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:24 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0594010                           PAGE   92

    4732              $C$DW$100       .dwtag  DW_TAG_member
    4733                      .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$22)
    4734                      .dwattr $C$DW$100, DW_AT_name("bit")
    4735                      .dwattr $C$DW$100, DW_AT_TI_symbol_name("_bit")
    4736                      .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4737                      .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
    4738                      .dwendtag $C$DW$T$23
    4739              
    4740              
    4741              $C$DW$T$24      .dwtag  DW_TAG_structure_type
    4742                      .dwattr $C$DW$T$24, DW_AT_name("PIEIER_BITS")
    4743                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x01)
    4744              $C$DW$101       .dwtag  DW_TAG_member
    4745                      .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$19)
    4746                      .dwattr $C$DW$101, DW_AT_name("INTx1")
    4747                      .dwattr $C$DW$101, DW_AT_TI_symbol_name("_INTx1")
    4748                      .dwattr $C$DW$101, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    4749                      .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4750                      .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
    4751              $C$DW$102       .dwtag  DW_TAG_member
    4752                      .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$19)
    4753                      .dwattr $C$DW$102, DW_AT_name("INTx2")
    4754                      .dwattr $C$DW$102, DW_AT_TI_symbol_name("_INTx2")
    4755                      .dwattr $C$DW$102, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    4756                      .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4757                      .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
    4758              $C$DW$103       .dwtag  DW_TAG_member
    4759                      .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$19)
    4760                      .dwattr $C$DW$103, DW_AT_name("INTx3")
    4761                      .dwattr $C$DW$103, DW_AT_TI_symbol_name("_INTx3")
    4762                      .dwattr $C$DW$103, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    4763                      .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4764                      .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
    4765              $C$DW$104       .dwtag  DW_TAG_member
    4766                      .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$19)
    4767                      .dwattr $C$DW$104, DW_AT_name("INTx4")
    4768                      .dwattr $C$DW$104, DW_AT_TI_symbol_name("_INTx4")
    4769                      .dwattr $C$DW$104, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    4770                      .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4771                      .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
    4772              $C$DW$105       .dwtag  DW_TAG_member
    4773                      .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$19)
    4774                      .dwattr $C$DW$105, DW_AT_name("INTx5")
    4775                      .dwattr $C$DW$105, DW_AT_TI_symbol_name("_INTx5")
    4776                      .dwattr $C$DW$105, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    4777                      .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4778                      .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
    4779              $C$DW$106       .dwtag  DW_TAG_member
    4780                      .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$19)
    4781                      .dwattr $C$DW$106, DW_AT_name("INTx6")
    4782                      .dwattr $C$DW$106, DW_AT_TI_symbol_name("_INTx6")
    4783                      .dwattr $C$DW$106, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    4784                      .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4785                      .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    4786              $C$DW$107       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:24 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0594010                           PAGE   93

    4787                      .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$19)
    4788                      .dwattr $C$DW$107, DW_AT_name("INTx7")
    4789                      .dwattr $C$DW$107, DW_AT_TI_symbol_name("_INTx7")
    4790                      .dwattr $C$DW$107, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    4791                      .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4792                      .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
    4793              $C$DW$108       .dwtag  DW_TAG_member
    4794                      .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$19)
    4795                      .dwattr $C$DW$108, DW_AT_name("INTx8")
    4796                      .dwattr $C$DW$108, DW_AT_TI_symbol_name("_INTx8")
    4797                      .dwattr $C$DW$108, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    4798                      .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4799                      .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    4800              $C$DW$109       .dwtag  DW_TAG_member
    4801                      .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$19)
    4802                      .dwattr $C$DW$109, DW_AT_name("rsvd")
    4803                      .dwattr $C$DW$109, DW_AT_TI_symbol_name("_rsvd")
    4804                      .dwattr $C$DW$109, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x08)
    4805                      .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4806                      .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    4807                      .dwendtag $C$DW$T$24
    4808              
    4809              
    4810              $C$DW$T$25      .dwtag  DW_TAG_union_type
    4811                      .dwattr $C$DW$T$25, DW_AT_name("PIEIER_REG")
    4812                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x01)
    4813              $C$DW$110       .dwtag  DW_TAG_member
    4814                      .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$19)
    4815                      .dwattr $C$DW$110, DW_AT_name("all")
    4816                      .dwattr $C$DW$110, DW_AT_TI_symbol_name("_all")
    4817                      .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4818                      .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    4819              $C$DW$111       .dwtag  DW_TAG_member
    4820                      .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$24)
    4821                      .dwattr $C$DW$111, DW_AT_name("bit")
    4822                      .dwattr $C$DW$111, DW_AT_TI_symbol_name("_bit")
    4823                      .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4824                      .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    4825                      .dwendtag $C$DW$T$25
    4826              
    4827              
    4828              $C$DW$T$26      .dwtag  DW_TAG_structure_type
    4829                      .dwattr $C$DW$T$26, DW_AT_name("PIEIFR_BITS")
    4830                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x01)
    4831              $C$DW$112       .dwtag  DW_TAG_member
    4832                      .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$19)
    4833                      .dwattr $C$DW$112, DW_AT_name("INTx1")
    4834                      .dwattr $C$DW$112, DW_AT_TI_symbol_name("_INTx1")
    4835                      .dwattr $C$DW$112, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    4836                      .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4837                      .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    4838              $C$DW$113       .dwtag  DW_TAG_member
    4839                      .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$19)
    4840                      .dwattr $C$DW$113, DW_AT_name("INTx2")
    4841                      .dwattr $C$DW$113, DW_AT_TI_symbol_name("_INTx2")
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:24 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0594010                           PAGE   94

    4842                      .dwattr $C$DW$113, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    4843                      .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4844                      .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    4845              $C$DW$114       .dwtag  DW_TAG_member
    4846                      .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$19)
    4847                      .dwattr $C$DW$114, DW_AT_name("INTx3")
    4848                      .dwattr $C$DW$114, DW_AT_TI_symbol_name("_INTx3")
    4849                      .dwattr $C$DW$114, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    4850                      .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4851                      .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    4852              $C$DW$115       .dwtag  DW_TAG_member
    4853                      .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$19)
    4854                      .dwattr $C$DW$115, DW_AT_name("INTx4")
    4855                      .dwattr $C$DW$115, DW_AT_TI_symbol_name("_INTx4")
    4856                      .dwattr $C$DW$115, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    4857                      .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4858                      .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    4859              $C$DW$116       .dwtag  DW_TAG_member
    4860                      .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$19)
    4861                      .dwattr $C$DW$116, DW_AT_name("INTx5")
    4862                      .dwattr $C$DW$116, DW_AT_TI_symbol_name("_INTx5")
    4863                      .dwattr $C$DW$116, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    4864                      .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4865                      .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    4866              $C$DW$117       .dwtag  DW_TAG_member
    4867                      .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$19)
    4868                      .dwattr $C$DW$117, DW_AT_name("INTx6")
    4869                      .dwattr $C$DW$117, DW_AT_TI_symbol_name("_INTx6")
    4870                      .dwattr $C$DW$117, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    4871                      .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4872                      .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    4873              $C$DW$118       .dwtag  DW_TAG_member
    4874                      .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$19)
    4875                      .dwattr $C$DW$118, DW_AT_name("INTx7")
    4876                      .dwattr $C$DW$118, DW_AT_TI_symbol_name("_INTx7")
    4877                      .dwattr $C$DW$118, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    4878                      .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4879                      .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    4880              $C$DW$119       .dwtag  DW_TAG_member
    4881                      .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$19)
    4882                      .dwattr $C$DW$119, DW_AT_name("INTx8")
    4883                      .dwattr $C$DW$119, DW_AT_TI_symbol_name("_INTx8")
    4884                      .dwattr $C$DW$119, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    4885                      .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4886                      .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    4887              $C$DW$120       .dwtag  DW_TAG_member
    4888                      .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$19)
    4889                      .dwattr $C$DW$120, DW_AT_name("rsvd")
    4890                      .dwattr $C$DW$120, DW_AT_TI_symbol_name("_rsvd")
    4891                      .dwattr $C$DW$120, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x08)
    4892                      .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4893                      .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    4894                      .dwendtag $C$DW$T$26
    4895              
    4896              
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:24 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0594010                           PAGE   95

    4897              $C$DW$T$27      .dwtag  DW_TAG_union_type
    4898                      .dwattr $C$DW$T$27, DW_AT_name("PIEIFR_REG")
    4899                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x01)
    4900              $C$DW$121       .dwtag  DW_TAG_member
    4901                      .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$19)
    4902                      .dwattr $C$DW$121, DW_AT_name("all")
    4903                      .dwattr $C$DW$121, DW_AT_TI_symbol_name("_all")
    4904                      .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4905                      .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    4906              $C$DW$122       .dwtag  DW_TAG_member
    4907                      .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$26)
    4908                      .dwattr $C$DW$122, DW_AT_name("bit")
    4909                      .dwattr $C$DW$122, DW_AT_TI_symbol_name("_bit")
    4910                      .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4911                      .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    4912                      .dwendtag $C$DW$T$27
    4913              
    4914              
    4915              $C$DW$T$28      .dwtag  DW_TAG_structure_type
    4916                      .dwattr $C$DW$T$28, DW_AT_name("PIE_CTRL_REGS")
    4917                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x1a)
    4918              $C$DW$123       .dwtag  DW_TAG_member
    4919                      .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$23)
    4920                      .dwattr $C$DW$123, DW_AT_name("PIECTRL")
    4921                      .dwattr $C$DW$123, DW_AT_TI_symbol_name("_PIECTRL")
    4922                      .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4923                      .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    4924              $C$DW$124       .dwtag  DW_TAG_member
    4925                      .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$21)
    4926                      .dwattr $C$DW$124, DW_AT_name("PIEACK")
    4927                      .dwattr $C$DW$124, DW_AT_TI_symbol_name("_PIEACK")
    4928                      .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    4929                      .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    4930              $C$DW$125       .dwtag  DW_TAG_member
    4931                      .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$25)
    4932                      .dwattr $C$DW$125, DW_AT_name("PIEIER1")
    4933                      .dwattr $C$DW$125, DW_AT_TI_symbol_name("_PIEIER1")
    4934                      .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    4935                      .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    4936              $C$DW$126       .dwtag  DW_TAG_member
    4937                      .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$27)
    4938                      .dwattr $C$DW$126, DW_AT_name("PIEIFR1")
    4939                      .dwattr $C$DW$126, DW_AT_TI_symbol_name("_PIEIFR1")
    4940                      .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    4941                      .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    4942              $C$DW$127       .dwtag  DW_TAG_member
    4943                      .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$25)
    4944                      .dwattr $C$DW$127, DW_AT_name("PIEIER2")
    4945                      .dwattr $C$DW$127, DW_AT_TI_symbol_name("_PIEIER2")
    4946                      .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4947                      .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    4948              $C$DW$128       .dwtag  DW_TAG_member
    4949                      .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$27)
    4950                      .dwattr $C$DW$128, DW_AT_name("PIEIFR2")
    4951                      .dwattr $C$DW$128, DW_AT_TI_symbol_name("_PIEIFR2")
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:24 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0594010                           PAGE   96

    4952                      .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    4953                      .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    4954              $C$DW$129       .dwtag  DW_TAG_member
    4955                      .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$25)
    4956                      .dwattr $C$DW$129, DW_AT_name("PIEIER3")
    4957                      .dwattr $C$DW$129, DW_AT_TI_symbol_name("_PIEIER3")
    4958                      .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    4959                      .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    4960              $C$DW$130       .dwtag  DW_TAG_member
    4961                      .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$27)
    4962                      .dwattr $C$DW$130, DW_AT_name("PIEIFR3")
    4963                      .dwattr $C$DW$130, DW_AT_TI_symbol_name("_PIEIFR3")
    4964                      .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    4965                      .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    4966              $C$DW$131       .dwtag  DW_TAG_member
    4967                      .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$25)
    4968                      .dwattr $C$DW$131, DW_AT_name("PIEIER4")
    4969                      .dwattr $C$DW$131, DW_AT_TI_symbol_name("_PIEIER4")
    4970                      .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4971                      .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    4972              $C$DW$132       .dwtag  DW_TAG_member
    4973                      .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$27)
    4974                      .dwattr $C$DW$132, DW_AT_name("PIEIFR4")
    4975                      .dwattr $C$DW$132, DW_AT_TI_symbol_name("_PIEIFR4")
    4976                      .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    4977                      .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    4978              $C$DW$133       .dwtag  DW_TAG_member
    4979                      .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$25)
    4980                      .dwattr $C$DW$133, DW_AT_name("PIEIER5")
    4981                      .dwattr $C$DW$133, DW_AT_TI_symbol_name("_PIEIER5")
    4982                      .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    4983                      .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    4984              $C$DW$134       .dwtag  DW_TAG_member
    4985                      .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$27)
    4986                      .dwattr $C$DW$134, DW_AT_name("PIEIFR5")
    4987                      .dwattr $C$DW$134, DW_AT_TI_symbol_name("_PIEIFR5")
    4988                      .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    4989                      .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    4990              $C$DW$135       .dwtag  DW_TAG_member
    4991                      .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$25)
    4992                      .dwattr $C$DW$135, DW_AT_name("PIEIER6")
    4993                      .dwattr $C$DW$135, DW_AT_TI_symbol_name("_PIEIER6")
    4994                      .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4995                      .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    4996              $C$DW$136       .dwtag  DW_TAG_member
    4997                      .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$27)
    4998                      .dwattr $C$DW$136, DW_AT_name("PIEIFR6")
    4999                      .dwattr $C$DW$136, DW_AT_TI_symbol_name("_PIEIFR6")
    5000                      .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    5001                      .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    5002              $C$DW$137       .dwtag  DW_TAG_member
    5003                      .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$25)
    5004                      .dwattr $C$DW$137, DW_AT_name("PIEIER7")
    5005                      .dwattr $C$DW$137, DW_AT_TI_symbol_name("_PIEIER7")
    5006                      .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:24 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0594010                           PAGE   97

    5007                      .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    5008              $C$DW$138       .dwtag  DW_TAG_member
    5009                      .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$27)
    5010                      .dwattr $C$DW$138, DW_AT_name("PIEIFR7")
    5011                      .dwattr $C$DW$138, DW_AT_TI_symbol_name("_PIEIFR7")
    5012                      .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
    5013                      .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    5014              $C$DW$139       .dwtag  DW_TAG_member
    5015                      .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$25)
    5016                      .dwattr $C$DW$139, DW_AT_name("PIEIER8")
    5017                      .dwattr $C$DW$139, DW_AT_TI_symbol_name("_PIEIER8")
    5018                      .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    5019                      .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    5020              $C$DW$140       .dwtag  DW_TAG_member
    5021                      .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$27)
    5022                      .dwattr $C$DW$140, DW_AT_name("PIEIFR8")
    5023                      .dwattr $C$DW$140, DW_AT_TI_symbol_name("_PIEIFR8")
    5024                      .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    5025                      .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    5026              $C$DW$141       .dwtag  DW_TAG_member
    5027                      .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$25)
    5028                      .dwattr $C$DW$141, DW_AT_name("PIEIER9")
    5029                      .dwattr $C$DW$141, DW_AT_TI_symbol_name("_PIEIER9")
    5030                      .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    5031                      .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    5032              $C$DW$142       .dwtag  DW_TAG_member
    5033                      .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$27)
    5034                      .dwattr $C$DW$142, DW_AT_name("PIEIFR9")
    5035                      .dwattr $C$DW$142, DW_AT_TI_symbol_name("_PIEIFR9")
    5036                      .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x13]
    5037                      .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    5038              $C$DW$143       .dwtag  DW_TAG_member
    5039                      .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$25)
    5040                      .dwattr $C$DW$143, DW_AT_name("PIEIER10")
    5041                      .dwattr $C$DW$143, DW_AT_TI_symbol_name("_PIEIER10")
    5042                      .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    5043                      .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    5044              $C$DW$144       .dwtag  DW_TAG_member
    5045                      .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$27)
    5046                      .dwattr $C$DW$144, DW_AT_name("PIEIFR10")
    5047                      .dwattr $C$DW$144, DW_AT_TI_symbol_name("_PIEIFR10")
    5048                      .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    5049                      .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    5050              $C$DW$145       .dwtag  DW_TAG_member
    5051                      .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$25)
    5052                      .dwattr $C$DW$145, DW_AT_name("PIEIER11")
    5053                      .dwattr $C$DW$145, DW_AT_TI_symbol_name("_PIEIER11")
    5054                      .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    5055                      .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    5056              $C$DW$146       .dwtag  DW_TAG_member
    5057                      .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$27)
    5058                      .dwattr $C$DW$146, DW_AT_name("PIEIFR11")
    5059                      .dwattr $C$DW$146, DW_AT_TI_symbol_name("_PIEIFR11")
    5060                      .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
    5061                      .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:24 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0594010                           PAGE   98

    5062              $C$DW$147       .dwtag  DW_TAG_member
    5063                      .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$25)
    5064                      .dwattr $C$DW$147, DW_AT_name("PIEIER12")
    5065                      .dwattr $C$DW$147, DW_AT_TI_symbol_name("_PIEIER12")
    5066                      .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    5067                      .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
    5068              $C$DW$148       .dwtag  DW_TAG_member
    5069                      .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$27)
    5070                      .dwattr $C$DW$148, DW_AT_name("PIEIFR12")
    5071                      .dwattr $C$DW$148, DW_AT_TI_symbol_name("_PIEIFR12")
    5072                      .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
    5073                      .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    5074                      .dwendtag $C$DW$T$28
    5075              
    5076              $C$DW$149       .dwtag  DW_TAG_TI_far_type
    5077                      .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$28)
    5078              $C$DW$T$30      .dwtag  DW_TAG_volatile_type
    5079                      .dwattr $C$DW$T$30, DW_AT_type(*$C$DW$149)
    5080              $C$DW$T$4       .dwtag  DW_TAG_base_type
    5081                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    5082                      .dwattr $C$DW$T$4, DW_AT_name("bool")
    5083                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    5084              $C$DW$T$5       .dwtag  DW_TAG_base_type
    5085                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    5086                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
    5087                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    5088              $C$DW$T$6       .dwtag  DW_TAG_base_type
    5089                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    5090                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    5091                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
    5092              $C$DW$T$7       .dwtag  DW_TAG_base_type
    5093                      .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
    5094                      .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
    5095                      .dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
    5096              $C$DW$T$8       .dwtag  DW_TAG_base_type
    5097                      .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
    5098                      .dwattr $C$DW$T$8, DW_AT_name("short")
    5099                      .dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
    5100              $C$DW$T$9       .dwtag  DW_TAG_base_type
    5101                      .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
    5102                      .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
    5103                      .dwattr $C$DW$T$9, DW_AT_byte_size(0x01)
    5104              $C$DW$T$10      .dwtag  DW_TAG_base_type
    5105                      .dwattr $C$DW$T$10, DW_AT_encoding(DW_ATE_signed)
    5106                      .dwattr $C$DW$T$10, DW_AT_name("int")
    5107                      .dwattr $C$DW$T$10, DW_AT_byte_size(0x01)
    5108              $C$DW$T$11      .dwtag  DW_TAG_base_type
    5109                      .dwattr $C$DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
    5110                      .dwattr $C$DW$T$11, DW_AT_name("unsigned int")
    5111                      .dwattr $C$DW$T$11, DW_AT_byte_size(0x01)
    5112              $C$DW$T$19      .dwtag  DW_TAG_typedef, DW_AT_name("Uint16")
    5113                      .dwattr $C$DW$T$19, DW_AT_type(*$C$DW$T$11)
    5114                      .dwattr $C$DW$T$19, DW_AT_language(DW_LANG_C)
    5115              $C$DW$T$12      .dwtag  DW_TAG_base_type
    5116                      .dwattr $C$DW$T$12, DW_AT_encoding(DW_ATE_signed)
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:24 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0594010                           PAGE   99

    5117                      .dwattr $C$DW$T$12, DW_AT_name("long")
    5118                      .dwattr $C$DW$T$12, DW_AT_byte_size(0x02)
    5119              $C$DW$T$13      .dwtag  DW_TAG_base_type
    5120                      .dwattr $C$DW$T$13, DW_AT_encoding(DW_ATE_unsigned)
    5121                      .dwattr $C$DW$T$13, DW_AT_name("unsigned long")
    5122                      .dwattr $C$DW$T$13, DW_AT_byte_size(0x02)
    5123              $C$DW$T$14      .dwtag  DW_TAG_base_type
    5124                      .dwattr $C$DW$T$14, DW_AT_encoding(DW_ATE_signed)
