TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:22 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0440010                           PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v6.2.7 *
       3              ;* Date/Time created: Thu Jul 02 08:31:22 2015                 *
       4              ;***************************************************************
       5                      .compiler_opts --diag_wrap=off --float_support=fpu32 --hll_source=on --mem_model:code=flat --mem_mode
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("../DSP2833x_headers/source/DSP2833x_GlobalVariableDefs.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v6.2.7 Copyright (c) 1996-2014 Texas I
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("D:\ActiveProject\EKT5\PKMT_NONBIOS\InvertorCntrl\ISPprg")
      13                      .global _PartIdRegs
      14 00000000       _PartIdRegs:    .usect  "PartIdRegsFile",1,1,0
      15              $C$DW$1 .dwtag  DW_TAG_variable, DW_AT_name("PartIdRegs")

     299                      .dwattr $C$DW$41, DW_AT_external
     300                      .global _ECanbMOTORegs
     301 00000000       _ECanbMOTORegs: .usect  "ECanbMOTORegsFile",64,1,1
     302              $C$DW$42        .dwtag  DW_TAG_variable, DW_AT_name("ECanbMOTORegs")
     303                      .dwattr $C$DW$42, DW_AT_TI_symbol_name("_ECanbMOTORegs")
     304                      .dwattr $C$DW$42, DW_AT_location[DW_OP_addr _ECanbMOTORegs]
     305                      .dwattr $C$DW$42, DW_AT_type(*$C$DW$T$462)
     306                      .dwattr $C$DW$42, DW_AT_external
     307                      .global _EQep1Regs
     308 00000000       _EQep1Regs:     .usect  "EQep1RegsFile",64,1,1
     309              $C$DW$43        .dwtag  DW_TAG_variable, DW_AT_name("EQep1Regs")
     310                      .dwattr $C$DW$43, DW_AT_TI_symbol_name("_EQep1Regs")
     311                      .dwattr $C$DW$43, DW_AT_location[DW_OP_addr _EQep1Regs]
     312                      .dwattr $C$DW$43, DW_AT_type(*$C$DW$T$454)
     313                      .dwattr $C$DW$43, DW_AT_external
     314                      .global _EQep2Regs
     315 00000000       _EQep2Regs:     .usect  "EQep2RegsFile",64,1,1
     316              $C$DW$44        .dwtag  DW_TAG_variable, DW_AT_name("EQep2Regs")
     317                      .dwattr $C$DW$44, DW_AT_TI_symbol_name("_EQep2Regs")
     318                      .dwattr $C$DW$44, DW_AT_location[DW_OP_addr _EQep2Regs]
     319                      .dwattr $C$DW$44, DW_AT_type(*$C$DW$T$454)
     320                      .dwattr $C$DW$44, DW_AT_external
     321                      .global _ECanbLAMRegs
     322 00000000       _ECanbLAMRegs:  .usect  "ECanbLAMRegsFile",64,1,1
     323              $C$DW$45        .dwtag  DW_TAG_variable, DW_AT_name("ECanbLAMRegs")
     324                      .dwattr $C$DW$45, DW_AT_TI_symbol_name("_ECanbLAMRegs")
     325                      .dwattr $C$DW$45, DW_AT_location[DW_OP_addr _ECanbLAMRegs]
     326                      .dwattr $C$DW$45, DW_AT_type(*$C$DW$T$460)
     327                      .dwattr $C$DW$45, DW_AT_external
     328                      .global _DevEmuRegs
     329 00000000       _DevEmuRegs:    .usect  "DevEmuRegsFile",208,1,1
     330              $C$DW$46        .dwtag  DW_TAG_variable, DW_AT_name("DevEmuRegs")
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:22 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0440010                           PAGE    7

     331                      .dwattr $C$DW$46, DW_AT_TI_symbol_name("_DevEmuRegs")
     332                      .dwattr $C$DW$46, DW_AT_location[DW_OP_addr _DevEmuRegs]
     333                      .dwattr $C$DW$46, DW_AT_type(*$C$DW$T$448)
     334                      .dwattr $C$DW$46, DW_AT_external
     335                      .global _DmaRegs
     336 00000000       _DmaRegs:       .usect  "DmaRegsFile",224,1,1
     337              $C$DW$47        .dwtag  DW_TAG_variable, DW_AT_name("DmaRegs")
     338                      .dwattr $C$DW$47, DW_AT_TI_symbol_name("_DmaRegs")
     339                      .dwattr $C$DW$47, DW_AT_location[DW_OP_addr _DmaRegs]
     340                      .dwattr $C$DW$47, DW_AT_type(*$C$DW$T$449)
     341                      .dwattr $C$DW$47, DW_AT_external
     342                      .global _ECanbMboxes
     343 00000000       _ECanbMboxes:   .usect  "ECanbMboxesFile",256,1,1
     344              $C$DW$48        .dwtag  DW_TAG_variable, DW_AT_name("ECanbMboxes")
     345                      .dwattr $C$DW$48, DW_AT_TI_symbol_name("_ECanbMboxes")
     346                      .dwattr $C$DW$48, DW_AT_location[DW_OP_addr _ECanbMboxes]
     347                      .dwattr $C$DW$48, DW_AT_type(*$C$DW$T$450)
     348                      .dwattr $C$DW$48, DW_AT_external
     349                      .global _ECanaMboxes
     350 00000000       _ECanaMboxes:   .usect  "ECanaMboxesFile",256,1,1
     351              $C$DW$49        .dwtag  DW_TAG_variable, DW_AT_name("ECanaMboxes")
     352                      .dwattr $C$DW$49, DW_AT_TI_symbol_name("_ECanaMboxes")
     353                      .dwattr $C$DW$49, DW_AT_location[DW_OP_addr _ECanaMboxes]
     354                      .dwattr $C$DW$49, DW_AT_type(*$C$DW$T$450)
     355                      .dwattr $C$DW$49, DW_AT_external
     356                      .global _PieVectTable
     357 00000000       _PieVectTable:  .usect  "PieVectTableFile",256,1,1
     358              $C$DW$50        .dwtag  DW_TAG_variable, DW_AT_name("PieVectTable")
     359                      .dwattr $C$DW$50, DW_AT_TI_symbol_name("_PieVectTable")
     360                      .dwattr $C$DW$50, DW_AT_location[DW_OP_addr _PieVectTable]
     361                      .dwattr $C$DW$50, DW_AT_type(*$C$DW$T$287)
     362                      .dwattr $C$DW$50, DW_AT_external
     363              ;       C:\ti\ccsv6\tools\compiler\c2000_6.2.7\bin\ac2000.exe -@C:\\Users\\Tester\\AppData\\Local\\Temp\\0440
     364              
     365              ;***************************************************************
     366              ;* TYPE INFORMATION                                            *
     367              ;***************************************************************
     368              
     369              $C$DW$T$20      .dwtag  DW_TAG_structure_type
     370                      .dwattr $C$DW$T$20, DW_AT_name("ADCASEQSR_BITS")
     371                      .dwattr $C$DW$T$20, DW_AT_byte_size(0x01)
     372              $C$DW$51        .dwtag  DW_TAG_member
     373                      .dwattr $C$DW$51, DW_AT_type(*$C$DW$T$19)
     374                      .dwattr $C$DW$51, DW_AT_name("SEQ1_STATE")
     375                      .dwattr $C$DW$51, DW_AT_TI_symbol_name("_SEQ1_STATE")
     376                      .dwattr $C$DW$51, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x04)
     377                      .dwattr $C$DW$51, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     378                      .dwattr $C$DW$51, DW_AT_accessibility(DW_ACCESS_public)
     379              $C$DW$52        .dwtag  DW_TAG_member
     380                      .dwattr $C$DW$52, DW_AT_type(*$C$DW$T$19)
     381                      .dwattr $C$DW$52, DW_AT_name("SEQ2_STATE")
     382                      .dwattr $C$DW$52, DW_AT_TI_symbol_name("_SEQ2_STATE")
     383                      .dwattr $C$DW$52, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x03)
     384                      .dwattr $C$DW$52, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     385                      .dwattr $C$DW$52, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:22 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0440010                           PAGE    8

     386              $C$DW$53        .dwtag  DW_TAG_member
     387                      .dwattr $C$DW$53, DW_AT_type(*$C$DW$T$19)
     388                      .dwattr $C$DW$53, DW_AT_name("rsvd1")
     389                      .dwattr $C$DW$53, DW_AT_TI_symbol_name("_rsvd1")
     390                      .dwattr $C$DW$53, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
     391                      .dwattr $C$DW$53, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     392                      .dwattr $C$DW$53, DW_AT_accessibility(DW_ACCESS_public)
     393              $C$DW$54        .dwtag  DW_TAG_member
     394                      .dwattr $C$DW$54, DW_AT_type(*$C$DW$T$19)
     395                      .dwattr $C$DW$54, DW_AT_name("SEQ_CNTR")
     396                      .dwattr $C$DW$54, DW_AT_TI_symbol_name("_SEQ_CNTR")
     397                      .dwattr $C$DW$54, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x04)
     398                      .dwattr $C$DW$54, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     399                      .dwattr $C$DW$54, DW_AT_accessibility(DW_ACCESS_public)
     400              $C$DW$55        .dwtag  DW_TAG_member
     401                      .dwattr $C$DW$55, DW_AT_type(*$C$DW$T$19)
     402                      .dwattr $C$DW$55, DW_AT_name("rsvd2")
     403                      .dwattr $C$DW$55, DW_AT_TI_symbol_name("_rsvd2")
     404                      .dwattr $C$DW$55, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x04)
     405                      .dwattr $C$DW$55, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     406                      .dwattr $C$DW$55, DW_AT_accessibility(DW_ACCESS_public)
     407                      .dwendtag $C$DW$T$20
     408              
     409              
     410              $C$DW$T$21      .dwtag  DW_TAG_union_type
     411                      .dwattr $C$DW$T$21, DW_AT_name("ADCASEQSR_REG")
     412                      .dwattr $C$DW$T$21, DW_AT_byte_size(0x01)
     413              $C$DW$56        .dwtag  DW_TAG_member
     414                      .dwattr $C$DW$56, DW_AT_type(*$C$DW$T$19)
     415                      .dwattr $C$DW$56, DW_AT_name("all")
     416                      .dwattr $C$DW$56, DW_AT_TI_symbol_name("_all")
     417                      .dwattr $C$DW$56, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     418                      .dwattr $C$DW$56, DW_AT_accessibility(DW_ACCESS_public)
     419              $C$DW$57        .dwtag  DW_TAG_member
     420                      .dwattr $C$DW$57, DW_AT_type(*$C$DW$T$20)
     421                      .dwattr $C$DW$57, DW_AT_name("bit")
     422                      .dwattr $C$DW$57, DW_AT_TI_symbol_name("_bit")
     423                      .dwattr $C$DW$57, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     424                      .dwattr $C$DW$57, DW_AT_accessibility(DW_ACCESS_public)
     425                      .dwendtag $C$DW$T$21
     426              
     427              
     428              $C$DW$T$22      .dwtag  DW_TAG_structure_type
     429                      .dwattr $C$DW$T$22, DW_AT_name("ADCCHSELSEQ1_BITS")
     430                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x01)
     431              $C$DW$58        .dwtag  DW_TAG_member
     432                      .dwattr $C$DW$58, DW_AT_type(*$C$DW$T$19)
     433                      .dwattr $C$DW$58, DW_AT_name("CONV00")
     434                      .dwattr $C$DW$58, DW_AT_TI_symbol_name("_CONV00")
     435                      .dwattr $C$DW$58, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x04)
     436                      .dwattr $C$DW$58, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     437                      .dwattr $C$DW$58, DW_AT_accessibility(DW_ACCESS_public)
     438              $C$DW$59        .dwtag  DW_TAG_member
     439                      .dwattr $C$DW$59, DW_AT_type(*$C$DW$T$19)
     440                      .dwattr $C$DW$59, DW_AT_name("CONV01")
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:22 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0440010                           PAGE    9

     441                      .dwattr $C$DW$59, DW_AT_TI_symbol_name("_CONV01")
     442                      .dwattr $C$DW$59, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x04)
     443                      .dwattr $C$DW$59, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     444                      .dwattr $C$DW$59, DW_AT_accessibility(DW_ACCESS_public)
     445              $C$DW$60        .dwtag  DW_TAG_member
     446                      .dwattr $C$DW$60, DW_AT_type(*$C$DW$T$19)
     447                      .dwattr $C$DW$60, DW_AT_name("CONV02")
     448                      .dwattr $C$DW$60, DW_AT_TI_symbol_name("_CONV02")
     449                      .dwattr $C$DW$60, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x04)
     450                      .dwattr $C$DW$60, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     451                      .dwattr $C$DW$60, DW_AT_accessibility(DW_ACCESS_public)
     452              $C$DW$61        .dwtag  DW_TAG_member
     453                      .dwattr $C$DW$61, DW_AT_type(*$C$DW$T$19)
     454                      .dwattr $C$DW$61, DW_AT_name("CONV03")
     455                      .dwattr $C$DW$61, DW_AT_TI_symbol_name("_CONV03")
     456                      .dwattr $C$DW$61, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x04)
     457                      .dwattr $C$DW$61, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     458                      .dwattr $C$DW$61, DW_AT_accessibility(DW_ACCESS_public)
     459                      .dwendtag $C$DW$T$22
     460              
     461              
     462              $C$DW$T$23      .dwtag  DW_TAG_union_type
     463                      .dwattr $C$DW$T$23, DW_AT_name("ADCCHSELSEQ1_REG")
     464                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x01)
     465              $C$DW$62        .dwtag  DW_TAG_member
     466                      .dwattr $C$DW$62, DW_AT_type(*$C$DW$T$19)
     467                      .dwattr $C$DW$62, DW_AT_name("all")
     468                      .dwattr $C$DW$62, DW_AT_TI_symbol_name("_all")
     469                      .dwattr $C$DW$62, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     470                      .dwattr $C$DW$62, DW_AT_accessibility(DW_ACCESS_public)
     471              $C$DW$63        .dwtag  DW_TAG_member
     472                      .dwattr $C$DW$63, DW_AT_type(*$C$DW$T$22)
     473                      .dwattr $C$DW$63, DW_AT_name("bit")
     474                      .dwattr $C$DW$63, DW_AT_TI_symbol_name("_bit")
     475                      .dwattr $C$DW$63, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     476                      .dwattr $C$DW$63, DW_AT_accessibility(DW_ACCESS_public)
     477                      .dwendtag $C$DW$T$23
     478              
     479              
     480              $C$DW$T$24      .dwtag  DW_TAG_structure_type
     481                      .dwattr $C$DW$T$24, DW_AT_name("ADCCHSELSEQ2_BITS")
     482                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x01)
     483              $C$DW$64        .dwtag  DW_TAG_member
     484                      .dwattr $C$DW$64, DW_AT_type(*$C$DW$T$19)
     485                      .dwattr $C$DW$64, DW_AT_name("CONV04")
     486                      .dwattr $C$DW$64, DW_AT_TI_symbol_name("_CONV04")
     487                      .dwattr $C$DW$64, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x04)
     488                      .dwattr $C$DW$64, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     489                      .dwattr $C$DW$64, DW_AT_accessibility(DW_ACCESS_public)
     490              $C$DW$65        .dwtag  DW_TAG_member
     491                      .dwattr $C$DW$65, DW_AT_type(*$C$DW$T$19)
     492                      .dwattr $C$DW$65, DW_AT_name("CONV05")
     493                      .dwattr $C$DW$65, DW_AT_TI_symbol_name("_CONV05")
     494                      .dwattr $C$DW$65, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x04)
     495                      .dwattr $C$DW$65, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:22 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0440010                           PAGE   10

     496                      .dwattr $C$DW$65, DW_AT_accessibility(DW_ACCESS_public)
     497              $C$DW$66        .dwtag  DW_TAG_member
     498                      .dwattr $C$DW$66, DW_AT_type(*$C$DW$T$19)
     499                      .dwattr $C$DW$66, DW_AT_name("CONV06")
     500                      .dwattr $C$DW$66, DW_AT_TI_symbol_name("_CONV06")
     501                      .dwattr $C$DW$66, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x04)
     502                      .dwattr $C$DW$66, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     503                      .dwattr $C$DW$66, DW_AT_accessibility(DW_ACCESS_public)
     504              $C$DW$67        .dwtag  DW_TAG_member
     505                      .dwattr $C$DW$67, DW_AT_type(*$C$DW$T$19)
     506                      .dwattr $C$DW$67, DW_AT_name("CONV07")
     507                      .dwattr $C$DW$67, DW_AT_TI_symbol_name("_CONV07")
     508                      .dwattr $C$DW$67, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x04)
     509                      .dwattr $C$DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     510                      .dwattr $C$DW$67, DW_AT_accessibility(DW_ACCESS_public)
     511                      .dwendtag $C$DW$T$24
     512              
     513              
     514              $C$DW$T$25      .dwtag  DW_TAG_union_type
     515                      .dwattr $C$DW$T$25, DW_AT_name("ADCCHSELSEQ2_REG")
     516                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x01)
     517              $C$DW$68        .dwtag  DW_TAG_member
     518                      .dwattr $C$DW$68, DW_AT_type(*$C$DW$T$19)
     519                      .dwattr $C$DW$68, DW_AT_name("all")
     520                      .dwattr $C$DW$68, DW_AT_TI_symbol_name("_all")
     521                      .dwattr $C$DW$68, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     522                      .dwattr $C$DW$68, DW_AT_accessibility(DW_ACCESS_public)
     523              $C$DW$69        .dwtag  DW_TAG_member
     524                      .dwattr $C$DW$69, DW_AT_type(*$C$DW$T$24)
     525                      .dwattr $C$DW$69, DW_AT_name("bit")
     526                      .dwattr $C$DW$69, DW_AT_TI_symbol_name("_bit")
     527                      .dwattr $C$DW$69, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     528                      .dwattr $C$DW$69, DW_AT_accessibility(DW_ACCESS_public)
     529                      .dwendtag $C$DW$T$25
     530              
     531              
     532              $C$DW$T$26      .dwtag  DW_TAG_structure_type
     533                      .dwattr $C$DW$T$26, DW_AT_name("ADCCHSELSEQ3_BITS")
     534                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x01)
     535              $C$DW$70        .dwtag  DW_TAG_member
     536                      .dwattr $C$DW$70, DW_AT_type(*$C$DW$T$19)
     537                      .dwattr $C$DW$70, DW_AT_name("CONV08")
     538                      .dwattr $C$DW$70, DW_AT_TI_symbol_name("_CONV08")
     539                      .dwattr $C$DW$70, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x04)
     540                      .dwattr $C$DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     541                      .dwattr $C$DW$70, DW_AT_accessibility(DW_ACCESS_public)
     542              $C$DW$71        .dwtag  DW_TAG_member
     543                      .dwattr $C$DW$71, DW_AT_type(*$C$DW$T$19)
     544                      .dwattr $C$DW$71, DW_AT_name("CONV09")
     545                      .dwattr $C$DW$71, DW_AT_TI_symbol_name("_CONV09")
     546                      .dwattr $C$DW$71, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x04)
     547                      .dwattr $C$DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     548                      .dwattr $C$DW$71, DW_AT_accessibility(DW_ACCESS_public)
     549              $C$DW$72        .dwtag  DW_TAG_member
     550                      .dwattr $C$DW$72, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:22 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0440010                           PAGE   11

     551                      .dwattr $C$DW$72, DW_AT_name("CONV10")
     552                      .dwattr $C$DW$72, DW_AT_TI_symbol_name("_CONV10")
     553                      .dwattr $C$DW$72, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x04)
     554                      .dwattr $C$DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     555                      .dwattr $C$DW$72, DW_AT_accessibility(DW_ACCESS_public)
     556              $C$DW$73        .dwtag  DW_TAG_member
     557                      .dwattr $C$DW$73, DW_AT_type(*$C$DW$T$19)
     558                      .dwattr $C$DW$73, DW_AT_name("CONV11")
     559                      .dwattr $C$DW$73, DW_AT_TI_symbol_name("_CONV11")
     560                      .dwattr $C$DW$73, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x04)
     561                      .dwattr $C$DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     562                      .dwattr $C$DW$73, DW_AT_accessibility(DW_ACCESS_public)
     563                      .dwendtag $C$DW$T$26
     564              
     565              
     566              $C$DW$T$27      .dwtag  DW_TAG_union_type
     567                      .dwattr $C$DW$T$27, DW_AT_name("ADCCHSELSEQ3_REG")
     568                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x01)
     569              $C$DW$74        .dwtag  DW_TAG_member
     570                      .dwattr $C$DW$74, DW_AT_type(*$C$DW$T$19)
     571                      .dwattr $C$DW$74, DW_AT_name("all")
     572                      .dwattr $C$DW$74, DW_AT_TI_symbol_name("_all")
     573                      .dwattr $C$DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     574                      .dwattr $C$DW$74, DW_AT_accessibility(DW_ACCESS_public)
     575              $C$DW$75        .dwtag  DW_TAG_member
     576                      .dwattr $C$DW$75, DW_AT_type(*$C$DW$T$26)
     577                      .dwattr $C$DW$75, DW_AT_name("bit")
     578                      .dwattr $C$DW$75, DW_AT_TI_symbol_name("_bit")
     579                      .dwattr $C$DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     580                      .dwattr $C$DW$75, DW_AT_accessibility(DW_ACCESS_public)
     581                      .dwendtag $C$DW$T$27
     582              
     583              
     584              $C$DW$T$28      .dwtag  DW_TAG_structure_type
     585                      .dwattr $C$DW$T$28, DW_AT_name("ADCCHSELSEQ4_BITS")
     586                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x01)
     587              $C$DW$76        .dwtag  DW_TAG_member
     588                      .dwattr $C$DW$76, DW_AT_type(*$C$DW$T$19)
     589                      .dwattr $C$DW$76, DW_AT_name("CONV12")
     590                      .dwattr $C$DW$76, DW_AT_TI_symbol_name("_CONV12")
     591                      .dwattr $C$DW$76, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x04)
     592                      .dwattr $C$DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     593                      .dwattr $C$DW$76, DW_AT_accessibility(DW_ACCESS_public)
     594              $C$DW$77        .dwtag  DW_TAG_member
     595                      .dwattr $C$DW$77, DW_AT_type(*$C$DW$T$19)
     596                      .dwattr $C$DW$77, DW_AT_name("CONV13")
     597                      .dwattr $C$DW$77, DW_AT_TI_symbol_name("_CONV13")
     598                      .dwattr $C$DW$77, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x04)
     599                      .dwattr $C$DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     600                      .dwattr $C$DW$77, DW_AT_accessibility(DW_ACCESS_public)
     601              $C$DW$78        .dwtag  DW_TAG_member
     602                      .dwattr $C$DW$78, DW_AT_type(*$C$DW$T$19)
     603                      .dwattr $C$DW$78, DW_AT_name("CONV14")
     604                      .dwattr $C$DW$78, DW_AT_TI_symbol_name("_CONV14")
     605                      .dwattr $C$DW$78, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x04)
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:22 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0440010                           PAGE   12

     606                      .dwattr $C$DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     607                      .dwattr $C$DW$78, DW_AT_accessibility(DW_ACCESS_public)
     608              $C$DW$79        .dwtag  DW_TAG_member
     609                      .dwattr $C$DW$79, DW_AT_type(*$C$DW$T$19)
     610                      .dwattr $C$DW$79, DW_AT_name("CONV15")
     611                      .dwattr $C$DW$79, DW_AT_TI_symbol_name("_CONV15")
     612                      .dwattr $C$DW$79, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x04)
     613                      .dwattr $C$DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     614                      .dwattr $C$DW$79, DW_AT_accessibility(DW_ACCESS_public)
     615                      .dwendtag $C$DW$T$28
     616              
     617              
     618              $C$DW$T$29      .dwtag  DW_TAG_union_type
     619                      .dwattr $C$DW$T$29, DW_AT_name("ADCCHSELSEQ4_REG")
     620                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x01)
     621              $C$DW$80        .dwtag  DW_TAG_member
     622                      .dwattr $C$DW$80, DW_AT_type(*$C$DW$T$19)
     623                      .dwattr $C$DW$80, DW_AT_name("all")
     624                      .dwattr $C$DW$80, DW_AT_TI_symbol_name("_all")
     625                      .dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     626                      .dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
     627              $C$DW$81        .dwtag  DW_TAG_member
     628                      .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$28)
     629                      .dwattr $C$DW$81, DW_AT_name("bit")
     630                      .dwattr $C$DW$81, DW_AT_TI_symbol_name("_bit")
     631                      .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     632                      .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
     633                      .dwendtag $C$DW$T$29
     634              
     635              
     636              $C$DW$T$30      .dwtag  DW_TAG_structure_type
     637                      .dwattr $C$DW$T$30, DW_AT_name("ADCMAXCONV_BITS")
     638                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x01)
     639              $C$DW$82        .dwtag  DW_TAG_member
     640                      .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$19)
     641                      .dwattr $C$DW$82, DW_AT_name("MAX_CONV1")
     642                      .dwattr $C$DW$82, DW_AT_TI_symbol_name("_MAX_CONV1")
     643                      .dwattr $C$DW$82, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x04)
     644                      .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     645                      .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
     646              $C$DW$83        .dwtag  DW_TAG_member
     647                      .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$19)
     648                      .dwattr $C$DW$83, DW_AT_name("MAX_CONV2")
     649                      .dwattr $C$DW$83, DW_AT_TI_symbol_name("_MAX_CONV2")
     650                      .dwattr $C$DW$83, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x03)
     651                      .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     652                      .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
     653              $C$DW$84        .dwtag  DW_TAG_member
     654                      .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$19)
     655                      .dwattr $C$DW$84, DW_AT_name("rsvd1")
     656                      .dwattr $C$DW$84, DW_AT_TI_symbol_name("_rsvd1")
     657                      .dwattr $C$DW$84, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x09)
     658                      .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     659                      .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
     660                      .dwendtag $C$DW$T$30
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:22 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0440010                           PAGE   13

     661              
     662              
     663              $C$DW$T$31      .dwtag  DW_TAG_union_type
     664                      .dwattr $C$DW$T$31, DW_AT_name("ADCMAXCONV_REG")
     665                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x01)
     666              $C$DW$85        .dwtag  DW_TAG_member
     667                      .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$19)
     668                      .dwattr $C$DW$85, DW_AT_name("all")
     669                      .dwattr $C$DW$85, DW_AT_TI_symbol_name("_all")
     670                      .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     671                      .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
     672              $C$DW$86        .dwtag  DW_TAG_member
     673                      .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$30)
     674                      .dwattr $C$DW$86, DW_AT_name("bit")
     675                      .dwattr $C$DW$86, DW_AT_TI_symbol_name("_bit")
     676                      .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     677                      .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
     678                      .dwendtag $C$DW$T$31
     679              
     680              
     681              $C$DW$T$33      .dwtag  DW_TAG_structure_type
     682                      .dwattr $C$DW$T$33, DW_AT_name("ADCOFFTRIM_BITS")
     683                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x01)
     684              $C$DW$87        .dwtag  DW_TAG_member
     685                      .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$32)
     686                      .dwattr $C$DW$87, DW_AT_name("OFFSET_TRIM")
     687                      .dwattr $C$DW$87, DW_AT_TI_symbol_name("_OFFSET_TRIM")
     688                      .dwattr $C$DW$87, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x09)
     689                      .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     690                      .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
     691              $C$DW$88        .dwtag  DW_TAG_member
     692                      .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$19)
     693                      .dwattr $C$DW$88, DW_AT_name("rsvd1")
     694                      .dwattr $C$DW$88, DW_AT_TI_symbol_name("_rsvd1")
     695                      .dwattr $C$DW$88, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x07)
     696                      .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     697                      .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
     698                      .dwendtag $C$DW$T$33
     699              
     700              
     701              $C$DW$T$34      .dwtag  DW_TAG_union_type
     702                      .dwattr $C$DW$T$34, DW_AT_name("ADCOFFTRIM_REG")
     703                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x01)
     704              $C$DW$89        .dwtag  DW_TAG_member
     705                      .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$19)
     706                      .dwattr $C$DW$89, DW_AT_name("all")
     707                      .dwattr $C$DW$89, DW_AT_TI_symbol_name("_all")
     708                      .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     709                      .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
     710              $C$DW$90        .dwtag  DW_TAG_member
     711                      .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$33)
     712                      .dwattr $C$DW$90, DW_AT_name("bit")
     713                      .dwattr $C$DW$90, DW_AT_TI_symbol_name("_bit")
     714                      .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     715                      .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:22 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0440010                           PAGE   14

     716                      .dwendtag $C$DW$T$34
     717              
     718              
     719              $C$DW$T$35      .dwtag  DW_TAG_structure_type
     720                      .dwattr $C$DW$T$35, DW_AT_name("ADCREFSEL_BITS")
     721                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x01)
     722              $C$DW$91        .dwtag  DW_TAG_member
     723                      .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$19)
     724                      .dwattr $C$DW$91, DW_AT_name("rsvd1")
     725                      .dwattr $C$DW$91, DW_AT_TI_symbol_name("_rsvd1")
     726                      .dwattr $C$DW$91, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x0e)
     727                      .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     728                      .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
     729              $C$DW$92        .dwtag  DW_TAG_member
     730                      .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$19)
     731                      .dwattr $C$DW$92, DW_AT_name("REF_SEL")
     732                      .dwattr $C$DW$92, DW_AT_TI_symbol_name("_REF_SEL")
     733                      .dwattr $C$DW$92, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x02)
     734                      .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     735                      .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
     736                      .dwendtag $C$DW$T$35
     737              
     738              
     739              $C$DW$T$36      .dwtag  DW_TAG_union_type
     740                      .dwattr $C$DW$T$36, DW_AT_name("ADCREFSEL_REG")
     741                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x01)
     742              $C$DW$93        .dwtag  DW_TAG_member
     743                      .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$19)
     744                      .dwattr $C$DW$93, DW_AT_name("all")
     745                      .dwattr $C$DW$93, DW_AT_TI_symbol_name("_all")
     746                      .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     747                      .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
     748              $C$DW$94        .dwtag  DW_TAG_member
     749                      .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$35)
     750                      .dwattr $C$DW$94, DW_AT_name("bit")
     751                      .dwattr $C$DW$94, DW_AT_TI_symbol_name("_bit")
     752                      .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     753                      .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
     754                      .dwendtag $C$DW$T$36
     755              
     756              
     757              $C$DW$T$37      .dwtag  DW_TAG_structure_type
     758                      .dwattr $C$DW$T$37, DW_AT_name("ADCST_BITS")
     759                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x01)
     760              $C$DW$95        .dwtag  DW_TAG_member
     761                      .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$19)
     762                      .dwattr $C$DW$95, DW_AT_name("INT_SEQ1")
     763                      .dwattr $C$DW$95, DW_AT_TI_symbol_name("_INT_SEQ1")
     764                      .dwattr $C$DW$95, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
     765                      .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     766                      .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
     767              $C$DW$96        .dwtag  DW_TAG_member
     768                      .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$19)
     769                      .dwattr $C$DW$96, DW_AT_name("INT_SEQ2")
     770                      .dwattr $C$DW$96, DW_AT_TI_symbol_name("_INT_SEQ2")
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:22 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0440010                           PAGE   15

     771                      .dwattr $C$DW$96, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
     772                      .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     773                      .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
     774              $C$DW$97        .dwtag  DW_TAG_member
     775                      .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$19)
     776                      .dwattr $C$DW$97, DW_AT_name("SEQ1_BSY")
     777                      .dwattr $C$DW$97, DW_AT_TI_symbol_name("_SEQ1_BSY")
     778                      .dwattr $C$DW$97, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
     779                      .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     780                      .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
     781              $C$DW$98        .dwtag  DW_TAG_member
     782                      .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$19)
     783                      .dwattr $C$DW$98, DW_AT_name("SEQ2_BSY")
     784                      .dwattr $C$DW$98, DW_AT_TI_symbol_name("_SEQ2_BSY")
     785                      .dwattr $C$DW$98, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
     786                      .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     787                      .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
     788              $C$DW$99        .dwtag  DW_TAG_member
     789                      .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$19)
     790                      .dwattr $C$DW$99, DW_AT_name("INT_SEQ1_CLR")
     791                      .dwattr $C$DW$99, DW_AT_TI_symbol_name("_INT_SEQ1_CLR")
     792                      .dwattr $C$DW$99, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
     793                      .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     794                      .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
     795              $C$DW$100       .dwtag  DW_TAG_member
     796                      .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$19)
     797                      .dwattr $C$DW$100, DW_AT_name("INT_SEQ2_CLR")
     798                      .dwattr $C$DW$100, DW_AT_TI_symbol_name("_INT_SEQ2_CLR")
     799                      .dwattr $C$DW$100, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
     800                      .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     801                      .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
     802              $C$DW$101       .dwtag  DW_TAG_member
     803                      .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$19)
     804                      .dwattr $C$DW$101, DW_AT_name("EOS_BUF1")
     805                      .dwattr $C$DW$101, DW_AT_TI_symbol_name("_EOS_BUF1")
     806                      .dwattr $C$DW$101, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
     807                      .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     808                      .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
     809              $C$DW$102       .dwtag  DW_TAG_member
     810                      .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$19)
     811                      .dwattr $C$DW$102, DW_AT_name("EOS_BUF2")
     812                      .dwattr $C$DW$102, DW_AT_TI_symbol_name("_EOS_BUF2")
     813                      .dwattr $C$DW$102, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
     814                      .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     815                      .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
     816              $C$DW$103       .dwtag  DW_TAG_member
     817                      .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$19)
     818                      .dwattr $C$DW$103, DW_AT_name("rsvd1")
     819                      .dwattr $C$DW$103, DW_AT_TI_symbol_name("_rsvd1")
     820                      .dwattr $C$DW$103, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x08)
     821                      .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     822                      .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
     823                      .dwendtag $C$DW$T$37
     824              
     825              
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:22 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0440010                           PAGE   16

     826              $C$DW$T$38      .dwtag  DW_TAG_union_type
     827                      .dwattr $C$DW$T$38, DW_AT_name("ADCST_REG")
     828                      .dwattr $C$DW$T$38, DW_AT_byte_size(0x01)
     829              $C$DW$104       .dwtag  DW_TAG_member
     830                      .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$19)
     831                      .dwattr $C$DW$104, DW_AT_name("all")
     832                      .dwattr $C$DW$104, DW_AT_TI_symbol_name("_all")
     833                      .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     834                      .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
     835              $C$DW$105       .dwtag  DW_TAG_member
     836                      .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$37)
     837                      .dwattr $C$DW$105, DW_AT_name("bit")
     838                      .dwattr $C$DW$105, DW_AT_TI_symbol_name("_bit")
     839                      .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     840                      .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
     841                      .dwendtag $C$DW$T$38
     842              
     843              
     844              $C$DW$T$39      .dwtag  DW_TAG_structure_type
     845                      .dwattr $C$DW$T$39, DW_AT_name("ADCTRL1_BITS")
     846                      .dwattr $C$DW$T$39, DW_AT_byte_size(0x01)
     847              $C$DW$106       .dwtag  DW_TAG_member
     848                      .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$19)
     849                      .dwattr $C$DW$106, DW_AT_name("rsvd1")
     850                      .dwattr $C$DW$106, DW_AT_TI_symbol_name("_rsvd1")
     851                      .dwattr $C$DW$106, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x04)
     852                      .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     853                      .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
     854              $C$DW$107       .dwtag  DW_TAG_member
     855                      .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$19)
     856                      .dwattr $C$DW$107, DW_AT_name("SEQ_CASC")
     857                      .dwattr $C$DW$107, DW_AT_TI_symbol_name("_SEQ_CASC")
     858                      .dwattr $C$DW$107, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
     859                      .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     860                      .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
     861              $C$DW$108       .dwtag  DW_TAG_member
     862                      .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$19)
     863                      .dwattr $C$DW$108, DW_AT_name("SEQ_OVRD")
     864                      .dwattr $C$DW$108, DW_AT_TI_symbol_name("_SEQ_OVRD")
     865                      .dwattr $C$DW$108, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
     866                      .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     867                      .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
     868              $C$DW$109       .dwtag  DW_TAG_member
     869                      .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$19)
     870                      .dwattr $C$DW$109, DW_AT_name("CONT_RUN")
     871                      .dwattr $C$DW$109, DW_AT_TI_symbol_name("_CONT_RUN")
     872                      .dwattr $C$DW$109, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
     873                      .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     874                      .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
     875              $C$DW$110       .dwtag  DW_TAG_member
     876                      .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$19)
     877                      .dwattr $C$DW$110, DW_AT_name("CPS")
     878                      .dwattr $C$DW$110, DW_AT_TI_symbol_name("_CPS")
     879                      .dwattr $C$DW$110, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
     880                      .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:22 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0440010                           PAGE   17

     881                      .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
     882              $C$DW$111       .dwtag  DW_TAG_member
     883                      .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$19)
     884                      .dwattr $C$DW$111, DW_AT_name("ACQ_PS")
     885                      .dwattr $C$DW$111, DW_AT_TI_symbol_name("_ACQ_PS")
     886                      .dwattr $C$DW$111, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x04)
     887                      .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     888                      .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
     889              $C$DW$112       .dwtag  DW_TAG_member
     890                      .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$19)
     891                      .dwattr $C$DW$112, DW_AT_name("SUSMOD")
     892                      .dwattr $C$DW$112, DW_AT_TI_symbol_name("_SUSMOD")
     893                      .dwattr $C$DW$112, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x02)
     894                      .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     895                      .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
     896              $C$DW$113       .dwtag  DW_TAG_member
     897                      .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$19)
     898                      .dwattr $C$DW$113, DW_AT_name("RESET")
     899                      .dwattr $C$DW$113, DW_AT_TI_symbol_name("_RESET")
     900                      .dwattr $C$DW$113, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
     901                      .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     902                      .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
     903              $C$DW$114       .dwtag  DW_TAG_member
     904                      .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$19)
     905                      .dwattr $C$DW$114, DW_AT_name("rsvd2")
     906                      .dwattr $C$DW$114, DW_AT_TI_symbol_name("_rsvd2")
     907                      .dwattr $C$DW$114, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
     908                      .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     909                      .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
     910                      .dwendtag $C$DW$T$39
     911              
     912              
     913              $C$DW$T$40      .dwtag  DW_TAG_union_type
     914                      .dwattr $C$DW$T$40, DW_AT_name("ADCTRL1_REG")
     915                      .dwattr $C$DW$T$40, DW_AT_byte_size(0x01)
     916              $C$DW$115       .dwtag  DW_TAG_member
     917                      .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$19)
     918                      .dwattr $C$DW$115, DW_AT_name("all")
     919                      .dwattr $C$DW$115, DW_AT_TI_symbol_name("_all")
     920                      .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     921                      .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
     922              $C$DW$116       .dwtag  DW_TAG_member
     923                      .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$39)
     924                      .dwattr $C$DW$116, DW_AT_name("bit")
     925                      .dwattr $C$DW$116, DW_AT_TI_symbol_name("_bit")
     926                      .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     927                      .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
     928                      .dwendtag $C$DW$T$40
     929              
     930              
     931              $C$DW$T$41      .dwtag  DW_TAG_structure_type
     932                      .dwattr $C$DW$T$41, DW_AT_name("ADCTRL2_BITS")
     933                      .dwattr $C$DW$T$41, DW_AT_byte_size(0x01)
     934              $C$DW$117       .dwtag  DW_TAG_member
     935                      .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:22 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0440010                           PAGE   18

     936                      .dwattr $C$DW$117, DW_AT_name("EPWM_SOCB_SEQ2")
     937                      .dwattr $C$DW$117, DW_AT_TI_symbol_name("_EPWM_SOCB_SEQ2")
     938                      .dwattr $C$DW$117, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
     939                      .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     940                      .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
     941              $C$DW$118       .dwtag  DW_TAG_member
     942                      .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$19)
     943                      .dwattr $C$DW$118, DW_AT_name("rsvd1")
     944                      .dwattr $C$DW$118, DW_AT_TI_symbol_name("_rsvd1")
     945                      .dwattr $C$DW$118, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
     946                      .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     947                      .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
     948              $C$DW$119       .dwtag  DW_TAG_member
     949                      .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$19)
     950                      .dwattr $C$DW$119, DW_AT_name("INT_MOD_SEQ2")
     951                      .dwattr $C$DW$119, DW_AT_TI_symbol_name("_INT_MOD_SEQ2")
     952                      .dwattr $C$DW$119, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
     953                      .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     954                      .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
     955              $C$DW$120       .dwtag  DW_TAG_member
     956                      .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$19)
     957                      .dwattr $C$DW$120, DW_AT_name("INT_ENA_SEQ2")
     958                      .dwattr $C$DW$120, DW_AT_TI_symbol_name("_INT_ENA_SEQ2")
     959                      .dwattr $C$DW$120, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
     960                      .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     961                      .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
     962              $C$DW$121       .dwtag  DW_TAG_member
     963                      .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$19)
     964                      .dwattr $C$DW$121, DW_AT_name("rsvd2")
     965                      .dwattr $C$DW$121, DW_AT_TI_symbol_name("_rsvd2")
     966                      .dwattr $C$DW$121, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
     967                      .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     968                      .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
     969              $C$DW$122       .dwtag  DW_TAG_member
     970                      .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$19)
     971                      .dwattr $C$DW$122, DW_AT_name("SOC_SEQ2")
     972                      .dwattr $C$DW$122, DW_AT_TI_symbol_name("_SOC_SEQ2")
     973                      .dwattr $C$DW$122, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
     974                      .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     975                      .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
     976              $C$DW$123       .dwtag  DW_TAG_member
     977                      .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$19)
     978                      .dwattr $C$DW$123, DW_AT_name("RST_SEQ2")
     979                      .dwattr $C$DW$123, DW_AT_TI_symbol_name("_RST_SEQ2")
     980                      .dwattr $C$DW$123, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
     981                      .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     982                      .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
     983              $C$DW$124       .dwtag  DW_TAG_member
     984                      .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$19)
     985                      .dwattr $C$DW$124, DW_AT_name("EXT_SOC_SEQ1")
     986                      .dwattr $C$DW$124, DW_AT_TI_symbol_name("_EXT_SOC_SEQ1")
     987                      .dwattr $C$DW$124, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
     988                      .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     989                      .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
     990              $C$DW$125       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:22 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0440010                           PAGE   19

     991                      .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$19)
     992                      .dwattr $C$DW$125, DW_AT_name("EPWM_SOCA_SEQ1")
     993                      .dwattr $C$DW$125, DW_AT_TI_symbol_name("_EPWM_SOCA_SEQ1")
     994                      .dwattr $C$DW$125, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
     995                      .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     996                      .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
     997              $C$DW$126       .dwtag  DW_TAG_member
     998                      .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$19)
     999                      .dwattr $C$DW$126, DW_AT_name("rsvd3")
    1000                      .dwattr $C$DW$126, DW_AT_TI_symbol_name("_rsvd3")
    1001                      .dwattr $C$DW$126, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    1002                      .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1003                      .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    1004              $C$DW$127       .dwtag  DW_TAG_member
    1005                      .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$19)
    1006                      .dwattr $C$DW$127, DW_AT_name("INT_MOD_SEQ1")
    1007                      .dwattr $C$DW$127, DW_AT_TI_symbol_name("_INT_MOD_SEQ1")
    1008                      .dwattr $C$DW$127, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
    1009                      .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1010                      .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    1011              $C$DW$128       .dwtag  DW_TAG_member
    1012                      .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$19)
    1013                      .dwattr $C$DW$128, DW_AT_name("INT_ENA_SEQ1")
    1014                      .dwattr $C$DW$128, DW_AT_TI_symbol_name("_INT_ENA_SEQ1")
    1015                      .dwattr $C$DW$128, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
    1016                      .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1017                      .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    1018              $C$DW$129       .dwtag  DW_TAG_member
    1019                      .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$19)
    1020                      .dwattr $C$DW$129, DW_AT_name("rsvd4")
    1021                      .dwattr $C$DW$129, DW_AT_TI_symbol_name("_rsvd4")
    1022                      .dwattr $C$DW$129, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
    1023                      .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1024                      .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    1025              $C$DW$130       .dwtag  DW_TAG_member
    1026                      .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$19)
    1027                      .dwattr $C$DW$130, DW_AT_name("SOC_SEQ1")
    1028                      .dwattr $C$DW$130, DW_AT_TI_symbol_name("_SOC_SEQ1")
    1029                      .dwattr $C$DW$130, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
    1030                      .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1031                      .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    1032              $C$DW$131       .dwtag  DW_TAG_member
    1033                      .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$19)
    1034                      .dwattr $C$DW$131, DW_AT_name("RST_SEQ1")
    1035                      .dwattr $C$DW$131, DW_AT_TI_symbol_name("_RST_SEQ1")
    1036                      .dwattr $C$DW$131, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
    1037                      .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1038                      .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    1039              $C$DW$132       .dwtag  DW_TAG_member
    1040                      .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$19)
    1041                      .dwattr $C$DW$132, DW_AT_name("EPWM_SOCB_SEQ")
    1042                      .dwattr $C$DW$132, DW_AT_TI_symbol_name("_EPWM_SOCB_SEQ")
    1043                      .dwattr $C$DW$132, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    1044                      .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1045                      .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:22 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0440010                           PAGE   20

    1046                      .dwendtag $C$DW$T$41
    1047              
    1048              
    1049              $C$DW$T$42      .dwtag  DW_TAG_union_type
    1050                      .dwattr $C$DW$T$42, DW_AT_name("ADCTRL2_REG")
    1051                      .dwattr $C$DW$T$42, DW_AT_byte_size(0x01)
    1052              $C$DW$133       .dwtag  DW_TAG_member
    1053                      .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$19)
    1054                      .dwattr $C$DW$133, DW_AT_name("all")
    1055                      .dwattr $C$DW$133, DW_AT_TI_symbol_name("_all")
    1056                      .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1057                      .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    1058              $C$DW$134       .dwtag  DW_TAG_member
    1059                      .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$41)
    1060                      .dwattr $C$DW$134, DW_AT_name("bit")
    1061                      .dwattr $C$DW$134, DW_AT_TI_symbol_name("_bit")
    1062                      .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1063                      .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    1064                      .dwendtag $C$DW$T$42
    1065              
    1066              
    1067              $C$DW$T$43      .dwtag  DW_TAG_structure_type
    1068                      .dwattr $C$DW$T$43, DW_AT_name("ADCTRL3_BITS")
    1069                      .dwattr $C$DW$T$43, DW_AT_byte_size(0x01)
    1070              $C$DW$135       .dwtag  DW_TAG_member
    1071                      .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$19)
    1072                      .dwattr $C$DW$135, DW_AT_name("SMODE_SEL")
    1073                      .dwattr $C$DW$135, DW_AT_TI_symbol_name("_SMODE_SEL")
    1074                      .dwattr $C$DW$135, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    1075                      .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1076                      .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    1077              $C$DW$136       .dwtag  DW_TAG_member
    1078                      .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$19)
    1079                      .dwattr $C$DW$136, DW_AT_name("ADCCLKPS")
    1080                      .dwattr $C$DW$136, DW_AT_TI_symbol_name("_ADCCLKPS")
    1081                      .dwattr $C$DW$136, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x04)
    1082                      .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1083                      .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    1084              $C$DW$137       .dwtag  DW_TAG_member
    1085                      .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$19)
    1086                      .dwattr $C$DW$137, DW_AT_name("ADCPWDN")
    1087                      .dwattr $C$DW$137, DW_AT_TI_symbol_name("_ADCPWDN")
    1088                      .dwattr $C$DW$137, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    1089                      .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1090                      .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    1091              $C$DW$138       .dwtag  DW_TAG_member
    1092                      .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$19)
    1093                      .dwattr $C$DW$138, DW_AT_name("ADCBGRFDN")
    1094                      .dwattr $C$DW$138, DW_AT_TI_symbol_name("_ADCBGRFDN")
    1095                      .dwattr $C$DW$138, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x02)
    1096                      .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1097                      .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    1098              $C$DW$139       .dwtag  DW_TAG_member
    1099                      .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$19)
    1100                      .dwattr $C$DW$139, DW_AT_name("rsvd1")
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:22 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0440010                           PAGE   21

    1101                      .dwattr $C$DW$139, DW_AT_TI_symbol_name("_rsvd1")
    1102                      .dwattr $C$DW$139, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x08)
    1103                      .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1104                      .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    1105                      .dwendtag $C$DW$T$43
    1106              
    1107              
    1108              $C$DW$T$44      .dwtag  DW_TAG_union_type
    1109                      .dwattr $C$DW$T$44, DW_AT_name("ADCTRL3_REG")
    1110                      .dwattr $C$DW$T$44, DW_AT_byte_size(0x01)
    1111              $C$DW$140       .dwtag  DW_TAG_member
    1112                      .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$19)
    1113                      .dwattr $C$DW$140, DW_AT_name("all")
    1114                      .dwattr $C$DW$140, DW_AT_TI_symbol_name("_all")
    1115                      .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1116                      .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    1117              $C$DW$141       .dwtag  DW_TAG_member
    1118                      .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$43)
    1119                      .dwattr $C$DW$141, DW_AT_name("bit")
    1120                      .dwattr $C$DW$141, DW_AT_TI_symbol_name("_bit")
    1121                      .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1122                      .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    1123                      .dwendtag $C$DW$T$44
    1124              
    1125              
    1126              $C$DW$T$45      .dwtag  DW_TAG_structure_type
    1127                      .dwattr $C$DW$T$45, DW_AT_name("ADC_REGS")
    1128                      .dwattr $C$DW$T$45, DW_AT_byte_size(0x1e)
    1129              $C$DW$142       .dwtag  DW_TAG_member
    1130                      .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$40)
    1131                      .dwattr $C$DW$142, DW_AT_name("ADCTRL1")
    1132                      .dwattr $C$DW$142, DW_AT_TI_symbol_name("_ADCTRL1")
    1133                      .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1134                      .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    1135              $C$DW$143       .dwtag  DW_TAG_member
    1136                      .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$42)
    1137                      .dwattr $C$DW$143, DW_AT_name("ADCTRL2")
    1138                      .dwattr $C$DW$143, DW_AT_TI_symbol_name("_ADCTRL2")
    1139                      .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1140                      .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    1141              $C$DW$144       .dwtag  DW_TAG_member
    1142                      .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$31)
    1143                      .dwattr $C$DW$144, DW_AT_name("ADCMAXCONV")
    1144                      .dwattr $C$DW$144, DW_AT_TI_symbol_name("_ADCMAXCONV")
    1145                      .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1146                      .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    1147              $C$DW$145       .dwtag  DW_TAG_member
    1148                      .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$23)
    1149                      .dwattr $C$DW$145, DW_AT_name("ADCCHSELSEQ1")
    1150                      .dwattr $C$DW$145, DW_AT_TI_symbol_name("_ADCCHSELSEQ1")
    1151                      .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    1152                      .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    1153              $C$DW$146       .dwtag  DW_TAG_member
    1154                      .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$25)
    1155                      .dwattr $C$DW$146, DW_AT_name("ADCCHSELSEQ2")
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:22 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0440010                           PAGE   22

    1156                      .dwattr $C$DW$146, DW_AT_TI_symbol_name("_ADCCHSELSEQ2")
    1157                      .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1158                      .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
    1159              $C$DW$147       .dwtag  DW_TAG_member
    1160                      .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$27)
    1161                      .dwattr $C$DW$147, DW_AT_name("ADCCHSELSEQ3")
    1162                      .dwattr $C$DW$147, DW_AT_TI_symbol_name("_ADCCHSELSEQ3")
    1163                      .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    1164                      .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
    1165              $C$DW$148       .dwtag  DW_TAG_member
    1166                      .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$29)
    1167                      .dwattr $C$DW$148, DW_AT_name("ADCCHSELSEQ4")
    1168                      .dwattr $C$DW$148, DW_AT_TI_symbol_name("_ADCCHSELSEQ4")
    1169                      .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1170                      .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    1171              $C$DW$149       .dwtag  DW_TAG_member
    1172                      .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$21)
    1173                      .dwattr $C$DW$149, DW_AT_name("ADCASEQSR")
    1174                      .dwattr $C$DW$149, DW_AT_TI_symbol_name("_ADCASEQSR")
    1175                      .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    1176                      .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    1177              $C$DW$150       .dwtag  DW_TAG_member
    1178                      .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$19)
    1179                      .dwattr $C$DW$150, DW_AT_name("ADCRESULT0")
    1180                      .dwattr $C$DW$150, DW_AT_TI_symbol_name("_ADCRESULT0")
    1181                      .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1182                      .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
    1183              $C$DW$151       .dwtag  DW_TAG_member
    1184                      .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$19)
    1185                      .dwattr $C$DW$151, DW_AT_name("ADCRESULT1")
    1186                      .dwattr $C$DW$151, DW_AT_TI_symbol_name("_ADCRESULT1")
    1187                      .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    1188                      .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    1189              $C$DW$152       .dwtag  DW_TAG_member
    1190                      .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$19)
    1191                      .dwattr $C$DW$152, DW_AT_name("ADCRESULT2")
    1192                      .dwattr $C$DW$152, DW_AT_TI_symbol_name("_ADCRESULT2")
    1193                      .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1194                      .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    1195              $C$DW$153       .dwtag  DW_TAG_member
    1196                      .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$19)
    1197                      .dwattr $C$DW$153, DW_AT_name("ADCRESULT3")
    1198                      .dwattr $C$DW$153, DW_AT_TI_symbol_name("_ADCRESULT3")
    1199                      .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    1200                      .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    1201              $C$DW$154       .dwtag  DW_TAG_member
    1202                      .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$19)
    1203                      .dwattr $C$DW$154, DW_AT_name("ADCRESULT4")
    1204                      .dwattr $C$DW$154, DW_AT_TI_symbol_name("_ADCRESULT4")
    1205                      .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1206                      .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
    1207              $C$DW$155       .dwtag  DW_TAG_member
    1208                      .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$19)
    1209                      .dwattr $C$DW$155, DW_AT_name("ADCRESULT5")
    1210                      .dwattr $C$DW$155, DW_AT_TI_symbol_name("_ADCRESULT5")
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:22 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0440010                           PAGE   23

    1211                      .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    1212                      .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
    1213              $C$DW$156       .dwtag  DW_TAG_member
    1214                      .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$19)
    1215                      .dwattr $C$DW$156, DW_AT_name("ADCRESULT6")
    1216                      .dwattr $C$DW$156, DW_AT_TI_symbol_name("_ADCRESULT6")
    1217                      .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1218                      .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    1219              $C$DW$157       .dwtag  DW_TAG_member
    1220                      .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$19)
    1221                      .dwattr $C$DW$157, DW_AT_name("ADCRESULT7")
    1222                      .dwattr $C$DW$157, DW_AT_TI_symbol_name("_ADCRESULT7")
    1223                      .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
    1224                      .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    1225              $C$DW$158       .dwtag  DW_TAG_member
    1226                      .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$19)
    1227                      .dwattr $C$DW$158, DW_AT_name("ADCRESULT8")
    1228                      .dwattr $C$DW$158, DW_AT_TI_symbol_name("_ADCRESULT8")
    1229                      .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1230                      .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    1231              $C$DW$159       .dwtag  DW_TAG_member
    1232                      .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$19)
    1233                      .dwattr $C$DW$159, DW_AT_name("ADCRESULT9")
    1234                      .dwattr $C$DW$159, DW_AT_TI_symbol_name("_ADCRESULT9")
    1235                      .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    1236                      .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    1237              $C$DW$160       .dwtag  DW_TAG_member
    1238                      .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$19)
    1239                      .dwattr $C$DW$160, DW_AT_name("ADCRESULT10")
    1240                      .dwattr $C$DW$160, DW_AT_TI_symbol_name("_ADCRESULT10")
    1241                      .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    1242                      .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    1243              $C$DW$161       .dwtag  DW_TAG_member
    1244                      .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$19)
    1245                      .dwattr $C$DW$161, DW_AT_name("ADCRESULT11")
    1246                      .dwattr $C$DW$161, DW_AT_TI_symbol_name("_ADCRESULT11")
    1247                      .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x13]
    1248                      .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    1249              $C$DW$162       .dwtag  DW_TAG_member
    1250                      .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$19)
    1251                      .dwattr $C$DW$162, DW_AT_name("ADCRESULT12")
    1252                      .dwattr $C$DW$162, DW_AT_TI_symbol_name("_ADCRESULT12")
    1253                      .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1254                      .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    1255              $C$DW$163       .dwtag  DW_TAG_member
    1256                      .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$19)
    1257                      .dwattr $C$DW$163, DW_AT_name("ADCRESULT13")
    1258                      .dwattr $C$DW$163, DW_AT_TI_symbol_name("_ADCRESULT13")
    1259                      .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    1260                      .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    1261              $C$DW$164       .dwtag  DW_TAG_member
    1262                      .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$19)
    1263                      .dwattr $C$DW$164, DW_AT_name("ADCRESULT14")
    1264                      .dwattr $C$DW$164, DW_AT_TI_symbol_name("_ADCRESULT14")
    1265                      .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:22 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0440010                           PAGE   24

    1266                      .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    1267              $C$DW$165       .dwtag  DW_TAG_member
    1268                      .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$19)
    1269                      .dwattr $C$DW$165, DW_AT_name("ADCRESULT15")
    1270                      .dwattr $C$DW$165, DW_AT_TI_symbol_name("_ADCRESULT15")
    1271                      .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
    1272                      .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    1273              $C$DW$166       .dwtag  DW_TAG_member
    1274                      .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$44)
    1275                      .dwattr $C$DW$166, DW_AT_name("ADCTRL3")
    1276                      .dwattr $C$DW$166, DW_AT_TI_symbol_name("_ADCTRL3")
    1277                      .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1278                      .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    1279              $C$DW$167       .dwtag  DW_TAG_member
    1280                      .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$38)
    1281                      .dwattr $C$DW$167, DW_AT_name("ADCST")
    1282                      .dwattr $C$DW$167, DW_AT_TI_symbol_name("_ADCST")
    1283                      .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
    1284                      .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    1285              $C$DW$168       .dwtag  DW_TAG_member
    1286                      .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$19)
    1287                      .dwattr $C$DW$168, DW_AT_name("rsvd1")
    1288                      .dwattr $C$DW$168, DW_AT_TI_symbol_name("_rsvd1")
    1289                      .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    1290                      .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    1291              $C$DW$169       .dwtag  DW_TAG_member
    1292                      .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$19)
    1293                      .dwattr $C$DW$169, DW_AT_name("rsvd2")
    1294                      .dwattr $C$DW$169, DW_AT_TI_symbol_name("_rsvd2")
    1295                      .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b]
    1296                      .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    1297              $C$DW$170       .dwtag  DW_TAG_member
    1298                      .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$36)
    1299                      .dwattr $C$DW$170, DW_AT_name("ADCREFSEL")
    1300                      .dwattr $C$DW$170, DW_AT_TI_symbol_name("_ADCREFSEL")
    1301                      .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    1302                      .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    1303              $C$DW$171       .dwtag  DW_TAG_member
    1304                      .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$34)
    1305                      .dwattr $C$DW$171, DW_AT_name("ADCOFFTRIM")
    1306                      .dwattr $C$DW$171, DW_AT_TI_symbol_name("_ADCOFFTRIM")
    1307                      .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
    1308                      .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    1309                      .dwendtag $C$DW$T$45
    1310              
    1311              $C$DW$172       .dwtag  DW_TAG_TI_far_type
    1312                      .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$45)
    1313              $C$DW$T$443     .dwtag  DW_TAG_volatile_type
    1314                      .dwattr $C$DW$T$443, DW_AT_type(*$C$DW$172)
    1315              
    1316              $C$DW$T$46      .dwtag  DW_TAG_structure_type
    1317                      .dwattr $C$DW$T$46, DW_AT_name("ADC_RESULT_MIRROR_REGS")
    1318                      .dwattr $C$DW$T$46, DW_AT_byte_size(0x10)
    1319              $C$DW$173       .dwtag  DW_TAG_member
    1320                      .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:22 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0440010                           PAGE   25

    1321                      .dwattr $C$DW$173, DW_AT_name("ADCRESULT0")
    1322                      .dwattr $C$DW$173, DW_AT_TI_symbol_name("_ADCRESULT0")
    1323                      .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1324                      .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
    1325              $C$DW$174       .dwtag  DW_TAG_member
    1326                      .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$19)
    1327                      .dwattr $C$DW$174, DW_AT_name("ADCRESULT1")
    1328                      .dwattr $C$DW$174, DW_AT_TI_symbol_name("_ADCRESULT1")
    1329                      .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1330                      .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
    1331              $C$DW$175       .dwtag  DW_TAG_member
    1332                      .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$19)
    1333                      .dwattr $C$DW$175, DW_AT_name("ADCRESULT2")
    1334                      .dwattr $C$DW$175, DW_AT_TI_symbol_name("_ADCRESULT2")
    1335                      .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1336                      .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
    1337              $C$DW$176       .dwtag  DW_TAG_member
    1338                      .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$19)
    1339                      .dwattr $C$DW$176, DW_AT_name("ADCRESULT3")
    1340                      .dwattr $C$DW$176, DW_AT_TI_symbol_name("_ADCRESULT3")
    1341                      .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    1342                      .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
    1343              $C$DW$177       .dwtag  DW_TAG_member
    1344                      .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$19)
    1345                      .dwattr $C$DW$177, DW_AT_name("ADCRESULT4")
    1346                      .dwattr $C$DW$177, DW_AT_TI_symbol_name("_ADCRESULT4")
    1347                      .dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1348                      .dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
    1349              $C$DW$178       .dwtag  DW_TAG_member
    1350                      .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$19)
    1351                      .dwattr $C$DW$178, DW_AT_name("ADCRESULT5")
    1352                      .dwattr $C$DW$178, DW_AT_TI_symbol_name("_ADCRESULT5")
    1353                      .dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    1354                      .dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
    1355              $C$DW$179       .dwtag  DW_TAG_member
    1356                      .dwattr $C$DW$179, DW_AT_type(*$C$DW$T$19)
    1357                      .dwattr $C$DW$179, DW_AT_name("ADCRESULT6")
    1358                      .dwattr $C$DW$179, DW_AT_TI_symbol_name("_ADCRESULT6")
    1359                      .dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1360                      .dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
    1361              $C$DW$180       .dwtag  DW_TAG_member
    1362                      .dwattr $C$DW$180, DW_AT_type(*$C$DW$T$19)
    1363                      .dwattr $C$DW$180, DW_AT_name("ADCRESULT7")
    1364                      .dwattr $C$DW$180, DW_AT_TI_symbol_name("_ADCRESULT7")
    1365                      .dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    1366                      .dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
    1367              $C$DW$181       .dwtag  DW_TAG_member
    1368                      .dwattr $C$DW$181, DW_AT_type(*$C$DW$T$19)
    1369                      .dwattr $C$DW$181, DW_AT_name("ADCRESULT8")
    1370                      .dwattr $C$DW$181, DW_AT_TI_symbol_name("_ADCRESULT8")
    1371                      .dwattr $C$DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1372                      .dwattr $C$DW$181, DW_AT_accessibility(DW_ACCESS_public)
    1373              $C$DW$182       .dwtag  DW_TAG_member
    1374                      .dwattr $C$DW$182, DW_AT_type(*$C$DW$T$19)
    1375                      .dwattr $C$DW$182, DW_AT_name("ADCRESULT9")
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:22 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0440010                           PAGE   26

    1376                      .dwattr $C$DW$182, DW_AT_TI_symbol_name("_ADCRESULT9")
    1377                      .dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    1378                      .dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)
    1379              $C$DW$183       .dwtag  DW_TAG_member
    1380                      .dwattr $C$DW$183, DW_AT_type(*$C$DW$T$19)
    1381                      .dwattr $C$DW$183, DW_AT_name("ADCRESULT10")
    1382                      .dwattr $C$DW$183, DW_AT_TI_symbol_name("_ADCRESULT10")
    1383                      .dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1384                      .dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
    1385              $C$DW$184       .dwtag  DW_TAG_member
    1386                      .dwattr $C$DW$184, DW_AT_type(*$C$DW$T$19)
    1387                      .dwattr $C$DW$184, DW_AT_name("ADCRESULT11")
    1388                      .dwattr $C$DW$184, DW_AT_TI_symbol_name("_ADCRESULT11")
    1389                      .dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    1390                      .dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
    1391              $C$DW$185       .dwtag  DW_TAG_member
    1392                      .dwattr $C$DW$185, DW_AT_type(*$C$DW$T$19)
    1393                      .dwattr $C$DW$185, DW_AT_name("ADCRESULT12")
    1394                      .dwattr $C$DW$185, DW_AT_TI_symbol_name("_ADCRESULT12")
    1395                      .dwattr $C$DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1396                      .dwattr $C$DW$185, DW_AT_accessibility(DW_ACCESS_public)
    1397              $C$DW$186       .dwtag  DW_TAG_member
    1398                      .dwattr $C$DW$186, DW_AT_type(*$C$DW$T$19)
    1399                      .dwattr $C$DW$186, DW_AT_name("ADCRESULT13")
    1400                      .dwattr $C$DW$186, DW_AT_TI_symbol_name("_ADCRESULT13")
    1401                      .dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    1402                      .dwattr $C$DW$186, DW_AT_accessibility(DW_ACCESS_public)
    1403              $C$DW$187       .dwtag  DW_TAG_member
    1404                      .dwattr $C$DW$187, DW_AT_type(*$C$DW$T$19)
    1405                      .dwattr $C$DW$187, DW_AT_name("ADCRESULT14")
    1406                      .dwattr $C$DW$187, DW_AT_TI_symbol_name("_ADCRESULT14")
    1407                      .dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1408                      .dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)
    1409              $C$DW$188       .dwtag  DW_TAG_member
    1410                      .dwattr $C$DW$188, DW_AT_type(*$C$DW$T$19)
    1411                      .dwattr $C$DW$188, DW_AT_name("ADCRESULT15")
    1412                      .dwattr $C$DW$188, DW_AT_TI_symbol_name("_ADCRESULT15")
    1413                      .dwattr $C$DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
    1414                      .dwattr $C$DW$188, DW_AT_accessibility(DW_ACCESS_public)
    1415                      .dwendtag $C$DW$T$46
    1416              
    1417              $C$DW$189       .dwtag  DW_TAG_TI_far_type
    1418                      .dwattr $C$DW$189, DW_AT_type(*$C$DW$T$46)
    1419              $C$DW$T$444     .dwtag  DW_TAG_volatile_type
    1420                      .dwattr $C$DW$T$444, DW_AT_type(*$C$DW$189)
    1421              
    1422              $C$DW$T$47      .dwtag  DW_TAG_structure_type
    1423                      .dwattr $C$DW$T$47, DW_AT_name("AQCSFRC_BITS")
    1424                      .dwattr $C$DW$T$47, DW_AT_byte_size(0x01)
    1425              $C$DW$190       .dwtag  DW_TAG_member
    1426                      .dwattr $C$DW$190, DW_AT_type(*$C$DW$T$19)
    1427                      .dwattr $C$DW$190, DW_AT_name("CSFA")
    1428                      .dwattr $C$DW$190, DW_AT_TI_symbol_name("_CSFA")
    1429                      .dwattr $C$DW$190, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x02)
    1430                      .dwattr $C$DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:22 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0440010                           PAGE   27

    1431                      .dwattr $C$DW$190, DW_AT_accessibility(DW_ACCESS_public)
    1432              $C$DW$191       .dwtag  DW_TAG_member
    1433                      .dwattr $C$DW$191, DW_AT_type(*$C$DW$T$19)
    1434                      .dwattr $C$DW$191, DW_AT_name("CSFB")
    1435                      .dwattr $C$DW$191, DW_AT_TI_symbol_name("_CSFB")
    1436                      .dwattr $C$DW$191, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x02)
    1437                      .dwattr $C$DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1438                      .dwattr $C$DW$191, DW_AT_accessibility(DW_ACCESS_public)
    1439              $C$DW$192       .dwtag  DW_TAG_member
    1440                      .dwattr $C$DW$192, DW_AT_type(*$C$DW$T$19)
    1441                      .dwattr $C$DW$192, DW_AT_name("rsvd1")
    1442                      .dwattr $C$DW$192, DW_AT_TI_symbol_name("_rsvd1")
    1443                      .dwattr $C$DW$192, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0c)
    1444                      .dwattr $C$DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1445                      .dwattr $C$DW$192, DW_AT_accessibility(DW_ACCESS_public)
    1446                      .dwendtag $C$DW$T$47
    1447              
    1448              
    1449              $C$DW$T$48      .dwtag  DW_TAG_union_type
    1450                      .dwattr $C$DW$T$48, DW_AT_name("AQCSFRC_REG")
    1451                      .dwattr $C$DW$T$48, DW_AT_byte_size(0x01)
    1452              $C$DW$193       .dwtag  DW_TAG_member
    1453                      .dwattr $C$DW$193, DW_AT_type(*$C$DW$T$19)
    1454                      .dwattr $C$DW$193, DW_AT_name("all")
    1455                      .dwattr $C$DW$193, DW_AT_TI_symbol_name("_all")
    1456                      .dwattr $C$DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1457                      .dwattr $C$DW$193, DW_AT_accessibility(DW_ACCESS_public)
    1458              $C$DW$194       .dwtag  DW_TAG_member
    1459                      .dwattr $C$DW$194, DW_AT_type(*$C$DW$T$47)
    1460                      .dwattr $C$DW$194, DW_AT_name("bit")
    1461                      .dwattr $C$DW$194, DW_AT_TI_symbol_name("_bit")
    1462                      .dwattr $C$DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1463                      .dwattr $C$DW$194, DW_AT_accessibility(DW_ACCESS_public)
    1464                      .dwendtag $C$DW$T$48
    1465              
    1466              
    1467              $C$DW$T$49      .dwtag  DW_TAG_structure_type
    1468                      .dwattr $C$DW$T$49, DW_AT_name("AQCTL_BITS")
    1469                      .dwattr $C$DW$T$49, DW_AT_byte_size(0x01)
    1470              $C$DW$195       .dwtag  DW_TAG_member
    1471                      .dwattr $C$DW$195, DW_AT_type(*$C$DW$T$19)
    1472                      .dwattr $C$DW$195, DW_AT_name("ZRO")
    1473                      .dwattr $C$DW$195, DW_AT_TI_symbol_name("_ZRO")
    1474                      .dwattr $C$DW$195, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x02)
    1475                      .dwattr $C$DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1476                      .dwattr $C$DW$195, DW_AT_accessibility(DW_ACCESS_public)
    1477              $C$DW$196       .dwtag  DW_TAG_member
    1478                      .dwattr $C$DW$196, DW_AT_type(*$C$DW$T$19)
    1479                      .dwattr $C$DW$196, DW_AT_name("PRD")
    1480                      .dwattr $C$DW$196, DW_AT_TI_symbol_name("_PRD")
    1481                      .dwattr $C$DW$196, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x02)
    1482                      .dwattr $C$DW$196, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1483                      .dwattr $C$DW$196, DW_AT_accessibility(DW_ACCESS_public)
    1484              $C$DW$197       .dwtag  DW_TAG_member
    1485                      .dwattr $C$DW$197, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:22 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0440010                           PAGE   28

    1486                      .dwattr $C$DW$197, DW_AT_name("CAU")
    1487                      .dwattr $C$DW$197, DW_AT_TI_symbol_name("_CAU")
    1488                      .dwattr $C$DW$197, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x02)
    1489                      .dwattr $C$DW$197, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1490                      .dwattr $C$DW$197, DW_AT_accessibility(DW_ACCESS_public)
    1491              $C$DW$198       .dwtag  DW_TAG_member
    1492                      .dwattr $C$DW$198, DW_AT_type(*$C$DW$T$19)
    1493                      .dwattr $C$DW$198, DW_AT_name("CAD")
    1494                      .dwattr $C$DW$198, DW_AT_TI_symbol_name("_CAD")
    1495                      .dwattr $C$DW$198, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x02)
    1496                      .dwattr $C$DW$198, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1497                      .dwattr $C$DW$198, DW_AT_accessibility(DW_ACCESS_public)
    1498              $C$DW$199       .dwtag  DW_TAG_member
    1499                      .dwattr $C$DW$199, DW_AT_type(*$C$DW$T$19)
    1500                      .dwattr $C$DW$199, DW_AT_name("CBU")
    1501                      .dwattr $C$DW$199, DW_AT_TI_symbol_name("_CBU")
    1502                      .dwattr $C$DW$199, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x02)
    1503                      .dwattr $C$DW$199, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1504                      .dwattr $C$DW$199, DW_AT_accessibility(DW_ACCESS_public)
    1505              $C$DW$200       .dwtag  DW_TAG_member
    1506                      .dwattr $C$DW$200, DW_AT_type(*$C$DW$T$19)
    1507                      .dwattr $C$DW$200, DW_AT_name("CBD")
    1508                      .dwattr $C$DW$200, DW_AT_TI_symbol_name("_CBD")
    1509                      .dwattr $C$DW$200, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x02)
    1510                      .dwattr $C$DW$200, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1511                      .dwattr $C$DW$200, DW_AT_accessibility(DW_ACCESS_public)
    1512              $C$DW$201       .dwtag  DW_TAG_member
    1513                      .dwattr $C$DW$201, DW_AT_type(*$C$DW$T$19)
    1514                      .dwattr $C$DW$201, DW_AT_name("rsvd")
    1515                      .dwattr $C$DW$201, DW_AT_TI_symbol_name("_rsvd")
    1516                      .dwattr $C$DW$201, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x04)
    1517                      .dwattr $C$DW$201, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1518                      .dwattr $C$DW$201, DW_AT_accessibility(DW_ACCESS_public)
    1519                      .dwendtag $C$DW$T$49
    1520              
    1521              
    1522              $C$DW$T$50      .dwtag  DW_TAG_union_type
    1523                      .dwattr $C$DW$T$50, DW_AT_name("AQCTL_REG")
    1524                      .dwattr $C$DW$T$50, DW_AT_byte_size(0x01)
    1525              $C$DW$202       .dwtag  DW_TAG_member
    1526                      .dwattr $C$DW$202, DW_AT_type(*$C$DW$T$19)
    1527                      .dwattr $C$DW$202, DW_AT_name("all")
    1528                      .dwattr $C$DW$202, DW_AT_TI_symbol_name("_all")
    1529                      .dwattr $C$DW$202, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1530                      .dwattr $C$DW$202, DW_AT_accessibility(DW_ACCESS_public)
    1531              $C$DW$203       .dwtag  DW_TAG_member
    1532                      .dwattr $C$DW$203, DW_AT_type(*$C$DW$T$49)
    1533                      .dwattr $C$DW$203, DW_AT_name("bit")
    1534                      .dwattr $C$DW$203, DW_AT_TI_symbol_name("_bit")
    1535                      .dwattr $C$DW$203, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1536                      .dwattr $C$DW$203, DW_AT_accessibility(DW_ACCESS_public)
    1537                      .dwendtag $C$DW$T$50
    1538              
    1539              
    1540              $C$DW$T$51      .dwtag  DW_TAG_structure_type
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:22 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0440010                           PAGE   29

    1541                      .dwattr $C$DW$T$51, DW_AT_name("AQSFRC_BITS")
    1542                      .dwattr $C$DW$T$51, DW_AT_byte_size(0x01)
    1543              $C$DW$204       .dwtag  DW_TAG_member
    1544                      .dwattr $C$DW$204, DW_AT_type(*$C$DW$T$19)
    1545                      .dwattr $C$DW$204, DW_AT_name("ACTSFA")
    1546                      .dwattr $C$DW$204, DW_AT_TI_symbol_name("_ACTSFA")
