TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:25 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0574810                           PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v6.2.7 *
       3              ;* Date/Time created: Thu Jul 02 08:31:25 2015                 *
       4              ;***************************************************************
       5                      .compiler_opts --diag_wrap=off --float_support=fpu32 --hll_source=on --mem_model:code=flat --mem_mode
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("../DSP2833x_headers/source/PieVect_nonBIOS.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v6.2.7 Copyright (c) 1996-2014 Texas I
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("D:\ActiveProject\EKT5\PKMT_NONBIOS\InvertorCntrl\ISPprg")
      13              
      14              $C$DW$1 .dwtag  DW_TAG_subprogram, DW_AT_name("DINTCH1_ISR")
      15                      .dwattr $C$DW$1, DW_AT_TI_symbol_name("_DINTCH1_ISR")
      16                      .dwattr $C$DW$1, DW_AT_declaration

     534 000000fe 0000!         .bits   _LUF_ISR,32             ; _PieVectTableInit._LUF @ 4064
         000000ff 0000 
     535              
     536              $C$DW$79        .dwtag  DW_TAG_variable, DW_AT_name("PieVectTableInit")
     537                      .dwattr $C$DW$79, DW_AT_TI_symbol_name("_PieVectTableInit")
     538                      .dwattr $C$DW$79, DW_AT_location[DW_OP_addr _PieVectTableInit]
     539                      .dwattr $C$DW$79, DW_AT_type(*$C$DW$T$23)
     540                      .dwattr $C$DW$79, DW_AT_external
     541              ;       C:\ti\ccsv6\tools\compiler\c2000_6.2.7\bin\ac2000.exe -@C:\\Users\\Tester\\AppData\\Local\\Temp\\0574
     542              ;**************************************************************
     543              ;* UNDEFINED EXTERNAL REFERENCES                              *
     544              ;**************************************************************
     545                      .global _DINTCH1_ISR
     546                      .global _DINTCH2_ISR
     547                      .global _MRINTB_ISR
     548                      .global _MXINTB_ISR
     549                      .global _MXINTA_ISR
     550                      .global _DINTCH6_ISR
     551                      .global _I2CINT1A_ISR
     552                      .global _DINTCH4_ISR
     553                      .global _DINTCH5_ISR
     554                      .global _DINTCH3_ISR
     555                      .global _ECAP5_INT_ISR
     556                      .global _ECAP6_INT_ISR
     557                      .global _ECAP3_INT_ISR
     558                      .global _ECAP4_INT_ISR
     559                      .global _ECAP2_INT_ISR
     560                      .global _SPITXINTA_ISR
     561                      .global _MRINTA_ISR
     562                      .global _EQEP2_INT_ISR
     563                      .global _SPIRXINTA_ISR
     564                      .global _XINT4_ISR
     565                      .global _XINT5_ISR
     566                      .global _ECAN1INTB_ISR
     567                      .global _XINT3_ISR
     568                      .global _ECAN0INTB_ISR
     569                      .global _LUF_ISR
     570                      .global _rsvd_ISR
     571                      .global _XINT7_ISR
     572                      .global _LVF_ISR
     573                      .global _XINT6_ISR
     574                      .global _SCITXINTC_ISR
     575                      .global _SCIRXINTA_ISR
     576                      .global _I2CINT2A_ISR
     577                      .global _SCIRXINTC_ISR
     578                      .global _EQEP1_INT_ISR
     579                      .global _ECAN0INTA_ISR
     580                      .global _ECAN1INTA_ISR
     581                      .global _SCIRXINTB_ISR
     582                      .global _SCITXINTB_ISR
     583                      .global _SCITXINTA_ISR
     584                      .global _USER7_ISR
     585                      .global _USER8_ISR
     586                      .global _USER5_ISR
     587                      .global _USER6_ISR
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:25 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0574810                           PAGE   14

     588                      .global _USER4_ISR
     589                      .global _USER12_ISR
     590                      .global _SEQ1INT_ISR
     591                      .global _USER10_ISR
     592                      .global _USER11_ISR
     593                      .global _USER9_ISR
     594                      .global _RTOSINT_ISR
     595                      .global _EMUINT_ISR
     596                      .global _INT14_ISR
     597                      .global _DATALOG_ISR
     598                      .global _INT13_ISR
     599                      .global _USER2_ISR
     600                      .global _USER3_ISR
     601                      .global _ILLEGAL_ISR
     602                      .global _USER1_ISR
     603                      .global _EPWM1_INT_ISR
     604                      .global _EPWM2_INT_ISR
     605                      .global _EPWM5_TZINT_ISR
     606                      .global _EPWM6_TZINT_ISR
     607                      .global _EPWM4_TZINT_ISR
     608                      .global _EPWM6_INT_ISR
     609                      .global _ECAP1_INT_ISR
     610                      .global _EPWM4_INT_ISR
     611                      .global _EPWM5_INT_ISR
     612                      .global _EPWM3_INT_ISR
     613                      .global _XINT2_ISR
     614                      .global _ADCINT_ISR
     615                      .global _SEQ2INT_ISR
     616                      .global _XINT1_ISR
     617                      .global _NMI_ISR
     618                      .global _EPWM2_TZINT_ISR
     619                      .global _EPWM3_TZINT_ISR
     620                      .global _WAKEINT_ISR
     621                      .global _EPWM1_TZINT_ISR
     622                      .global _TINT0_ISR
     623              
     624              ;***************************************************************
     625              ;* TYPE INFORMATION                                            *
     626              ;***************************************************************
     627              
     628              $C$DW$T$22      .dwtag  DW_TAG_structure_type
     629                      .dwattr $C$DW$T$22, DW_AT_name("PIE_VECT_TABLE")
     630                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x100)
     631              $C$DW$80        .dwtag  DW_TAG_member
     632                      .dwattr $C$DW$80, DW_AT_type(*$C$DW$T$21)
     633                      .dwattr $C$DW$80, DW_AT_name("PIE1_RESERVED")
     634                      .dwattr $C$DW$80, DW_AT_TI_symbol_name("_PIE1_RESERVED")
     635                      .dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     636                      .dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
     637              $C$DW$81        .dwtag  DW_TAG_member
     638                      .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$21)
     639                      .dwattr $C$DW$81, DW_AT_name("PIE2_RESERVED")
     640                      .dwattr $C$DW$81, DW_AT_TI_symbol_name("_PIE2_RESERVED")
     641                      .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     642                      .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:25 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0574810                           PAGE   15

     643              $C$DW$82        .dwtag  DW_TAG_member
     644                      .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$21)
     645                      .dwattr $C$DW$82, DW_AT_name("PIE3_RESERVED")
     646                      .dwattr $C$DW$82, DW_AT_TI_symbol_name("_PIE3_RESERVED")
     647                      .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     648                      .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
     649              $C$DW$83        .dwtag  DW_TAG_member
     650                      .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$21)
     651                      .dwattr $C$DW$83, DW_AT_name("PIE4_RESERVED")
     652                      .dwattr $C$DW$83, DW_AT_TI_symbol_name("_PIE4_RESERVED")
     653                      .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     654                      .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
     655              $C$DW$84        .dwtag  DW_TAG_member
     656                      .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$21)
     657                      .dwattr $C$DW$84, DW_AT_name("PIE5_RESERVED")
     658                      .dwattr $C$DW$84, DW_AT_TI_symbol_name("_PIE5_RESERVED")
     659                      .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     660                      .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
     661              $C$DW$85        .dwtag  DW_TAG_member
     662                      .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$21)
     663                      .dwattr $C$DW$85, DW_AT_name("PIE6_RESERVED")
     664                      .dwattr $C$DW$85, DW_AT_TI_symbol_name("_PIE6_RESERVED")
     665                      .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
     666                      .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
     667              $C$DW$86        .dwtag  DW_TAG_member
     668                      .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$21)
     669                      .dwattr $C$DW$86, DW_AT_name("PIE7_RESERVED")
     670                      .dwattr $C$DW$86, DW_AT_TI_symbol_name("_PIE7_RESERVED")
     671                      .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
     672                      .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
     673              $C$DW$87        .dwtag  DW_TAG_member
     674                      .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$21)
     675                      .dwattr $C$DW$87, DW_AT_name("PIE8_RESERVED")
     676                      .dwattr $C$DW$87, DW_AT_TI_symbol_name("_PIE8_RESERVED")
     677                      .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
     678                      .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
     679              $C$DW$88        .dwtag  DW_TAG_member
     680                      .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$21)
     681                      .dwattr $C$DW$88, DW_AT_name("PIE9_RESERVED")
     682                      .dwattr $C$DW$88, DW_AT_TI_symbol_name("_PIE9_RESERVED")
     683                      .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
     684                      .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
     685              $C$DW$89        .dwtag  DW_TAG_member
     686                      .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$21)
     687                      .dwattr $C$DW$89, DW_AT_name("PIE10_RESERVED")
     688                      .dwattr $C$DW$89, DW_AT_TI_symbol_name("_PIE10_RESERVED")
     689                      .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
     690                      .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
     691              $C$DW$90        .dwtag  DW_TAG_member
     692                      .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$21)
     693                      .dwattr $C$DW$90, DW_AT_name("PIE11_RESERVED")
     694                      .dwattr $C$DW$90, DW_AT_TI_symbol_name("_PIE11_RESERVED")
     695                      .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
     696                      .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
     697              $C$DW$91        .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:25 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0574810                           PAGE   16

     698                      .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$21)
     699                      .dwattr $C$DW$91, DW_AT_name("PIE12_RESERVED")
     700                      .dwattr $C$DW$91, DW_AT_TI_symbol_name("_PIE12_RESERVED")
     701                      .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
     702                      .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
     703              $C$DW$92        .dwtag  DW_TAG_member
     704                      .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$21)
     705                      .dwattr $C$DW$92, DW_AT_name("PIE13_RESERVED")
     706                      .dwattr $C$DW$92, DW_AT_TI_symbol_name("_PIE13_RESERVED")
     707                      .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
     708                      .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
     709              $C$DW$93        .dwtag  DW_TAG_member
     710                      .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$21)
     711                      .dwattr $C$DW$93, DW_AT_name("XINT13")
     712                      .dwattr $C$DW$93, DW_AT_TI_symbol_name("_XINT13")
     713                      .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
     714                      .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
     715              $C$DW$94        .dwtag  DW_TAG_member
     716                      .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$21)
     717                      .dwattr $C$DW$94, DW_AT_name("TINT2")
     718                      .dwattr $C$DW$94, DW_AT_TI_symbol_name("_TINT2")
     719                      .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
     720                      .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
     721              $C$DW$95        .dwtag  DW_TAG_member
     722                      .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$21)
     723                      .dwattr $C$DW$95, DW_AT_name("DATALOG")
     724                      .dwattr $C$DW$95, DW_AT_TI_symbol_name("_DATALOG")
     725                      .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
     726                      .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
     727              $C$DW$96        .dwtag  DW_TAG_member
     728                      .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$21)
     729                      .dwattr $C$DW$96, DW_AT_name("RTOSINT")
     730                      .dwattr $C$DW$96, DW_AT_TI_symbol_name("_RTOSINT")
     731                      .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
     732                      .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
     733              $C$DW$97        .dwtag  DW_TAG_member
     734                      .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$21)
     735                      .dwattr $C$DW$97, DW_AT_name("EMUINT")
     736                      .dwattr $C$DW$97, DW_AT_TI_symbol_name("_EMUINT")
     737                      .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
     738                      .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
     739              $C$DW$98        .dwtag  DW_TAG_member
     740                      .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$21)
     741                      .dwattr $C$DW$98, DW_AT_name("XNMI")
     742                      .dwattr $C$DW$98, DW_AT_TI_symbol_name("_XNMI")
     743                      .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
     744                      .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
     745              $C$DW$99        .dwtag  DW_TAG_member
     746                      .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$21)
     747                      .dwattr $C$DW$99, DW_AT_name("ILLEGAL")
     748                      .dwattr $C$DW$99, DW_AT_TI_symbol_name("_ILLEGAL")
     749                      .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
     750                      .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
     751              $C$DW$100       .dwtag  DW_TAG_member
     752                      .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$21)
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:25 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0574810                           PAGE   17

     753                      .dwattr $C$DW$100, DW_AT_name("USER1")
     754                      .dwattr $C$DW$100, DW_AT_TI_symbol_name("_USER1")
     755                      .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
     756                      .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
     757              $C$DW$101       .dwtag  DW_TAG_member
     758                      .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$21)
     759                      .dwattr $C$DW$101, DW_AT_name("USER2")
     760                      .dwattr $C$DW$101, DW_AT_TI_symbol_name("_USER2")
     761                      .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
     762                      .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
     763              $C$DW$102       .dwtag  DW_TAG_member
     764                      .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$21)
     765                      .dwattr $C$DW$102, DW_AT_name("USER3")
     766                      .dwattr $C$DW$102, DW_AT_TI_symbol_name("_USER3")
     767                      .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
     768                      .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
     769              $C$DW$103       .dwtag  DW_TAG_member
     770                      .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$21)
     771                      .dwattr $C$DW$103, DW_AT_name("USER4")
     772                      .dwattr $C$DW$103, DW_AT_TI_symbol_name("_USER4")
     773                      .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
     774                      .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
     775              $C$DW$104       .dwtag  DW_TAG_member
     776                      .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$21)
     777                      .dwattr $C$DW$104, DW_AT_name("USER5")
     778                      .dwattr $C$DW$104, DW_AT_TI_symbol_name("_USER5")
     779                      .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
     780                      .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
     781              $C$DW$105       .dwtag  DW_TAG_member
     782                      .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$21)
     783                      .dwattr $C$DW$105, DW_AT_name("USER6")
     784                      .dwattr $C$DW$105, DW_AT_TI_symbol_name("_USER6")
     785                      .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
     786                      .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
     787              $C$DW$106       .dwtag  DW_TAG_member
     788                      .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$21)
     789                      .dwattr $C$DW$106, DW_AT_name("USER7")
     790                      .dwattr $C$DW$106, DW_AT_TI_symbol_name("_USER7")
     791                      .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
     792                      .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
     793              $C$DW$107       .dwtag  DW_TAG_member
     794                      .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$21)
     795                      .dwattr $C$DW$107, DW_AT_name("USER8")
     796                      .dwattr $C$DW$107, DW_AT_TI_symbol_name("_USER8")
     797                      .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
     798                      .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
     799              $C$DW$108       .dwtag  DW_TAG_member
     800                      .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$21)
     801                      .dwattr $C$DW$108, DW_AT_name("USER9")
     802                      .dwattr $C$DW$108, DW_AT_TI_symbol_name("_USER9")
     803                      .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
     804                      .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
     805              $C$DW$109       .dwtag  DW_TAG_member
     806                      .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$21)
     807                      .dwattr $C$DW$109, DW_AT_name("USER10")
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:25 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0574810                           PAGE   18

     808                      .dwattr $C$DW$109, DW_AT_TI_symbol_name("_USER10")
     809                      .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
     810                      .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
     811              $C$DW$110       .dwtag  DW_TAG_member
     812                      .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$21)
     813                      .dwattr $C$DW$110, DW_AT_name("USER11")
     814                      .dwattr $C$DW$110, DW_AT_TI_symbol_name("_USER11")
     815                      .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
     816                      .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
     817              $C$DW$111       .dwtag  DW_TAG_member
     818                      .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$21)
     819                      .dwattr $C$DW$111, DW_AT_name("USER12")
     820                      .dwattr $C$DW$111, DW_AT_TI_symbol_name("_USER12")
     821                      .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x3e]
     822                      .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
     823              $C$DW$112       .dwtag  DW_TAG_member
     824                      .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$21)
     825                      .dwattr $C$DW$112, DW_AT_name("SEQ1INT")
     826                      .dwattr $C$DW$112, DW_AT_TI_symbol_name("_SEQ1INT")
     827                      .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
     828                      .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
     829              $C$DW$113       .dwtag  DW_TAG_member
     830                      .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$21)
     831                      .dwattr $C$DW$113, DW_AT_name("SEQ2INT")
     832                      .dwattr $C$DW$113, DW_AT_TI_symbol_name("_SEQ2INT")
     833                      .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
     834                      .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
     835              $C$DW$114       .dwtag  DW_TAG_member
     836                      .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$21)
     837                      .dwattr $C$DW$114, DW_AT_name("rsvd1_3")
     838                      .dwattr $C$DW$114, DW_AT_TI_symbol_name("_rsvd1_3")
     839                      .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
     840                      .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
     841              $C$DW$115       .dwtag  DW_TAG_member
     842                      .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$21)
     843                      .dwattr $C$DW$115, DW_AT_name("XINT1")
     844                      .dwattr $C$DW$115, DW_AT_TI_symbol_name("_XINT1")
     845                      .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
     846                      .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
     847              $C$DW$116       .dwtag  DW_TAG_member
     848                      .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$21)
     849                      .dwattr $C$DW$116, DW_AT_name("XINT2")
     850                      .dwattr $C$DW$116, DW_AT_TI_symbol_name("_XINT2")
     851                      .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
     852                      .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
     853              $C$DW$117       .dwtag  DW_TAG_member
     854                      .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$21)
     855                      .dwattr $C$DW$117, DW_AT_name("ADCINT")
     856                      .dwattr $C$DW$117, DW_AT_TI_symbol_name("_ADCINT")
     857                      .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x4a]
     858                      .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
     859              $C$DW$118       .dwtag  DW_TAG_member
     860                      .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$21)
     861                      .dwattr $C$DW$118, DW_AT_name("TINT0")
     862                      .dwattr $C$DW$118, DW_AT_TI_symbol_name("_TINT0")
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:25 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0574810                           PAGE   19

     863                      .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
     864                      .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
     865              $C$DW$119       .dwtag  DW_TAG_member
     866                      .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$21)
     867                      .dwattr $C$DW$119, DW_AT_name("WAKEINT")
     868                      .dwattr $C$DW$119, DW_AT_TI_symbol_name("_WAKEINT")
     869                      .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x4e]
     870                      .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
     871              $C$DW$120       .dwtag  DW_TAG_member
     872                      .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$21)
     873                      .dwattr $C$DW$120, DW_AT_name("EPWM1_TZINT")
     874                      .dwattr $C$DW$120, DW_AT_TI_symbol_name("_EPWM1_TZINT")
     875                      .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
     876                      .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
     877              $C$DW$121       .dwtag  DW_TAG_member
     878                      .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$21)
     879                      .dwattr $C$DW$121, DW_AT_name("EPWM2_TZINT")
     880                      .dwattr $C$DW$121, DW_AT_TI_symbol_name("_EPWM2_TZINT")
     881                      .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x52]
     882                      .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
     883              $C$DW$122       .dwtag  DW_TAG_member
     884                      .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$21)
     885                      .dwattr $C$DW$122, DW_AT_name("EPWM3_TZINT")
     886                      .dwattr $C$DW$122, DW_AT_TI_symbol_name("_EPWM3_TZINT")
     887                      .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x54]
     888                      .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
     889              $C$DW$123       .dwtag  DW_TAG_member
     890                      .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$21)
     891                      .dwattr $C$DW$123, DW_AT_name("EPWM4_TZINT")
     892                      .dwattr $C$DW$123, DW_AT_TI_symbol_name("_EPWM4_TZINT")
     893                      .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x56]
     894                      .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
     895              $C$DW$124       .dwtag  DW_TAG_member
     896                      .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$21)
     897                      .dwattr $C$DW$124, DW_AT_name("EPWM5_TZINT")
     898                      .dwattr $C$DW$124, DW_AT_TI_symbol_name("_EPWM5_TZINT")
     899                      .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
     900                      .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
     901              $C$DW$125       .dwtag  DW_TAG_member
     902                      .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$21)
     903                      .dwattr $C$DW$125, DW_AT_name("EPWM6_TZINT")
     904                      .dwattr $C$DW$125, DW_AT_TI_symbol_name("_EPWM6_TZINT")
     905                      .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a]
     906                      .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
     907              $C$DW$126       .dwtag  DW_TAG_member
     908                      .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$21)
     909                      .dwattr $C$DW$126, DW_AT_name("rsvd2_7")
     910                      .dwattr $C$DW$126, DW_AT_TI_symbol_name("_rsvd2_7")
     911                      .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
     912                      .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
     913              $C$DW$127       .dwtag  DW_TAG_member
     914                      .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$21)
     915                      .dwattr $C$DW$127, DW_AT_name("rsvd2_8")
     916                      .dwattr $C$DW$127, DW_AT_TI_symbol_name("_rsvd2_8")
     917                      .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:25 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0574810                           PAGE   20

     918                      .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
     919              $C$DW$128       .dwtag  DW_TAG_member
     920                      .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$21)
     921                      .dwattr $C$DW$128, DW_AT_name("EPWM1_INT")
     922                      .dwattr $C$DW$128, DW_AT_TI_symbol_name("_EPWM1_INT")
     923                      .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
     924                      .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
     925              $C$DW$129       .dwtag  DW_TAG_member
     926                      .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$21)
     927                      .dwattr $C$DW$129, DW_AT_name("EPWM2_INT")
     928                      .dwattr $C$DW$129, DW_AT_TI_symbol_name("_EPWM2_INT")
     929                      .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x62]
     930                      .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
     931              $C$DW$130       .dwtag  DW_TAG_member
     932                      .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$21)
     933                      .dwattr $C$DW$130, DW_AT_name("EPWM3_INT")
     934                      .dwattr $C$DW$130, DW_AT_TI_symbol_name("_EPWM3_INT")
     935                      .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x64]
     936                      .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
     937              $C$DW$131       .dwtag  DW_TAG_member
     938                      .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$21)
     939                      .dwattr $C$DW$131, DW_AT_name("EPWM4_INT")
     940                      .dwattr $C$DW$131, DW_AT_TI_symbol_name("_EPWM4_INT")
     941                      .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x66]
     942                      .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
     943              $C$DW$132       .dwtag  DW_TAG_member
     944                      .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$21)
     945                      .dwattr $C$DW$132, DW_AT_name("EPWM5_INT")
     946                      .dwattr $C$DW$132, DW_AT_TI_symbol_name("_EPWM5_INT")
     947                      .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x68]
     948                      .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
     949              $C$DW$133       .dwtag  DW_TAG_member
     950                      .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$21)
     951                      .dwattr $C$DW$133, DW_AT_name("EPWM6_INT")
     952                      .dwattr $C$DW$133, DW_AT_TI_symbol_name("_EPWM6_INT")
     953                      .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x6a]
     954                      .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
     955              $C$DW$134       .dwtag  DW_TAG_member
     956                      .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$21)
     957                      .dwattr $C$DW$134, DW_AT_name("rsvd3_7")
     958                      .dwattr $C$DW$134, DW_AT_TI_symbol_name("_rsvd3_7")
     959                      .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x6c]
     960                      .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
     961              $C$DW$135       .dwtag  DW_TAG_member
     962                      .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$21)
     963                      .dwattr $C$DW$135, DW_AT_name("rsvd3_8")
     964                      .dwattr $C$DW$135, DW_AT_TI_symbol_name("_rsvd3_8")
     965                      .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x6e]
     966                      .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
     967              $C$DW$136       .dwtag  DW_TAG_member
     968                      .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$21)
     969                      .dwattr $C$DW$136, DW_AT_name("ECAP1_INT")
     970                      .dwattr $C$DW$136, DW_AT_TI_symbol_name("_ECAP1_INT")
     971                      .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x70]
     972                      .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:25 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0574810                           PAGE   21

     973              $C$DW$137       .dwtag  DW_TAG_member
     974                      .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$21)
     975                      .dwattr $C$DW$137, DW_AT_name("ECAP2_INT")
     976                      .dwattr $C$DW$137, DW_AT_TI_symbol_name("_ECAP2_INT")
     977                      .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x72]
     978                      .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
     979              $C$DW$138       .dwtag  DW_TAG_member
     980                      .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$21)
     981                      .dwattr $C$DW$138, DW_AT_name("ECAP3_INT")
     982                      .dwattr $C$DW$138, DW_AT_TI_symbol_name("_ECAP3_INT")
     983                      .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x74]
     984                      .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
     985              $C$DW$139       .dwtag  DW_TAG_member
     986                      .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$21)
     987                      .dwattr $C$DW$139, DW_AT_name("ECAP4_INT")
     988                      .dwattr $C$DW$139, DW_AT_TI_symbol_name("_ECAP4_INT")
     989                      .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x76]
     990                      .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
     991              $C$DW$140       .dwtag  DW_TAG_member
     992                      .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$21)
     993                      .dwattr $C$DW$140, DW_AT_name("ECAP5_INT")
     994                      .dwattr $C$DW$140, DW_AT_TI_symbol_name("_ECAP5_INT")
     995                      .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
     996                      .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
     997              $C$DW$141       .dwtag  DW_TAG_member
     998                      .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$21)
     999                      .dwattr $C$DW$141, DW_AT_name("ECAP6_INT")
    1000                      .dwattr $C$DW$141, DW_AT_TI_symbol_name("_ECAP6_INT")
    1001                      .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x7a]
    1002                      .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    1003              $C$DW$142       .dwtag  DW_TAG_member
    1004                      .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$21)
    1005                      .dwattr $C$DW$142, DW_AT_name("rsvd4_7")
    1006                      .dwattr $C$DW$142, DW_AT_TI_symbol_name("_rsvd4_7")
    1007                      .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x7c]
    1008                      .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    1009              $C$DW$143       .dwtag  DW_TAG_member
    1010                      .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$21)
    1011                      .dwattr $C$DW$143, DW_AT_name("rsvd4_8")
    1012                      .dwattr $C$DW$143, DW_AT_TI_symbol_name("_rsvd4_8")
    1013                      .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x7e]
    1014                      .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    1015              $C$DW$144       .dwtag  DW_TAG_member
    1016                      .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$21)
    1017                      .dwattr $C$DW$144, DW_AT_name("EQEP1_INT")
    1018                      .dwattr $C$DW$144, DW_AT_TI_symbol_name("_EQEP1_INT")
    1019                      .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x80]
    1020                      .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    1021              $C$DW$145       .dwtag  DW_TAG_member
    1022                      .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$21)
    1023                      .dwattr $C$DW$145, DW_AT_name("EQEP2_INT")
    1024                      .dwattr $C$DW$145, DW_AT_TI_symbol_name("_EQEP2_INT")
    1025                      .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x82]
    1026                      .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    1027              $C$DW$146       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:25 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0574810                           PAGE   22

    1028                      .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$21)
    1029                      .dwattr $C$DW$146, DW_AT_name("rsvd5_3")
    1030                      .dwattr $C$DW$146, DW_AT_TI_symbol_name("_rsvd5_3")
    1031                      .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x84]
    1032                      .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
    1033              $C$DW$147       .dwtag  DW_TAG_member
    1034                      .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$21)
    1035                      .dwattr $C$DW$147, DW_AT_name("rsvd5_4")
    1036                      .dwattr $C$DW$147, DW_AT_TI_symbol_name("_rsvd5_4")
    1037                      .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x86]
    1038                      .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
    1039              $C$DW$148       .dwtag  DW_TAG_member
    1040                      .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$21)
    1041                      .dwattr $C$DW$148, DW_AT_name("rsvd5_5")
    1042                      .dwattr $C$DW$148, DW_AT_TI_symbol_name("_rsvd5_5")
    1043                      .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x88]
    1044                      .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    1045              $C$DW$149       .dwtag  DW_TAG_member
    1046                      .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$21)
    1047                      .dwattr $C$DW$149, DW_AT_name("rsvd5_6")
    1048                      .dwattr $C$DW$149, DW_AT_TI_symbol_name("_rsvd5_6")
    1049                      .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x8a]
    1050                      .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    1051              $C$DW$150       .dwtag  DW_TAG_member
    1052                      .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$21)
    1053                      .dwattr $C$DW$150, DW_AT_name("rsvd5_7")
    1054                      .dwattr $C$DW$150, DW_AT_TI_symbol_name("_rsvd5_7")
    1055                      .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x8c]
    1056                      .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
    1057              $C$DW$151       .dwtag  DW_TAG_member
    1058                      .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$21)
    1059                      .dwattr $C$DW$151, DW_AT_name("rsvd5_8")
    1060                      .dwattr $C$DW$151, DW_AT_TI_symbol_name("_rsvd5_8")
    1061                      .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x8e]
    1062                      .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    1063              $C$DW$152       .dwtag  DW_TAG_member
    1064                      .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$21)
    1065                      .dwattr $C$DW$152, DW_AT_name("SPIRXINTA")
    1066                      .dwattr $C$DW$152, DW_AT_TI_symbol_name("_SPIRXINTA")
    1067                      .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x90]
    1068                      .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    1069              $C$DW$153       .dwtag  DW_TAG_member
    1070                      .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$21)
    1071                      .dwattr $C$DW$153, DW_AT_name("SPITXINTA")
    1072                      .dwattr $C$DW$153, DW_AT_TI_symbol_name("_SPITXINTA")
    1073                      .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x92]
    1074                      .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    1075              $C$DW$154       .dwtag  DW_TAG_member
    1076                      .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$21)
    1077                      .dwattr $C$DW$154, DW_AT_name("MRINTB")
    1078                      .dwattr $C$DW$154, DW_AT_TI_symbol_name("_MRINTB")
    1079                      .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x94]
    1080                      .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
    1081              $C$DW$155       .dwtag  DW_TAG_member
    1082                      .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$21)
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:25 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0574810                           PAGE   23

    1083                      .dwattr $C$DW$155, DW_AT_name("MXINTB")
    1084                      .dwattr $C$DW$155, DW_AT_TI_symbol_name("_MXINTB")
    1085                      .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x96]
    1086                      .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
    1087              $C$DW$156       .dwtag  DW_TAG_member
    1088                      .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$21)
    1089                      .dwattr $C$DW$156, DW_AT_name("MRINTA")
    1090                      .dwattr $C$DW$156, DW_AT_TI_symbol_name("_MRINTA")
    1091                      .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x98]
    1092                      .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    1093              $C$DW$157       .dwtag  DW_TAG_member
    1094                      .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$21)
    1095                      .dwattr $C$DW$157, DW_AT_name("MXINTA")
    1096                      .dwattr $C$DW$157, DW_AT_TI_symbol_name("_MXINTA")
    1097                      .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x9a]
    1098                      .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    1099              $C$DW$158       .dwtag  DW_TAG_member
    1100                      .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$21)
    1101                      .dwattr $C$DW$158, DW_AT_name("rsvd6_7")
    1102                      .dwattr $C$DW$158, DW_AT_TI_symbol_name("_rsvd6_7")
    1103                      .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x9c]
    1104                      .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    1105              $C$DW$159       .dwtag  DW_TAG_member
    1106                      .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$21)
    1107                      .dwattr $C$DW$159, DW_AT_name("rsvd6_8")
    1108                      .dwattr $C$DW$159, DW_AT_TI_symbol_name("_rsvd6_8")
    1109                      .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x9e]
    1110                      .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    1111              $C$DW$160       .dwtag  DW_TAG_member
    1112                      .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$21)
    1113                      .dwattr $C$DW$160, DW_AT_name("DINTCH1")
    1114                      .dwattr $C$DW$160, DW_AT_TI_symbol_name("_DINTCH1")
    1115                      .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0xa0]
    1116                      .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    1117              $C$DW$161       .dwtag  DW_TAG_member
    1118                      .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$21)
    1119                      .dwattr $C$DW$161, DW_AT_name("DINTCH2")
    1120                      .dwattr $C$DW$161, DW_AT_TI_symbol_name("_DINTCH2")
    1121                      .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0xa2]
    1122                      .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    1123              $C$DW$162       .dwtag  DW_TAG_member
    1124                      .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$21)
    1125                      .dwattr $C$DW$162, DW_AT_name("DINTCH3")
    1126                      .dwattr $C$DW$162, DW_AT_TI_symbol_name("_DINTCH3")
    1127                      .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0xa4]
    1128                      .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    1129              $C$DW$163       .dwtag  DW_TAG_member
    1130                      .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$21)
    1131                      .dwattr $C$DW$163, DW_AT_name("DINTCH4")
    1132                      .dwattr $C$DW$163, DW_AT_TI_symbol_name("_DINTCH4")
    1133                      .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0xa6]
    1134                      .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    1135              $C$DW$164       .dwtag  DW_TAG_member
    1136                      .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$21)
    1137                      .dwattr $C$DW$164, DW_AT_name("DINTCH5")
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:25 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0574810                           PAGE   24

    1138                      .dwattr $C$DW$164, DW_AT_TI_symbol_name("_DINTCH5")
    1139                      .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0xa8]
    1140                      .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    1141              $C$DW$165       .dwtag  DW_TAG_member
    1142                      .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$21)
    1143                      .dwattr $C$DW$165, DW_AT_name("DINTCH6")
    1144                      .dwattr $C$DW$165, DW_AT_TI_symbol_name("_DINTCH6")
    1145                      .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0xaa]
    1146                      .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    1147              $C$DW$166       .dwtag  DW_TAG_member
    1148                      .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$21)
    1149                      .dwattr $C$DW$166, DW_AT_name("rsvd7_7")
    1150                      .dwattr $C$DW$166, DW_AT_TI_symbol_name("_rsvd7_7")
    1151                      .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0xac]
    1152                      .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    1153              $C$DW$167       .dwtag  DW_TAG_member
    1154                      .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$21)
    1155                      .dwattr $C$DW$167, DW_AT_name("rsvd7_8")
    1156                      .dwattr $C$DW$167, DW_AT_TI_symbol_name("_rsvd7_8")
    1157                      .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0xae]
    1158                      .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    1159              $C$DW$168       .dwtag  DW_TAG_member
    1160                      .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$21)
    1161                      .dwattr $C$DW$168, DW_AT_name("I2CINT1A")
    1162                      .dwattr $C$DW$168, DW_AT_TI_symbol_name("_I2CINT1A")
    1163                      .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0xb0]
    1164                      .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    1165              $C$DW$169       .dwtag  DW_TAG_member
    1166                      .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$21)
    1167                      .dwattr $C$DW$169, DW_AT_name("I2CINT2A")
    1168                      .dwattr $C$DW$169, DW_AT_TI_symbol_name("_I2CINT2A")
    1169                      .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0xb2]
    1170                      .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    1171              $C$DW$170       .dwtag  DW_TAG_member
    1172                      .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$21)
    1173                      .dwattr $C$DW$170, DW_AT_name("rsvd8_3")
    1174                      .dwattr $C$DW$170, DW_AT_TI_symbol_name("_rsvd8_3")
    1175                      .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0xb4]
    1176                      .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    1177              $C$DW$171       .dwtag  DW_TAG_member
    1178                      .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$21)
    1179                      .dwattr $C$DW$171, DW_AT_name("rsvd8_4")
    1180                      .dwattr $C$DW$171, DW_AT_TI_symbol_name("_rsvd8_4")
    1181                      .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0xb6]
    1182                      .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    1183              $C$DW$172       .dwtag  DW_TAG_member
    1184                      .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$21)
    1185                      .dwattr $C$DW$172, DW_AT_name("SCIRXINTC")
    1186                      .dwattr $C$DW$172, DW_AT_TI_symbol_name("_SCIRXINTC")
    1187                      .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0xb8]
    1188                      .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    1189              $C$DW$173       .dwtag  DW_TAG_member
    1190                      .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$21)
    1191                      .dwattr $C$DW$173, DW_AT_name("SCITXINTC")
    1192                      .dwattr $C$DW$173, DW_AT_TI_symbol_name("_SCITXINTC")
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:25 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0574810                           PAGE   25

    1193                      .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0xba]
    1194                      .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
    1195              $C$DW$174       .dwtag  DW_TAG_member
    1196                      .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$21)
    1197                      .dwattr $C$DW$174, DW_AT_name("rsvd8_7")
    1198                      .dwattr $C$DW$174, DW_AT_TI_symbol_name("_rsvd8_7")
    1199                      .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0xbc]
    1200                      .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
    1201              $C$DW$175       .dwtag  DW_TAG_member
    1202                      .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$21)
    1203                      .dwattr $C$DW$175, DW_AT_name("rsvd8_8")
    1204                      .dwattr $C$DW$175, DW_AT_TI_symbol_name("_rsvd8_8")
    1205                      .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0xbe]
    1206                      .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
    1207              $C$DW$176       .dwtag  DW_TAG_member
    1208                      .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$21)
    1209                      .dwattr $C$DW$176, DW_AT_name("SCIRXINTA")
    1210                      .dwattr $C$DW$176, DW_AT_TI_symbol_name("_SCIRXINTA")
    1211                      .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0xc0]
    1212                      .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
    1213              $C$DW$177       .dwtag  DW_TAG_member
    1214                      .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$21)
    1215                      .dwattr $C$DW$177, DW_AT_name("SCITXINTA")
    1216                      .dwattr $C$DW$177, DW_AT_TI_symbol_name("_SCITXINTA")
    1217                      .dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0xc2]
    1218                      .dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
    1219              $C$DW$178       .dwtag  DW_TAG_member
    1220                      .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$21)
    1221                      .dwattr $C$DW$178, DW_AT_name("SCIRXINTB")
    1222                      .dwattr $C$DW$178, DW_AT_TI_symbol_name("_SCIRXINTB")
    1223                      .dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0xc4]
    1224                      .dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
    1225              $C$DW$179       .dwtag  DW_TAG_member
    1226                      .dwattr $C$DW$179, DW_AT_type(*$C$DW$T$21)
    1227                      .dwattr $C$DW$179, DW_AT_name("SCITXINTB")
    1228                      .dwattr $C$DW$179, DW_AT_TI_symbol_name("_SCITXINTB")
    1229                      .dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0xc6]
    1230                      .dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
    1231              $C$DW$180       .dwtag  DW_TAG_member
    1232                      .dwattr $C$DW$180, DW_AT_type(*$C$DW$T$21)
    1233                      .dwattr $C$DW$180, DW_AT_name("ECAN0INTA")
    1234                      .dwattr $C$DW$180, DW_AT_TI_symbol_name("_ECAN0INTA")
    1235                      .dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0xc8]
    1236                      .dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
    1237              $C$DW$181       .dwtag  DW_TAG_member
    1238                      .dwattr $C$DW$181, DW_AT_type(*$C$DW$T$21)
    1239                      .dwattr $C$DW$181, DW_AT_name("ECAN1INTA")
    1240                      .dwattr $C$DW$181, DW_AT_TI_symbol_name("_ECAN1INTA")
    1241                      .dwattr $C$DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0xca]
    1242                      .dwattr $C$DW$181, DW_AT_accessibility(DW_ACCESS_public)
    1243              $C$DW$182       .dwtag  DW_TAG_member
    1244                      .dwattr $C$DW$182, DW_AT_type(*$C$DW$T$21)
    1245                      .dwattr $C$DW$182, DW_AT_name("ECAN0INTB")
    1246                      .dwattr $C$DW$182, DW_AT_TI_symbol_name("_ECAN0INTB")
    1247                      .dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0xcc]
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:25 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0574810                           PAGE   26

    1248                      .dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)
    1249              $C$DW$183       .dwtag  DW_TAG_member
    1250                      .dwattr $C$DW$183, DW_AT_type(*$C$DW$T$21)
    1251                      .dwattr $C$DW$183, DW_AT_name("ECAN1INTB")
    1252                      .dwattr $C$DW$183, DW_AT_TI_symbol_name("_ECAN1INTB")
    1253                      .dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0xce]
    1254                      .dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
    1255              $C$DW$184       .dwtag  DW_TAG_member
    1256                      .dwattr $C$DW$184, DW_AT_type(*$C$DW$T$21)
    1257                      .dwattr $C$DW$184, DW_AT_name("rsvd10_1")
    1258                      .dwattr $C$DW$184, DW_AT_TI_symbol_name("_rsvd10_1")
    1259                      .dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0xd0]
    1260                      .dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
    1261              $C$DW$185       .dwtag  DW_TAG_member
    1262                      .dwattr $C$DW$185, DW_AT_type(*$C$DW$T$21)
    1263                      .dwattr $C$DW$185, DW_AT_name("rsvd10_2")
    1264                      .dwattr $C$DW$185, DW_AT_TI_symbol_name("_rsvd10_2")
    1265                      .dwattr $C$DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0xd2]
    1266                      .dwattr $C$DW$185, DW_AT_accessibility(DW_ACCESS_public)
    1267              $C$DW$186       .dwtag  DW_TAG_member
    1268                      .dwattr $C$DW$186, DW_AT_type(*$C$DW$T$21)
    1269                      .dwattr $C$DW$186, DW_AT_name("rsvd10_3")
    1270                      .dwattr $C$DW$186, DW_AT_TI_symbol_name("_rsvd10_3")
    1271                      .dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0xd4]
    1272                      .dwattr $C$DW$186, DW_AT_accessibility(DW_ACCESS_public)
    1273              $C$DW$187       .dwtag  DW_TAG_member
    1274                      .dwattr $C$DW$187, DW_AT_type(*$C$DW$T$21)
    1275                      .dwattr $C$DW$187, DW_AT_name("rsvd10_4")
    1276                      .dwattr $C$DW$187, DW_AT_TI_symbol_name("_rsvd10_4")
    1277                      .dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0xd6]
    1278                      .dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)
    1279              $C$DW$188       .dwtag  DW_TAG_member
    1280                      .dwattr $C$DW$188, DW_AT_type(*$C$DW$T$21)
    1281                      .dwattr $C$DW$188, DW_AT_name("rsvd10_5")
    1282                      .dwattr $C$DW$188, DW_AT_TI_symbol_name("_rsvd10_5")
    1283                      .dwattr $C$DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0xd8]
    1284                      .dwattr $C$DW$188, DW_AT_accessibility(DW_ACCESS_public)
    1285              $C$DW$189       .dwtag  DW_TAG_member
    1286                      .dwattr $C$DW$189, DW_AT_type(*$C$DW$T$21)
    1287                      .dwattr $C$DW$189, DW_AT_name("rsvd10_6")
    1288                      .dwattr $C$DW$189, DW_AT_TI_symbol_name("_rsvd10_6")
    1289                      .dwattr $C$DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0xda]
    1290                      .dwattr $C$DW$189, DW_AT_accessibility(DW_ACCESS_public)
    1291              $C$DW$190       .dwtag  DW_TAG_member
    1292                      .dwattr $C$DW$190, DW_AT_type(*$C$DW$T$21)
    1293                      .dwattr $C$DW$190, DW_AT_name("rsvd10_7")
    1294                      .dwattr $C$DW$190, DW_AT_TI_symbol_name("_rsvd10_7")
    1295                      .dwattr $C$DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0xdc]
    1296                      .dwattr $C$DW$190, DW_AT_accessibility(DW_ACCESS_public)
    1297              $C$DW$191       .dwtag  DW_TAG_member
    1298                      .dwattr $C$DW$191, DW_AT_type(*$C$DW$T$21)
    1299                      .dwattr $C$DW$191, DW_AT_name("rsvd10_8")
    1300                      .dwattr $C$DW$191, DW_AT_TI_symbol_name("_rsvd10_8")
    1301                      .dwattr $C$DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0xde]
    1302                      .dwattr $C$DW$191, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:25 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0574810                           PAGE   27

    1303              $C$DW$192       .dwtag  DW_TAG_member
    1304                      .dwattr $C$DW$192, DW_AT_type(*$C$DW$T$21)
    1305                      .dwattr $C$DW$192, DW_AT_name("rsvd11_1")
    1306                      .dwattr $C$DW$192, DW_AT_TI_symbol_name("_rsvd11_1")
    1307                      .dwattr $C$DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0xe0]
    1308                      .dwattr $C$DW$192, DW_AT_accessibility(DW_ACCESS_public)
    1309              $C$DW$193       .dwtag  DW_TAG_member
    1310                      .dwattr $C$DW$193, DW_AT_type(*$C$DW$T$21)
    1311                      .dwattr $C$DW$193, DW_AT_name("rsvd11_2")
    1312                      .dwattr $C$DW$193, DW_AT_TI_symbol_name("_rsvd11_2")
    1313                      .dwattr $C$DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0xe2]
    1314                      .dwattr $C$DW$193, DW_AT_accessibility(DW_ACCESS_public)
    1315              $C$DW$194       .dwtag  DW_TAG_member
    1316                      .dwattr $C$DW$194, DW_AT_type(*$C$DW$T$21)
    1317                      .dwattr $C$DW$194, DW_AT_name("rsvd11_3")
    1318                      .dwattr $C$DW$194, DW_AT_TI_symbol_name("_rsvd11_3")
    1319                      .dwattr $C$DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0xe4]
    1320                      .dwattr $C$DW$194, DW_AT_accessibility(DW_ACCESS_public)
    1321              $C$DW$195       .dwtag  DW_TAG_member
    1322                      .dwattr $C$DW$195, DW_AT_type(*$C$DW$T$21)
    1323                      .dwattr $C$DW$195, DW_AT_name("rsvd11_4")
    1324                      .dwattr $C$DW$195, DW_AT_TI_symbol_name("_rsvd11_4")
    1325                      .dwattr $C$DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0xe6]
    1326                      .dwattr $C$DW$195, DW_AT_accessibility(DW_ACCESS_public)
    1327              $C$DW$196       .dwtag  DW_TAG_member
    1328                      .dwattr $C$DW$196, DW_AT_type(*$C$DW$T$21)
    1329                      .dwattr $C$DW$196, DW_AT_name("rsvd11_5")
    1330                      .dwattr $C$DW$196, DW_AT_TI_symbol_name("_rsvd11_5")
    1331                      .dwattr $C$DW$196, DW_AT_data_member_location[DW_OP_plus_uconst 0xe8]
    1332                      .dwattr $C$DW$196, DW_AT_accessibility(DW_ACCESS_public)
    1333              $C$DW$197       .dwtag  DW_TAG_member
    1334                      .dwattr $C$DW$197, DW_AT_type(*$C$DW$T$21)
    1335                      .dwattr $C$DW$197, DW_AT_name("rsvd11_6")
    1336                      .dwattr $C$DW$197, DW_AT_TI_symbol_name("_rsvd11_6")
    1337                      .dwattr $C$DW$197, DW_AT_data_member_location[DW_OP_plus_uconst 0xea]
    1338                      .dwattr $C$DW$197, DW_AT_accessibility(DW_ACCESS_public)
    1339              $C$DW$198       .dwtag  DW_TAG_member
    1340                      .dwattr $C$DW$198, DW_AT_type(*$C$DW$T$21)
    1341                      .dwattr $C$DW$198, DW_AT_name("rsvd11_7")
    1342                      .dwattr $C$DW$198, DW_AT_TI_symbol_name("_rsvd11_7")
    1343                      .dwattr $C$DW$198, DW_AT_data_member_location[DW_OP_plus_uconst 0xec]
    1344                      .dwattr $C$DW$198, DW_AT_accessibility(DW_ACCESS_public)
    1345              $C$DW$199       .dwtag  DW_TAG_member
    1346                      .dwattr $C$DW$199, DW_AT_type(*$C$DW$T$21)
    1347                      .dwattr $C$DW$199, DW_AT_name("rsvd11_8")
    1348                      .dwattr $C$DW$199, DW_AT_TI_symbol_name("_rsvd11_8")
    1349                      .dwattr $C$DW$199, DW_AT_data_member_location[DW_OP_plus_uconst 0xee]
    1350                      .dwattr $C$DW$199, DW_AT_accessibility(DW_ACCESS_public)
    1351              $C$DW$200       .dwtag  DW_TAG_member
    1352                      .dwattr $C$DW$200, DW_AT_type(*$C$DW$T$21)
    1353                      .dwattr $C$DW$200, DW_AT_name("XINT3")
    1354                      .dwattr $C$DW$200, DW_AT_TI_symbol_name("_XINT3")
    1355                      .dwattr $C$DW$200, DW_AT_data_member_location[DW_OP_plus_uconst 0xf0]
    1356                      .dwattr $C$DW$200, DW_AT_accessibility(DW_ACCESS_public)
    1357              $C$DW$201       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:25 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0574810                           PAGE   28

    1358                      .dwattr $C$DW$201, DW_AT_type(*$C$DW$T$21)
    1359                      .dwattr $C$DW$201, DW_AT_name("XINT4")
    1360                      .dwattr $C$DW$201, DW_AT_TI_symbol_name("_XINT4")
    1361                      .dwattr $C$DW$201, DW_AT_data_member_location[DW_OP_plus_uconst 0xf2]
    1362                      .dwattr $C$DW$201, DW_AT_accessibility(DW_ACCESS_public)
    1363              $C$DW$202       .dwtag  DW_TAG_member
    1364                      .dwattr $C$DW$202, DW_AT_type(*$C$DW$T$21)
    1365                      .dwattr $C$DW$202, DW_AT_name("XINT5")
    1366                      .dwattr $C$DW$202, DW_AT_TI_symbol_name("_XINT5")
    1367                      .dwattr $C$DW$202, DW_AT_data_member_location[DW_OP_plus_uconst 0xf4]
    1368                      .dwattr $C$DW$202, DW_AT_accessibility(DW_ACCESS_public)
    1369              $C$DW$203       .dwtag  DW_TAG_member
    1370                      .dwattr $C$DW$203, DW_AT_type(*$C$DW$T$21)
    1371                      .dwattr $C$DW$203, DW_AT_name("XINT6")
    1372                      .dwattr $C$DW$203, DW_AT_TI_symbol_name("_XINT6")
    1373                      .dwattr $C$DW$203, DW_AT_data_member_location[DW_OP_plus_uconst 0xf6]
    1374                      .dwattr $C$DW$203, DW_AT_accessibility(DW_ACCESS_public)
    1375              $C$DW$204       .dwtag  DW_TAG_member
    1376                      .dwattr $C$DW$204, DW_AT_type(*$C$DW$T$21)
    1377                      .dwattr $C$DW$204, DW_AT_name("XINT7")
    1378                      .dwattr $C$DW$204, DW_AT_TI_symbol_name("_XINT7")
    1379                      .dwattr $C$DW$204, DW_AT_data_member_location[DW_OP_plus_uconst 0xf8]
    1380                      .dwattr $C$DW$204, DW_AT_accessibility(DW_ACCESS_public)
    1381              $C$DW$205       .dwtag  DW_TAG_member
    1382                      .dwattr $C$DW$205, DW_AT_type(*$C$DW$T$21)
    1383                      .dwattr $C$DW$205, DW_AT_name("rsvd12_6")
    1384                      .dwattr $C$DW$205, DW_AT_TI_symbol_name("_rsvd12_6")
    1385                      .dwattr $C$DW$205, DW_AT_data_member_location[DW_OP_plus_uconst 0xfa]
    1386                      .dwattr $C$DW$205, DW_AT_accessibility(DW_ACCESS_public)
    1387              $C$DW$206       .dwtag  DW_TAG_member
    1388                      .dwattr $C$DW$206, DW_AT_type(*$C$DW$T$21)
    1389                      .dwattr $C$DW$206, DW_AT_name("LVF")
    1390                      .dwattr $C$DW$206, DW_AT_TI_symbol_name("_LVF")
    1391                      .dwattr $C$DW$206, DW_AT_data_member_location[DW_OP_plus_uconst 0xfc]
    1392                      .dwattr $C$DW$206, DW_AT_accessibility(DW_ACCESS_public)
    1393              $C$DW$207       .dwtag  DW_TAG_member
    1394                      .dwattr $C$DW$207, DW_AT_type(*$C$DW$T$21)
    1395                      .dwattr $C$DW$207, DW_AT_name("LUF")
    1396                      .dwattr $C$DW$207, DW_AT_TI_symbol_name("_LUF")
    1397                      .dwattr $C$DW$207, DW_AT_data_member_location[DW_OP_plus_uconst 0xfe]
    1398                      .dwattr $C$DW$207, DW_AT_accessibility(DW_ACCESS_public)
    1399                      .dwendtag $C$DW$T$22
    1400              
    1401              $C$DW$208       .dwtag  DW_TAG_TI_far_type
    1402                      .dwattr $C$DW$208, DW_AT_type(*$C$DW$T$22)
    1403              $C$DW$T$23      .dwtag  DW_TAG_const_type
    1404                      .dwattr $C$DW$T$23, DW_AT_type(*$C$DW$208)
    1405              
    1406              $C$DW$T$19      .dwtag  DW_TAG_subroutine_type
    1407                      .dwattr $C$DW$T$19, DW_AT_language(DW_LANG_C)
    1408              $C$DW$T$20      .dwtag  DW_TAG_pointer_type
    1409                      .dwattr $C$DW$T$20, DW_AT_type(*$C$DW$T$19)
    1410                      .dwattr $C$DW$T$20, DW_AT_address_class(0x16)
    1411              $C$DW$T$21      .dwtag  DW_TAG_typedef, DW_AT_name("PINT")
    1412                      .dwattr $C$DW$T$21, DW_AT_type(*$C$DW$T$20)
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:25 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0574810                           PAGE   29

    1413                      .dwattr $C$DW$T$21, DW_AT_language(DW_LANG_C)
    1414              $C$DW$T$4       .dwtag  DW_TAG_base_type
    1415                      .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    1416                      .dwattr $C$DW$T$4, DW_AT_name("bool")
    1417                      .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    1418              $C$DW$T$5       .dwtag  DW_TAG_base_type
    1419                      .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    1420                      .dwattr $C$DW$T$5, DW_AT_name("signed char")
    1421                      .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    1422              $C$DW$T$6       .dwtag  DW_TAG_base_type
    1423                      .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    1424                      .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    1425                      .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
    1426              $C$DW$T$7       .dwtag  DW_TAG_base_type
    1427                      .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
    1428                      .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
    1429                      .dwattr $C$DW$T$7, DW_AT_byte_size(0x01)
    1430              $C$DW$T$8       .dwtag  DW_TAG_base_type
    1431                      .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
    1432                      .dwattr $C$DW$T$8, DW_AT_name("short")
    1433                      .dwattr $C$DW$T$8, DW_AT_byte_size(0x01)
    1434              $C$DW$T$9       .dwtag  DW_TAG_base_type
    1435                      .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
    1436                      .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
    1437                      .dwattr $C$DW$T$9, DW_AT_byte_size(0x01)
    1438              $C$DW$T$10      .dwtag  DW_TAG_base_type
    1439                      .dwattr $C$DW$T$10, DW_AT_encoding(DW_ATE_signed)
    1440                      .dwattr $C$DW$T$10, DW_AT_name("int")
    1441                      .dwattr $C$DW$T$10, DW_AT_byte_size(0x01)
    1442              $C$DW$T$11      .dwtag  DW_TAG_base_type
    1443                      .dwattr $C$DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
    1444                      .dwattr $C$DW$T$11, DW_AT_name("unsigned int")
    1445                      .dwattr $C$DW$T$11, DW_AT_byte_size(0x01)
    1446              $C$DW$T$12      .dwtag  DW_TAG_base_type
    1447                      .dwattr $C$DW$T$12, DW_AT_encoding(DW_ATE_signed)
    1448                      .dwattr $C$DW$T$12, DW_AT_name("long")
    1449                      .dwattr $C$DW$T$12, DW_AT_byte_size(0x02)
    1450              $C$DW$T$13      .dwtag  DW_TAG_base_type
