TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:02 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0436810                           PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v6.2.7 *
       3              ;* Date/Time created: Thu Jul 02 08:31:02 2015                 *
       4              ;***************************************************************
       5                      .compiler_opts --diag_wrap=off --float_support=fpu32 --hll_source=on --mem_model:code=flat --mem_mode
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("../core/initSys.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v6.2.7 Copyright (c) 1996-2014 Texas I
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("D:\ActiveProject\EKT5\PKMT_NONBIOS\InvertorCntrl\ISPprg")
      13              
      14              $C$DW$1 .dwtag  DW_TAG_subprogram, DW_AT_name("usDelay")
      15                      .dwattr $C$DW$1, DW_AT_TI_symbol_name("_usDelay")
      16                      .dwattr $C$DW$1, DW_AT_declaration

     438              ;* FNAME: _InitFlash                    FR SIZE:   0           *
     439              ;*                                                             *
     440              ;* FUNCTION ENVIRONMENT                                        *
     441              ;*                                                             *
     442              ;* FUNCTION PROPERTIES                                         *
     443              ;*                            0 Parameter,  0 Auto,  0 SOE     *
     444              ;***************************************************************
     445              
     446 00000000       _InitFlash:
     447                      .dwcfi  cfa_offset, -2
     448                      .dwcfi  save_reg_to_mem, 26, 0
     449                      .dwcfi  save_reg_to_reg, 78, 26
     450                      .dwpsn  file "../core/initSys.c",line 187,column 2,is_stmt
     451 00000000 7622   EALLOW
     452                      .dwpsn  file "../core/initSys.c",line 188,column 2,is_stmt
     453 00000001 761F!         MOVW      DP,#_FlashRegs        ; [CPU_U] 
         00000002 0000 
     454 00000003 1A00!         OR        @_FlashRegs,#0x0001   ; [CPU_] |188| 
         00000004 0001 
     455                      .dwpsn  file "../core/initSys.c",line 189,column 2,is_stmt
     456 00000005 1A02!         OR        @_FlashRegs+2,#0x0003 ; [CPU_] |189| 
         00000006 0003 
     457                      .dwpsn  file "../core/initSys.c",line 190,column 2,is_stmt
     458 00000007 1A03!         OR        @_FlashRegs+3,#0x0100 ; [CPU_] |190| 
         00000008 0100 
     459                      .dwpsn  file "../core/initSys.c",line 191,column 2,is_stmt
     460 00000009 1A04!         OR        @_FlashRegs+4,#0x01ff ; [CPU_] |191| 
         0000000a 01FF 
     461                      .dwpsn  file "../core/initSys.c",line 192,column 2,is_stmt
     462 0000000b 1A05!         OR        @_FlashRegs+5,#0x01ff ; [CPU_] |192| 
         0000000c 01FF 
     463                      .dwpsn  file "../core/initSys.c",line 195,column 2,is_stmt
     464 0000000d CC06!         AND       AL,@_FlashRegs+6,#0xfff0 ; [CPU_] |195| 
         0000000e FFF0 
     465 0000000f 5003          ORB       AL,#0x03              ; [CPU_] |195| 
     466 00000010 9606!         MOV       @_FlashRegs+6,AL      ; [CPU_] |195| 
     467                      .dwpsn  file "../core/initSys.c",line 196,column 2,is_stmt
     468 00000011 CC06!         AND       AL,@_FlashRegs+6,#0xf0ff ; [CPU_] |196| 
         00000012 F0FF 
     469 00000013 1AA9          OR        AL,#0x0300            ; [CPU_] |196| 
         00000014 0300 
     470 00000015 9606!         MOV       @_FlashRegs+6,AL      ; [CPU_] |196| 
     471                      .dwpsn  file "../core/initSys.c",line 197,column 2,is_stmt
     472 00000016 CC07!         AND       AL,@_FlashRegs+7,#0xffe0 ; [CPU_] |197| 
         00000017 FFE0 
     473 00000018 5005          ORB       AL,#0x05              ; [CPU_] |197| 
     474 00000019 9607!         MOV       @_FlashRegs+7,AL      ; [CPU_] |197| 
     475                      .dwpsn  file "../core/initSys.c",line 205,column 2,is_stmt
     476 0000001a 761A   EDIS
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:02 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0436810                           PAGE   11

     477                      .dwpsn  file "../core/initSys.c",line 210,column 5,is_stmt
     478 0000001b F606   RPT #6 || NOP
         0000001c 7700 
     479                      .dwpsn  file "../core/initSys.c",line 212,column 1,is_stmt
     480 0000001d FF69          SPM       #0                    ; [CPU_] 
     481              $C$DW$23        .dwtag  DW_TAG_TI_branch
     482                      .dwattr $C$DW$23, DW_AT_low_pc(0x00)
     483                      .dwattr $C$DW$23, DW_AT_TI_return
     484 0000001e 0006          LRETR     ; [CPU_] 
     485                      ; return occurs ; [] 
     486                      .dwattr $C$DW$22, DW_AT_TI_end_file("../core/initSys.c")
     487                      .dwattr $C$DW$22, DW_AT_TI_end_line(0xd4)
     488                      .dwattr $C$DW$22, DW_AT_TI_end_column(0x01)
     489                      .dwendentry
     490                      .dwendtag $C$DW$22
     491              
     492              ;**************************************************************
     493              ;* UNDEFINED EXTERNAL REFERENCES                              *
     494              ;**************************************************************
     495                      .global _usDelay
     496                      .global _FlashRegs
     497                      .global _PieCtrlRegs
     498                      .global _SysCtrlRegs
     499                      .global _DevEmuRegs
     500                      .global _PieVectTableInit
     501                      .global _PieVectTable
     502                      .global ___memcpy_ff
     503              
     504              ;***************************************************************
     505              ;* TYPE INFORMATION                                            *
     506              ;***************************************************************
     507              
     508              $C$DW$T$20      .dwtag  DW_TAG_structure_type
     509                      .dwattr $C$DW$T$20, DW_AT_name("CLASSID_BITS")
     510                      .dwattr $C$DW$T$20, DW_AT_byte_size(0x01)
     511              $C$DW$24        .dwtag  DW_TAG_member
     512                      .dwattr $C$DW$24, DW_AT_type(*$C$DW$T$19)
     513                      .dwattr $C$DW$24, DW_AT_name("CLASSNO")
     514                      .dwattr $C$DW$24, DW_AT_TI_symbol_name("_CLASSNO")
     515                      .dwattr $C$DW$24, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x08)
     516                      .dwattr $C$DW$24, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     517                      .dwattr $C$DW$24, DW_AT_accessibility(DW_ACCESS_public)
     518              $C$DW$25        .dwtag  DW_TAG_member
     519                      .dwattr $C$DW$25, DW_AT_type(*$C$DW$T$19)
     520                      .dwattr $C$DW$25, DW_AT_name("PARTTYPE")
     521                      .dwattr $C$DW$25, DW_AT_TI_symbol_name("_PARTTYPE")
     522                      .dwattr $C$DW$25, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x08)
     523                      .dwattr $C$DW$25, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     524                      .dwattr $C$DW$25, DW_AT_accessibility(DW_ACCESS_public)
     525                      .dwendtag $C$DW$T$20
     526              
     527              
     528              $C$DW$T$21      .dwtag  DW_TAG_union_type
     529                      .dwattr $C$DW$T$21, DW_AT_name("CLASSID_REG")
     530                      .dwattr $C$DW$T$21, DW_AT_byte_size(0x01)
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:02 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0436810                           PAGE   12

     531              $C$DW$26        .dwtag  DW_TAG_member
     532                      .dwattr $C$DW$26, DW_AT_type(*$C$DW$T$19)
     533                      .dwattr $C$DW$26, DW_AT_name("all")
     534                      .dwattr $C$DW$26, DW_AT_TI_symbol_name("_all")
     535                      .dwattr $C$DW$26, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     536                      .dwattr $C$DW$26, DW_AT_accessibility(DW_ACCESS_public)
     537              $C$DW$27        .dwtag  DW_TAG_member
     538                      .dwattr $C$DW$27, DW_AT_type(*$C$DW$T$20)
     539                      .dwattr $C$DW$27, DW_AT_name("bit")
     540                      .dwattr $C$DW$27, DW_AT_TI_symbol_name("_bit")
     541                      .dwattr $C$DW$27, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     542                      .dwattr $C$DW$27, DW_AT_accessibility(DW_ACCESS_public)
     543                      .dwendtag $C$DW$T$21
     544              
     545              
     546              $C$DW$T$22      .dwtag  DW_TAG_structure_type
     547                      .dwattr $C$DW$T$22, DW_AT_name("DEVICECNF_BITS")
     548                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x02)
     549              $C$DW$28        .dwtag  DW_TAG_member
     550                      .dwattr $C$DW$28, DW_AT_type(*$C$DW$T$19)
     551                      .dwattr $C$DW$28, DW_AT_name("rsvd1")
     552                      .dwattr $C$DW$28, DW_AT_TI_symbol_name("_rsvd1")
     553                      .dwattr $C$DW$28, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x03)
     554                      .dwattr $C$DW$28, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     555                      .dwattr $C$DW$28, DW_AT_accessibility(DW_ACCESS_public)
     556              $C$DW$29        .dwtag  DW_TAG_member
     557                      .dwattr $C$DW$29, DW_AT_type(*$C$DW$T$19)
     558                      .dwattr $C$DW$29, DW_AT_name("VMAPS")
     559                      .dwattr $C$DW$29, DW_AT_TI_symbol_name("_VMAPS")
     560                      .dwattr $C$DW$29, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
     561                      .dwattr $C$DW$29, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     562                      .dwattr $C$DW$29, DW_AT_accessibility(DW_ACCESS_public)
     563              $C$DW$30        .dwtag  DW_TAG_member
     564                      .dwattr $C$DW$30, DW_AT_type(*$C$DW$T$19)
     565                      .dwattr $C$DW$30, DW_AT_name("rsvd2")
     566                      .dwattr $C$DW$30, DW_AT_TI_symbol_name("_rsvd2")
     567                      .dwattr $C$DW$30, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
     568                      .dwattr $C$DW$30, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     569                      .dwattr $C$DW$30, DW_AT_accessibility(DW_ACCESS_public)
     570              $C$DW$31        .dwtag  DW_TAG_member
     571                      .dwattr $C$DW$31, DW_AT_type(*$C$DW$T$19)
     572                      .dwattr $C$DW$31, DW_AT_name("XRSn")
     573                      .dwattr $C$DW$31, DW_AT_TI_symbol_name("_XRSn")
     574                      .dwattr $C$DW$31, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
     575                      .dwattr $C$DW$31, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     576                      .dwattr $C$DW$31, DW_AT_accessibility(DW_ACCESS_public)
     577              $C$DW$32        .dwtag  DW_TAG_member
     578                      .dwattr $C$DW$32, DW_AT_type(*$C$DW$T$19)
     579                      .dwattr $C$DW$32, DW_AT_name("rsvd3")
     580                      .dwattr $C$DW$32, DW_AT_TI_symbol_name("_rsvd3")
     581                      .dwattr $C$DW$32, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0a)
     582                      .dwattr $C$DW$32, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     583                      .dwattr $C$DW$32, DW_AT_accessibility(DW_ACCESS_public)
     584              $C$DW$33        .dwtag  DW_TAG_member
     585                      .dwattr $C$DW$33, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:02 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0436810                           PAGE   13

     586                      .dwattr $C$DW$33, DW_AT_name("rsvd4")
     587                      .dwattr $C$DW$33, DW_AT_TI_symbol_name("_rsvd4")
     588                      .dwattr $C$DW$33, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x03)
     589                      .dwattr $C$DW$33, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     590                      .dwattr $C$DW$33, DW_AT_accessibility(DW_ACCESS_public)
     591              $C$DW$34        .dwtag  DW_TAG_member
     592                      .dwattr $C$DW$34, DW_AT_type(*$C$DW$T$19)
     593                      .dwattr $C$DW$34, DW_AT_name("ENPROT")
     594                      .dwattr $C$DW$34, DW_AT_TI_symbol_name("_ENPROT")
     595                      .dwattr $C$DW$34, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
     596                      .dwattr $C$DW$34, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     597                      .dwattr $C$DW$34, DW_AT_accessibility(DW_ACCESS_public)
     598              $C$DW$35        .dwtag  DW_TAG_member
     599                      .dwattr $C$DW$35, DW_AT_type(*$C$DW$T$19)
     600                      .dwattr $C$DW$35, DW_AT_name("rsvd5")
     601                      .dwattr $C$DW$35, DW_AT_TI_symbol_name("_rsvd5")
     602                      .dwattr $C$DW$35, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x07)
     603                      .dwattr $C$DW$35, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     604                      .dwattr $C$DW$35, DW_AT_accessibility(DW_ACCESS_public)
     605              $C$DW$36        .dwtag  DW_TAG_member
     606                      .dwattr $C$DW$36, DW_AT_type(*$C$DW$T$19)
     607                      .dwattr $C$DW$36, DW_AT_name("TRSTN")
     608                      .dwattr $C$DW$36, DW_AT_TI_symbol_name("_TRSTN")
     609                      .dwattr $C$DW$36, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
     610                      .dwattr $C$DW$36, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     611                      .dwattr $C$DW$36, DW_AT_accessibility(DW_ACCESS_public)
     612              $C$DW$37        .dwtag  DW_TAG_member
     613                      .dwattr $C$DW$37, DW_AT_type(*$C$DW$T$19)
     614                      .dwattr $C$DW$37, DW_AT_name("rsvd6")
     615                      .dwattr $C$DW$37, DW_AT_TI_symbol_name("_rsvd6")
     616                      .dwattr $C$DW$37, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x04)
     617                      .dwattr $C$DW$37, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     618                      .dwattr $C$DW$37, DW_AT_accessibility(DW_ACCESS_public)
     619                      .dwendtag $C$DW$T$22
     620              
     621              
     622              $C$DW$T$24      .dwtag  DW_TAG_union_type
     623                      .dwattr $C$DW$T$24, DW_AT_name("DEVICECNF_REG")
     624                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x02)
     625              $C$DW$38        .dwtag  DW_TAG_member
     626                      .dwattr $C$DW$38, DW_AT_type(*$C$DW$T$23)
     627                      .dwattr $C$DW$38, DW_AT_name("all")
     628                      .dwattr $C$DW$38, DW_AT_TI_symbol_name("_all")
     629                      .dwattr $C$DW$38, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     630                      .dwattr $C$DW$38, DW_AT_accessibility(DW_ACCESS_public)
     631              $C$DW$39        .dwtag  DW_TAG_member
     632                      .dwattr $C$DW$39, DW_AT_type(*$C$DW$T$22)
     633                      .dwattr $C$DW$39, DW_AT_name("bit")
     634                      .dwattr $C$DW$39, DW_AT_TI_symbol_name("_bit")
     635                      .dwattr $C$DW$39, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     636                      .dwattr $C$DW$39, DW_AT_accessibility(DW_ACCESS_public)
     637                      .dwendtag $C$DW$T$24
     638              
     639              
     640              $C$DW$T$26      .dwtag  DW_TAG_structure_type
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:02 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0436810                           PAGE   14

     641                      .dwattr $C$DW$T$26, DW_AT_name("DEV_EMU_REGS")
     642                      .dwattr $C$DW$T$26, DW_AT_byte_size(0xd0)
     643              $C$DW$40        .dwtag  DW_TAG_member
     644                      .dwattr $C$DW$40, DW_AT_type(*$C$DW$T$24)
     645                      .dwattr $C$DW$40, DW_AT_name("DEVICECNF")
     646                      .dwattr $C$DW$40, DW_AT_TI_symbol_name("_DEVICECNF")
     647                      .dwattr $C$DW$40, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     648                      .dwattr $C$DW$40, DW_AT_accessibility(DW_ACCESS_public)
     649              $C$DW$41        .dwtag  DW_TAG_member
     650                      .dwattr $C$DW$41, DW_AT_type(*$C$DW$T$21)
     651                      .dwattr $C$DW$41, DW_AT_name("CLASSID")
     652                      .dwattr $C$DW$41, DW_AT_TI_symbol_name("_CLASSID")
     653                      .dwattr $C$DW$41, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     654                      .dwattr $C$DW$41, DW_AT_accessibility(DW_ACCESS_public)
     655              $C$DW$42        .dwtag  DW_TAG_member
     656                      .dwattr $C$DW$42, DW_AT_type(*$C$DW$T$19)
     657                      .dwattr $C$DW$42, DW_AT_name("REVID")
     658                      .dwattr $C$DW$42, DW_AT_TI_symbol_name("_REVID")
     659                      .dwattr $C$DW$42, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
     660                      .dwattr $C$DW$42, DW_AT_accessibility(DW_ACCESS_public)
     661              $C$DW$43        .dwtag  DW_TAG_member
     662                      .dwattr $C$DW$43, DW_AT_type(*$C$DW$T$19)
     663                      .dwattr $C$DW$43, DW_AT_name("PROTSTART")
     664                      .dwattr $C$DW$43, DW_AT_TI_symbol_name("_PROTSTART")
     665                      .dwattr $C$DW$43, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     666                      .dwattr $C$DW$43, DW_AT_accessibility(DW_ACCESS_public)
     667              $C$DW$44        .dwtag  DW_TAG_member
     668                      .dwattr $C$DW$44, DW_AT_type(*$C$DW$T$19)
     669                      .dwattr $C$DW$44, DW_AT_name("PROTRANGE")
     670                      .dwattr $C$DW$44, DW_AT_TI_symbol_name("_PROTRANGE")
     671                      .dwattr $C$DW$44, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
     672                      .dwattr $C$DW$44, DW_AT_accessibility(DW_ACCESS_public)
     673              $C$DW$45        .dwtag  DW_TAG_member
     674                      .dwattr $C$DW$45, DW_AT_type(*$C$DW$T$25)
     675                      .dwattr $C$DW$45, DW_AT_name("rsvd2")
     676                      .dwattr $C$DW$45, DW_AT_TI_symbol_name("_rsvd2")
     677                      .dwattr $C$DW$45, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     678                      .dwattr $C$DW$45, DW_AT_accessibility(DW_ACCESS_public)
     679                      .dwendtag $C$DW$T$26
     680              
     681              $C$DW$46        .dwtag  DW_TAG_TI_far_type
     682                      .dwattr $C$DW$46, DW_AT_type(*$C$DW$T$26)
     683              $C$DW$T$78      .dwtag  DW_TAG_volatile_type
     684                      .dwattr $C$DW$T$78, DW_AT_type(*$C$DW$46)
     685              
     686              $C$DW$T$27      .dwtag  DW_TAG_structure_type
     687                      .dwattr $C$DW$T$27, DW_AT_name("FACTIVEWAIT_BITS")
     688                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x01)
     689              $C$DW$47        .dwtag  DW_TAG_member
     690                      .dwattr $C$DW$47, DW_AT_type(*$C$DW$T$19)
     691                      .dwattr $C$DW$47, DW_AT_name("ACTIVEWAIT")
     692                      .dwattr $C$DW$47, DW_AT_TI_symbol_name("_ACTIVEWAIT")
     693                      .dwattr $C$DW$47, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x09)
     694                      .dwattr $C$DW$47, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     695                      .dwattr $C$DW$47, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:02 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0436810                           PAGE   15

     696              $C$DW$48        .dwtag  DW_TAG_member
     697                      .dwattr $C$DW$48, DW_AT_type(*$C$DW$T$19)
     698                      .dwattr $C$DW$48, DW_AT_name("rsvd")
     699                      .dwattr $C$DW$48, DW_AT_TI_symbol_name("_rsvd")
     700                      .dwattr $C$DW$48, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x07)
     701                      .dwattr $C$DW$48, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     702                      .dwattr $C$DW$48, DW_AT_accessibility(DW_ACCESS_public)
     703                      .dwendtag $C$DW$T$27
     704              
     705              
     706              $C$DW$T$28      .dwtag  DW_TAG_union_type
     707                      .dwattr $C$DW$T$28, DW_AT_name("FACTIVEWAIT_REG")
     708                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x01)
     709              $C$DW$49        .dwtag  DW_TAG_member
     710                      .dwattr $C$DW$49, DW_AT_type(*$C$DW$T$19)
     711                      .dwattr $C$DW$49, DW_AT_name("all")
     712                      .dwattr $C$DW$49, DW_AT_TI_symbol_name("_all")
     713                      .dwattr $C$DW$49, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     714                      .dwattr $C$DW$49, DW_AT_accessibility(DW_ACCESS_public)
     715              $C$DW$50        .dwtag  DW_TAG_member
     716                      .dwattr $C$DW$50, DW_AT_type(*$C$DW$T$27)
     717                      .dwattr $C$DW$50, DW_AT_name("bit")
     718                      .dwattr $C$DW$50, DW_AT_TI_symbol_name("_bit")
     719                      .dwattr $C$DW$50, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     720                      .dwattr $C$DW$50, DW_AT_accessibility(DW_ACCESS_public)
     721                      .dwendtag $C$DW$T$28
     722              
     723              
     724              $C$DW$T$29      .dwtag  DW_TAG_structure_type
     725                      .dwattr $C$DW$T$29, DW_AT_name("FBANKWAIT_BITS")
     726                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x01)
     727              $C$DW$51        .dwtag  DW_TAG_member
     728                      .dwattr $C$DW$51, DW_AT_type(*$C$DW$T$19)
     729                      .dwattr $C$DW$51, DW_AT_name("RANDWAIT")
     730                      .dwattr $C$DW$51, DW_AT_TI_symbol_name("_RANDWAIT")
     731                      .dwattr $C$DW$51, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x04)
     732                      .dwattr $C$DW$51, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     733                      .dwattr $C$DW$51, DW_AT_accessibility(DW_ACCESS_public)
     734              $C$DW$52        .dwtag  DW_TAG_member
     735                      .dwattr $C$DW$52, DW_AT_type(*$C$DW$T$19)
     736                      .dwattr $C$DW$52, DW_AT_name("rsvd1")
     737                      .dwattr $C$DW$52, DW_AT_TI_symbol_name("_rsvd1")
     738                      .dwattr $C$DW$52, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x04)
     739                      .dwattr $C$DW$52, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     740                      .dwattr $C$DW$52, DW_AT_accessibility(DW_ACCESS_public)
     741              $C$DW$53        .dwtag  DW_TAG_member
     742                      .dwattr $C$DW$53, DW_AT_type(*$C$DW$T$19)
     743                      .dwattr $C$DW$53, DW_AT_name("PAGEWAIT")
     744                      .dwattr $C$DW$53, DW_AT_TI_symbol_name("_PAGEWAIT")
     745                      .dwattr $C$DW$53, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x04)
     746                      .dwattr $C$DW$53, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     747                      .dwattr $C$DW$53, DW_AT_accessibility(DW_ACCESS_public)
     748              $C$DW$54        .dwtag  DW_TAG_member
     749                      .dwattr $C$DW$54, DW_AT_type(*$C$DW$T$19)
     750                      .dwattr $C$DW$54, DW_AT_name("rsvd2")
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:02 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0436810                           PAGE   16

     751                      .dwattr $C$DW$54, DW_AT_TI_symbol_name("_rsvd2")
     752                      .dwattr $C$DW$54, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x04)
     753                      .dwattr $C$DW$54, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     754                      .dwattr $C$DW$54, DW_AT_accessibility(DW_ACCESS_public)
     755                      .dwendtag $C$DW$T$29
     756              
     757              
     758              $C$DW$T$30      .dwtag  DW_TAG_union_type
     759                      .dwattr $C$DW$T$30, DW_AT_name("FBANKWAIT_REG")
     760                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x01)
     761              $C$DW$55        .dwtag  DW_TAG_member
     762                      .dwattr $C$DW$55, DW_AT_type(*$C$DW$T$19)
     763                      .dwattr $C$DW$55, DW_AT_name("all")
     764                      .dwattr $C$DW$55, DW_AT_TI_symbol_name("_all")
     765                      .dwattr $C$DW$55, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     766                      .dwattr $C$DW$55, DW_AT_accessibility(DW_ACCESS_public)
     767              $C$DW$56        .dwtag  DW_TAG_member
     768                      .dwattr $C$DW$56, DW_AT_type(*$C$DW$T$29)
     769                      .dwattr $C$DW$56, DW_AT_name("bit")
     770                      .dwattr $C$DW$56, DW_AT_TI_symbol_name("_bit")
     771                      .dwattr $C$DW$56, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     772                      .dwattr $C$DW$56, DW_AT_accessibility(DW_ACCESS_public)
     773                      .dwendtag $C$DW$T$30
     774              
     775              
     776              $C$DW$T$31      .dwtag  DW_TAG_structure_type
     777                      .dwattr $C$DW$T$31, DW_AT_name("FLASH_REGS")
     778                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x08)
     779              $C$DW$57        .dwtag  DW_TAG_member
     780                      .dwattr $C$DW$57, DW_AT_type(*$C$DW$T$33)
     781                      .dwattr $C$DW$57, DW_AT_name("FOPT")
     782                      .dwattr $C$DW$57, DW_AT_TI_symbol_name("_FOPT")
     783                      .dwattr $C$DW$57, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     784                      .dwattr $C$DW$57, DW_AT_accessibility(DW_ACCESS_public)
     785              $C$DW$58        .dwtag  DW_TAG_member
     786                      .dwattr $C$DW$58, DW_AT_type(*$C$DW$T$19)
     787                      .dwattr $C$DW$58, DW_AT_name("rsvd1")
     788                      .dwattr $C$DW$58, DW_AT_TI_symbol_name("_rsvd1")
     789                      .dwattr $C$DW$58, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     790                      .dwattr $C$DW$58, DW_AT_accessibility(DW_ACCESS_public)
     791              $C$DW$59        .dwtag  DW_TAG_member
     792                      .dwattr $C$DW$59, DW_AT_type(*$C$DW$T$37)
     793                      .dwattr $C$DW$59, DW_AT_name("FPWR")
     794                      .dwattr $C$DW$59, DW_AT_TI_symbol_name("_FPWR")
     795                      .dwattr $C$DW$59, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     796                      .dwattr $C$DW$59, DW_AT_accessibility(DW_ACCESS_public)
     797              $C$DW$60        .dwtag  DW_TAG_member
     798                      .dwattr $C$DW$60, DW_AT_type(*$C$DW$T$39)
     799                      .dwattr $C$DW$60, DW_AT_name("FSTATUS")
     800                      .dwattr $C$DW$60, DW_AT_TI_symbol_name("_FSTATUS")
     801                      .dwattr $C$DW$60, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
     802                      .dwattr $C$DW$60, DW_AT_accessibility(DW_ACCESS_public)
     803              $C$DW$61        .dwtag  DW_TAG_member
     804                      .dwattr $C$DW$61, DW_AT_type(*$C$DW$T$41)
     805                      .dwattr $C$DW$61, DW_AT_name("FSTDBYWAIT")
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:02 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0436810                           PAGE   17

     806                      .dwattr $C$DW$61, DW_AT_TI_symbol_name("_FSTDBYWAIT")
     807                      .dwattr $C$DW$61, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     808                      .dwattr $C$DW$61, DW_AT_accessibility(DW_ACCESS_public)
     809              $C$DW$62        .dwtag  DW_TAG_member
     810                      .dwattr $C$DW$62, DW_AT_type(*$C$DW$T$28)
     811                      .dwattr $C$DW$62, DW_AT_name("FACTIVEWAIT")
     812                      .dwattr $C$DW$62, DW_AT_TI_symbol_name("_FACTIVEWAIT")
     813                      .dwattr $C$DW$62, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
     814                      .dwattr $C$DW$62, DW_AT_accessibility(DW_ACCESS_public)
     815              $C$DW$63        .dwtag  DW_TAG_member
     816                      .dwattr $C$DW$63, DW_AT_type(*$C$DW$T$30)
     817                      .dwattr $C$DW$63, DW_AT_name("FBANKWAIT")
     818                      .dwattr $C$DW$63, DW_AT_TI_symbol_name("_FBANKWAIT")
     819                      .dwattr $C$DW$63, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     820                      .dwattr $C$DW$63, DW_AT_accessibility(DW_ACCESS_public)
     821              $C$DW$64        .dwtag  DW_TAG_member
     822                      .dwattr $C$DW$64, DW_AT_type(*$C$DW$T$35)
     823                      .dwattr $C$DW$64, DW_AT_name("FOTPWAIT")
     824                      .dwattr $C$DW$64, DW_AT_TI_symbol_name("_FOTPWAIT")
     825                      .dwattr $C$DW$64, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
     826                      .dwattr $C$DW$64, DW_AT_accessibility(DW_ACCESS_public)
     827                      .dwendtag $C$DW$T$31
     828              
     829              $C$DW$65        .dwtag  DW_TAG_TI_far_type
     830                      .dwattr $C$DW$65, DW_AT_type(*$C$DW$T$31)
     831              $C$DW$T$83      .dwtag  DW_TAG_volatile_type
     832                      .dwattr $C$DW$T$83, DW_AT_type(*$C$DW$65)
     833              
     834              $C$DW$T$32      .dwtag  DW_TAG_structure_type
     835                      .dwattr $C$DW$T$32, DW_AT_name("FOPT_BITS")
     836                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x01)
     837              $C$DW$66        .dwtag  DW_TAG_member
     838                      .dwattr $C$DW$66, DW_AT_type(*$C$DW$T$19)
     839                      .dwattr $C$DW$66, DW_AT_name("ENPIPE")
     840                      .dwattr $C$DW$66, DW_AT_TI_symbol_name("_ENPIPE")
     841                      .dwattr $C$DW$66, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
     842                      .dwattr $C$DW$66, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     843                      .dwattr $C$DW$66, DW_AT_accessibility(DW_ACCESS_public)
     844              $C$DW$67        .dwtag  DW_TAG_member
     845                      .dwattr $C$DW$67, DW_AT_type(*$C$DW$T$19)
     846                      .dwattr $C$DW$67, DW_AT_name("rsvd")
     847                      .dwattr $C$DW$67, DW_AT_TI_symbol_name("_rsvd")
     848                      .dwattr $C$DW$67, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0f)
     849                      .dwattr $C$DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     850                      .dwattr $C$DW$67, DW_AT_accessibility(DW_ACCESS_public)
     851                      .dwendtag $C$DW$T$32
     852              
     853              
     854              $C$DW$T$33      .dwtag  DW_TAG_union_type
     855                      .dwattr $C$DW$T$33, DW_AT_name("FOPT_REG")
     856                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x01)
     857              $C$DW$68        .dwtag  DW_TAG_member
     858                      .dwattr $C$DW$68, DW_AT_type(*$C$DW$T$19)
     859                      .dwattr $C$DW$68, DW_AT_name("all")
     860                      .dwattr $C$DW$68, DW_AT_TI_symbol_name("_all")
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:02 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0436810                           PAGE   18

     861                      .dwattr $C$DW$68, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     862                      .dwattr $C$DW$68, DW_AT_accessibility(DW_ACCESS_public)
     863              $C$DW$69        .dwtag  DW_TAG_member
     864                      .dwattr $C$DW$69, DW_AT_type(*$C$DW$T$32)
     865                      .dwattr $C$DW$69, DW_AT_name("bit")
     866                      .dwattr $C$DW$69, DW_AT_TI_symbol_name("_bit")
     867                      .dwattr $C$DW$69, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     868                      .dwattr $C$DW$69, DW_AT_accessibility(DW_ACCESS_public)
     869                      .dwendtag $C$DW$T$33
     870              
     871              
     872              $C$DW$T$34      .dwtag  DW_TAG_structure_type
     873                      .dwattr $C$DW$T$34, DW_AT_name("FOTPWAIT_BITS")
     874                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x01)
     875              $C$DW$70        .dwtag  DW_TAG_member
     876                      .dwattr $C$DW$70, DW_AT_type(*$C$DW$T$19)
     877                      .dwattr $C$DW$70, DW_AT_name("OTPWAIT")
     878                      .dwattr $C$DW$70, DW_AT_TI_symbol_name("_OTPWAIT")
     879                      .dwattr $C$DW$70, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x05)
     880                      .dwattr $C$DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     881                      .dwattr $C$DW$70, DW_AT_accessibility(DW_ACCESS_public)
     882              $C$DW$71        .dwtag  DW_TAG_member
     883                      .dwattr $C$DW$71, DW_AT_type(*$C$DW$T$19)
     884                      .dwattr $C$DW$71, DW_AT_name("rsvd")
     885                      .dwattr $C$DW$71, DW_AT_TI_symbol_name("_rsvd")
     886                      .dwattr $C$DW$71, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0b)
     887                      .dwattr $C$DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     888                      .dwattr $C$DW$71, DW_AT_accessibility(DW_ACCESS_public)
     889                      .dwendtag $C$DW$T$34
     890              
     891              
     892              $C$DW$T$35      .dwtag  DW_TAG_union_type
     893                      .dwattr $C$DW$T$35, DW_AT_name("FOTPWAIT_REG")
     894                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x01)
     895              $C$DW$72        .dwtag  DW_TAG_member
     896                      .dwattr $C$DW$72, DW_AT_type(*$C$DW$T$19)
     897                      .dwattr $C$DW$72, DW_AT_name("all")
     898                      .dwattr $C$DW$72, DW_AT_TI_symbol_name("_all")
     899                      .dwattr $C$DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     900                      .dwattr $C$DW$72, DW_AT_accessibility(DW_ACCESS_public)
     901              $C$DW$73        .dwtag  DW_TAG_member
     902                      .dwattr $C$DW$73, DW_AT_type(*$C$DW$T$34)
     903                      .dwattr $C$DW$73, DW_AT_name("bit")
     904                      .dwattr $C$DW$73, DW_AT_TI_symbol_name("_bit")
     905                      .dwattr $C$DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     906                      .dwattr $C$DW$73, DW_AT_accessibility(DW_ACCESS_public)
     907                      .dwendtag $C$DW$T$35
     908              
     909              
     910              $C$DW$T$36      .dwtag  DW_TAG_structure_type
     911                      .dwattr $C$DW$T$36, DW_AT_name("FPWR_BITS")
     912                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x01)
     913              $C$DW$74        .dwtag  DW_TAG_member
     914                      .dwattr $C$DW$74, DW_AT_type(*$C$DW$T$19)
     915                      .dwattr $C$DW$74, DW_AT_name("PWR")
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:02 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0436810                           PAGE   19

     916                      .dwattr $C$DW$74, DW_AT_TI_symbol_name("_PWR")
     917                      .dwattr $C$DW$74, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x02)
     918                      .dwattr $C$DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     919                      .dwattr $C$DW$74, DW_AT_accessibility(DW_ACCESS_public)
     920              $C$DW$75        .dwtag  DW_TAG_member
     921                      .dwattr $C$DW$75, DW_AT_type(*$C$DW$T$19)
     922                      .dwattr $C$DW$75, DW_AT_name("rsvd")
     923                      .dwattr $C$DW$75, DW_AT_TI_symbol_name("_rsvd")
     924                      .dwattr $C$DW$75, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0e)
     925                      .dwattr $C$DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     926                      .dwattr $C$DW$75, DW_AT_accessibility(DW_ACCESS_public)
     927                      .dwendtag $C$DW$T$36
     928              
     929              
     930              $C$DW$T$37      .dwtag  DW_TAG_union_type
     931                      .dwattr $C$DW$T$37, DW_AT_name("FPWR_REG")
     932                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x01)
     933              $C$DW$76        .dwtag  DW_TAG_member
     934                      .dwattr $C$DW$76, DW_AT_type(*$C$DW$T$19)
     935                      .dwattr $C$DW$76, DW_AT_name("all")
     936                      .dwattr $C$DW$76, DW_AT_TI_symbol_name("_all")
     937                      .dwattr $C$DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     938                      .dwattr $C$DW$76, DW_AT_accessibility(DW_ACCESS_public)
     939              $C$DW$77        .dwtag  DW_TAG_member
     940                      .dwattr $C$DW$77, DW_AT_type(*$C$DW$T$36)
     941                      .dwattr $C$DW$77, DW_AT_name("bit")
     942                      .dwattr $C$DW$77, DW_AT_TI_symbol_name("_bit")
     943                      .dwattr $C$DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     944                      .dwattr $C$DW$77, DW_AT_accessibility(DW_ACCESS_public)
     945                      .dwendtag $C$DW$T$37
     946              
     947              
     948              $C$DW$T$38      .dwtag  DW_TAG_structure_type
     949                      .dwattr $C$DW$T$38, DW_AT_name("FSTATUS_BITS")
     950                      .dwattr $C$DW$T$38, DW_AT_byte_size(0x01)
     951              $C$DW$78        .dwtag  DW_TAG_member
     952                      .dwattr $C$DW$78, DW_AT_type(*$C$DW$T$19)
     953                      .dwattr $C$DW$78, DW_AT_name("PWRS")
     954                      .dwattr $C$DW$78, DW_AT_TI_symbol_name("_PWRS")
     955                      .dwattr $C$DW$78, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x02)
     956                      .dwattr $C$DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     957                      .dwattr $C$DW$78, DW_AT_accessibility(DW_ACCESS_public)
     958              $C$DW$79        .dwtag  DW_TAG_member
     959                      .dwattr $C$DW$79, DW_AT_type(*$C$DW$T$19)
     960                      .dwattr $C$DW$79, DW_AT_name("STDBYWAITS")
     961                      .dwattr $C$DW$79, DW_AT_TI_symbol_name("_STDBYWAITS")
     962                      .dwattr $C$DW$79, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
     963                      .dwattr $C$DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     964                      .dwattr $C$DW$79, DW_AT_accessibility(DW_ACCESS_public)
     965              $C$DW$80        .dwtag  DW_TAG_member
     966                      .dwattr $C$DW$80, DW_AT_type(*$C$DW$T$19)
     967                      .dwattr $C$DW$80, DW_AT_name("ACTIVEWAITS")
     968                      .dwattr $C$DW$80, DW_AT_TI_symbol_name("_ACTIVEWAITS")
     969                      .dwattr $C$DW$80, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
     970                      .dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:02 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0436810                           PAGE   20

     971                      .dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
     972              $C$DW$81        .dwtag  DW_TAG_member
     973                      .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$19)
     974                      .dwattr $C$DW$81, DW_AT_name("rsvd1")
     975                      .dwattr $C$DW$81, DW_AT_TI_symbol_name("_rsvd1")
     976                      .dwattr $C$DW$81, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x04)
     977                      .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     978                      .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
     979              $C$DW$82        .dwtag  DW_TAG_member
     980                      .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$19)
     981                      .dwattr $C$DW$82, DW_AT_name("V3STAT")
     982                      .dwattr $C$DW$82, DW_AT_TI_symbol_name("_V3STAT")
     983                      .dwattr $C$DW$82, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
     984                      .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     985                      .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
     986              $C$DW$83        .dwtag  DW_TAG_member
     987                      .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$19)
     988                      .dwattr $C$DW$83, DW_AT_name("rsvd2")
     989                      .dwattr $C$DW$83, DW_AT_TI_symbol_name("_rsvd2")
     990                      .dwattr $C$DW$83, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x07)
     991                      .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     992                      .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
     993                      .dwendtag $C$DW$T$38
     994              
     995              
     996              $C$DW$T$39      .dwtag  DW_TAG_union_type
     997                      .dwattr $C$DW$T$39, DW_AT_name("FSTATUS_REG")
     998                      .dwattr $C$DW$T$39, DW_AT_byte_size(0x01)
     999              $C$DW$84        .dwtag  DW_TAG_member
    1000                      .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$19)
    1001                      .dwattr $C$DW$84, DW_AT_name("all")
    1002                      .dwattr $C$DW$84, DW_AT_TI_symbol_name("_all")
    1003                      .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1004                      .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
    1005              $C$DW$85        .dwtag  DW_TAG_member
    1006                      .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$38)
    1007                      .dwattr $C$DW$85, DW_AT_name("bit")
    1008                      .dwattr $C$DW$85, DW_AT_TI_symbol_name("_bit")
    1009                      .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1010                      .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
    1011                      .dwendtag $C$DW$T$39
    1012              
    1013              
    1014              $C$DW$T$40      .dwtag  DW_TAG_structure_type
    1015                      .dwattr $C$DW$T$40, DW_AT_name("FSTDBYWAIT_BITS")
    1016                      .dwattr $C$DW$T$40, DW_AT_byte_size(0x01)
    1017              $C$DW$86        .dwtag  DW_TAG_member
    1018                      .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$19)
    1019                      .dwattr $C$DW$86, DW_AT_name("STDBYWAIT")
    1020                      .dwattr $C$DW$86, DW_AT_TI_symbol_name("_STDBYWAIT")
    1021                      .dwattr $C$DW$86, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x09)
    1022                      .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1023                      .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
    1024              $C$DW$87        .dwtag  DW_TAG_member
    1025                      .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:02 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0436810                           PAGE   21

    1026                      .dwattr $C$DW$87, DW_AT_name("rsvd")
    1027                      .dwattr $C$DW$87, DW_AT_TI_symbol_name("_rsvd")
    1028                      .dwattr $C$DW$87, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x07)
    1029                      .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1030                      .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
    1031                      .dwendtag $C$DW$T$40
    1032              
    1033              
    1034              $C$DW$T$41      .dwtag  DW_TAG_union_type
    1035                      .dwattr $C$DW$T$41, DW_AT_name("FSTDBYWAIT_REG")
    1036                      .dwattr $C$DW$T$41, DW_AT_byte_size(0x01)
    1037              $C$DW$88        .dwtag  DW_TAG_member
    1038                      .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$19)
    1039                      .dwattr $C$DW$88, DW_AT_name("all")
    1040                      .dwattr $C$DW$88, DW_AT_TI_symbol_name("_all")
    1041                      .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1042                      .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
    1043              $C$DW$89        .dwtag  DW_TAG_member
    1044                      .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$40)
    1045                      .dwattr $C$DW$89, DW_AT_name("bit")
    1046                      .dwattr $C$DW$89, DW_AT_TI_symbol_name("_bit")
    1047                      .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1048                      .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
    1049                      .dwendtag $C$DW$T$41
    1050              
    1051              
    1052              $C$DW$T$42      .dwtag  DW_TAG_structure_type
    1053                      .dwattr $C$DW$T$42, DW_AT_name("HISPCP_BITS")
    1054                      .dwattr $C$DW$T$42, DW_AT_byte_size(0x01)
    1055              $C$DW$90        .dwtag  DW_TAG_member
    1056                      .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$19)
    1057                      .dwattr $C$DW$90, DW_AT_name("HSPCLK")
    1058                      .dwattr $C$DW$90, DW_AT_TI_symbol_name("_HSPCLK")
    1059                      .dwattr $C$DW$90, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x03)
    1060                      .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1061                      .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
    1062              $C$DW$91        .dwtag  DW_TAG_member
    1063                      .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$19)
    1064                      .dwattr $C$DW$91, DW_AT_name("rsvd1")
    1065                      .dwattr $C$DW$91, DW_AT_TI_symbol_name("_rsvd1")
    1066                      .dwattr $C$DW$91, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0d)
    1067                      .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1068                      .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
    1069                      .dwendtag $C$DW$T$42
    1070              
    1071              
    1072              $C$DW$T$43      .dwtag  DW_TAG_union_type
    1073                      .dwattr $C$DW$T$43, DW_AT_name("HISPCP_REG")
    1074                      .dwattr $C$DW$T$43, DW_AT_byte_size(0x01)
    1075              $C$DW$92        .dwtag  DW_TAG_member
    1076                      .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$19)
    1077                      .dwattr $C$DW$92, DW_AT_name("all")
    1078                      .dwattr $C$DW$92, DW_AT_TI_symbol_name("_all")
    1079                      .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1080                      .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:02 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0436810                           PAGE   22

    1081              $C$DW$93        .dwtag  DW_TAG_member
    1082                      .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$42)
    1083                      .dwattr $C$DW$93, DW_AT_name("bit")
    1084                      .dwattr $C$DW$93, DW_AT_TI_symbol_name("_bit")
    1085                      .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1086                      .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
    1087                      .dwendtag $C$DW$T$43
    1088              
    1089              
    1090              $C$DW$T$44      .dwtag  DW_TAG_structure_type
    1091                      .dwattr $C$DW$T$44, DW_AT_name("LOSPCP_BITS")
    1092                      .dwattr $C$DW$T$44, DW_AT_byte_size(0x01)
    1093              $C$DW$94        .dwtag  DW_TAG_member
    1094                      .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$19)
    1095                      .dwattr $C$DW$94, DW_AT_name("LSPCLK")
    1096                      .dwattr $C$DW$94, DW_AT_TI_symbol_name("_LSPCLK")
    1097                      .dwattr $C$DW$94, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x03)
    1098                      .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1099                      .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
    1100              $C$DW$95        .dwtag  DW_TAG_member
    1101                      .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$19)
    1102                      .dwattr $C$DW$95, DW_AT_name("rsvd1")
    1103                      .dwattr $C$DW$95, DW_AT_TI_symbol_name("_rsvd1")
    1104                      .dwattr $C$DW$95, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0d)
    1105                      .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1106                      .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
    1107                      .dwendtag $C$DW$T$44
    1108              
    1109              
    1110              $C$DW$T$45      .dwtag  DW_TAG_union_type
    1111                      .dwattr $C$DW$T$45, DW_AT_name("LOSPCP_REG")
    1112                      .dwattr $C$DW$T$45, DW_AT_byte_size(0x01)
    1113              $C$DW$96        .dwtag  DW_TAG_member
    1114                      .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$19)
    1115                      .dwattr $C$DW$96, DW_AT_name("all")
    1116                      .dwattr $C$DW$96, DW_AT_TI_symbol_name("_all")
    1117                      .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1118                      .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
    1119              $C$DW$97        .dwtag  DW_TAG_member
    1120                      .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$44)
    1121                      .dwattr $C$DW$97, DW_AT_name("bit")
    1122                      .dwattr $C$DW$97, DW_AT_TI_symbol_name("_bit")
    1123                      .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1124                      .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
    1125                      .dwendtag $C$DW$T$45
    1126              
    1127              
    1128              $C$DW$T$46      .dwtag  DW_TAG_structure_type
    1129                      .dwattr $C$DW$T$46, DW_AT_name("LPMCR0_BITS")
    1130                      .dwattr $C$DW$T$46, DW_AT_byte_size(0x01)
    1131              $C$DW$98        .dwtag  DW_TAG_member
    1132                      .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$19)
    1133                      .dwattr $C$DW$98, DW_AT_name("LPM")
    1134                      .dwattr $C$DW$98, DW_AT_TI_symbol_name("_LPM")
    1135                      .dwattr $C$DW$98, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x02)
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:02 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0436810                           PAGE   23

    1136                      .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1137                      .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
    1138              $C$DW$99        .dwtag  DW_TAG_member
    1139                      .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$19)
    1140                      .dwattr $C$DW$99, DW_AT_name("QUALSTDBY")
    1141                      .dwattr $C$DW$99, DW_AT_TI_symbol_name("_QUALSTDBY")
    1142                      .dwattr $C$DW$99, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x06)
    1143                      .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1144                      .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
    1145              $C$DW$100       .dwtag  DW_TAG_member
    1146                      .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$19)
    1147                      .dwattr $C$DW$100, DW_AT_name("rsvd1")
    1148                      .dwattr $C$DW$100, DW_AT_TI_symbol_name("_rsvd1")
    1149                      .dwattr $C$DW$100, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x07)
    1150                      .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1151                      .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
    1152              $C$DW$101       .dwtag  DW_TAG_member
    1153                      .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$19)
    1154                      .dwattr $C$DW$101, DW_AT_name("WDINTE")
    1155                      .dwattr $C$DW$101, DW_AT_TI_symbol_name("_WDINTE")
    1156                      .dwattr $C$DW$101, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    1157                      .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1158                      .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
    1159                      .dwendtag $C$DW$T$46
    1160              
    1161              
    1162              $C$DW$T$47      .dwtag  DW_TAG_union_type
    1163                      .dwattr $C$DW$T$47, DW_AT_name("LPMCR0_REG")
    1164                      .dwattr $C$DW$T$47, DW_AT_byte_size(0x01)
    1165              $C$DW$102       .dwtag  DW_TAG_member
    1166                      .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$19)
    1167                      .dwattr $C$DW$102, DW_AT_name("all")
    1168                      .dwattr $C$DW$102, DW_AT_TI_symbol_name("_all")
    1169                      .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1170                      .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
    1171              $C$DW$103       .dwtag  DW_TAG_member
    1172                      .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$46)
    1173                      .dwattr $C$DW$103, DW_AT_name("bit")
    1174                      .dwattr $C$DW$103, DW_AT_TI_symbol_name("_bit")
    1175                      .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1176                      .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
    1177                      .dwendtag $C$DW$T$47
    1178              
    1179              
    1180              $C$DW$T$48      .dwtag  DW_TAG_structure_type
    1181                      .dwattr $C$DW$T$48, DW_AT_name("MAPCNF_BITS")
    1182                      .dwattr $C$DW$T$48, DW_AT_byte_size(0x01)
    1183              $C$DW$104       .dwtag  DW_TAG_member
    1184                      .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$19)
    1185                      .dwattr $C$DW$104, DW_AT_name("MAPEPWM")
    1186                      .dwattr $C$DW$104, DW_AT_TI_symbol_name("_MAPEPWM")
    1187                      .dwattr $C$DW$104, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    1188                      .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1189                      .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
    1190              $C$DW$105       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:02 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0436810                           PAGE   24

    1191                      .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$19)
    1192                      .dwattr $C$DW$105, DW_AT_name("rsvd1")
    1193                      .dwattr $C$DW$105, DW_AT_TI_symbol_name("_rsvd1")
    1194                      .dwattr $C$DW$105, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0f)
    1195                      .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1196                      .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
    1197                      .dwendtag $C$DW$T$48
    1198              
    1199              
    1200              $C$DW$T$49      .dwtag  DW_TAG_union_type
    1201                      .dwattr $C$DW$T$49, DW_AT_name("MAPCNF_REG")
    1202                      .dwattr $C$DW$T$49, DW_AT_byte_size(0x01)
    1203              $C$DW$106       .dwtag  DW_TAG_member
    1204                      .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$19)
    1205                      .dwattr $C$DW$106, DW_AT_name("all")
    1206                      .dwattr $C$DW$106, DW_AT_TI_symbol_name("_all")
    1207                      .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1208                      .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    1209              $C$DW$107       .dwtag  DW_TAG_member
    1210                      .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$48)
    1211                      .dwattr $C$DW$107, DW_AT_name("bit")
    1212                      .dwattr $C$DW$107, DW_AT_TI_symbol_name("_bit")
    1213                      .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1214                      .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
    1215                      .dwendtag $C$DW$T$49
    1216              
    1217              
    1218              $C$DW$T$50      .dwtag  DW_TAG_structure_type
    1219                      .dwattr $C$DW$T$50, DW_AT_name("PCLKCR0_BITS")
    1220                      .dwattr $C$DW$T$50, DW_AT_byte_size(0x01)
    1221              $C$DW$108       .dwtag  DW_TAG_member
    1222                      .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$19)
    1223                      .dwattr $C$DW$108, DW_AT_name("rsvd1")
    1224                      .dwattr $C$DW$108, DW_AT_TI_symbol_name("_rsvd1")
    1225                      .dwattr $C$DW$108, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x02)
    1226                      .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1227                      .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    1228              $C$DW$109       .dwtag  DW_TAG_member
    1229                      .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$19)
    1230                      .dwattr $C$DW$109, DW_AT_name("TBCLKSYNC")
    1231                      .dwattr $C$DW$109, DW_AT_TI_symbol_name("_TBCLKSYNC")
    1232                      .dwattr $C$DW$109, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    1233                      .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1234                      .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    1235              $C$DW$110       .dwtag  DW_TAG_member
    1236                      .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$19)
    1237                      .dwattr $C$DW$110, DW_AT_name("ADCENCLK")
    1238                      .dwattr $C$DW$110, DW_AT_TI_symbol_name("_ADCENCLK")
    1239                      .dwattr $C$DW$110, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    1240                      .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1241                      .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    1242              $C$DW$111       .dwtag  DW_TAG_member
    1243                      .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$19)
    1244                      .dwattr $C$DW$111, DW_AT_name("I2CAENCLK")
    1245                      .dwattr $C$DW$111, DW_AT_TI_symbol_name("_I2CAENCLK")
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:02 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0436810                           PAGE   25

    1246                      .dwattr $C$DW$111, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    1247                      .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1248                      .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    1249              $C$DW$112       .dwtag  DW_TAG_member
    1250                      .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$19)
    1251                      .dwattr $C$DW$112, DW_AT_name("SCICENCLK")
    1252                      .dwattr $C$DW$112, DW_AT_TI_symbol_name("_SCICENCLK")
    1253                      .dwattr $C$DW$112, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    1254                      .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1255                      .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    1256              $C$DW$113       .dwtag  DW_TAG_member
    1257                      .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$19)
    1258                      .dwattr $C$DW$113, DW_AT_name("rsvd2")
    1259                      .dwattr $C$DW$113, DW_AT_TI_symbol_name("_rsvd2")
    1260                      .dwattr $C$DW$113, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x02)
    1261                      .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1262                      .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    1263              $C$DW$114       .dwtag  DW_TAG_member
    1264                      .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$19)
    1265                      .dwattr $C$DW$114, DW_AT_name("SPIAENCLK")
    1266                      .dwattr $C$DW$114, DW_AT_TI_symbol_name("_SPIAENCLK")
    1267                      .dwattr $C$DW$114, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
    1268                      .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1269                      .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    1270              $C$DW$115       .dwtag  DW_TAG_member
    1271                      .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$19)
    1272                      .dwattr $C$DW$115, DW_AT_name("rsvd3")
    1273                      .dwattr $C$DW$115, DW_AT_TI_symbol_name("_rsvd3")
    1274                      .dwattr $C$DW$115, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    1275                      .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1276                      .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    1277              $C$DW$116       .dwtag  DW_TAG_member
    1278                      .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$19)
    1279                      .dwattr $C$DW$116, DW_AT_name("SCIAENCLK")
    1280                      .dwattr $C$DW$116, DW_AT_TI_symbol_name("_SCIAENCLK")
    1281                      .dwattr $C$DW$116, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
    1282                      .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1283                      .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    1284              $C$DW$117       .dwtag  DW_TAG_member
    1285                      .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$19)
    1286                      .dwattr $C$DW$117, DW_AT_name("SCIBENCLK")
    1287                      .dwattr $C$DW$117, DW_AT_TI_symbol_name("_SCIBENCLK")
    1288                      .dwattr $C$DW$117, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
    1289                      .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1290                      .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    1291              $C$DW$118       .dwtag  DW_TAG_member
    1292                      .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$19)
    1293                      .dwattr $C$DW$118, DW_AT_name("MCBSPAENCLK")
    1294                      .dwattr $C$DW$118, DW_AT_TI_symbol_name("_MCBSPAENCLK")
    1295                      .dwattr $C$DW$118, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
    1296                      .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1297                      .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    1298              $C$DW$119       .dwtag  DW_TAG_member
    1299                      .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$19)
    1300                      .dwattr $C$DW$119, DW_AT_name("MCBSPBENCLK")
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:02 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0436810                           PAGE   26

    1301                      .dwattr $C$DW$119, DW_AT_TI_symbol_name("_MCBSPBENCLK")
    1302                      .dwattr $C$DW$119, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
    1303                      .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1304                      .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    1305              $C$DW$120       .dwtag  DW_TAG_member
    1306                      .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$19)
    1307                      .dwattr $C$DW$120, DW_AT_name("ECANAENCLK")
    1308                      .dwattr $C$DW$120, DW_AT_TI_symbol_name("_ECANAENCLK")
    1309                      .dwattr $C$DW$120, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
    1310                      .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1311                      .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    1312              $C$DW$121       .dwtag  DW_TAG_member
    1313                      .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$19)
    1314                      .dwattr $C$DW$121, DW_AT_name("ECANBENCLK")
    1315                      .dwattr $C$DW$121, DW_AT_TI_symbol_name("_ECANBENCLK")
    1316                      .dwattr $C$DW$121, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    1317                      .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1318                      .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    1319                      .dwendtag $C$DW$T$50
    1320              
    1321              
    1322              $C$DW$T$51      .dwtag  DW_TAG_union_type
    1323                      .dwattr $C$DW$T$51, DW_AT_name("PCLKCR0_REG")
    1324                      .dwattr $C$DW$T$51, DW_AT_byte_size(0x01)
    1325              $C$DW$122       .dwtag  DW_TAG_member
    1326                      .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$19)
    1327                      .dwattr $C$DW$122, DW_AT_name("all")
    1328                      .dwattr $C$DW$122, DW_AT_TI_symbol_name("_all")
    1329                      .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1330                      .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    1331              $C$DW$123       .dwtag  DW_TAG_member
    1332                      .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$50)
    1333                      .dwattr $C$DW$123, DW_AT_name("bit")
    1334                      .dwattr $C$DW$123, DW_AT_TI_symbol_name("_bit")
    1335                      .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1336                      .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    1337                      .dwendtag $C$DW$T$51
    1338              
    1339              
    1340              $C$DW$T$52      .dwtag  DW_TAG_structure_type
    1341                      .dwattr $C$DW$T$52, DW_AT_name("PCLKCR1_BITS")
    1342                      .dwattr $C$DW$T$52, DW_AT_byte_size(0x01)
    1343              $C$DW$124       .dwtag  DW_TAG_member
    1344                      .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$19)
    1345                      .dwattr $C$DW$124, DW_AT_name("EPWM1ENCLK")
    1346                      .dwattr $C$DW$124, DW_AT_TI_symbol_name("_EPWM1ENCLK")
    1347                      .dwattr $C$DW$124, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    1348                      .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1349                      .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    1350              $C$DW$125       .dwtag  DW_TAG_member
    1351                      .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$19)
    1352                      .dwattr $C$DW$125, DW_AT_name("EPWM2ENCLK")
    1353                      .dwattr $C$DW$125, DW_AT_TI_symbol_name("_EPWM2ENCLK")
    1354                      .dwattr $C$DW$125, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    1355                      .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:02 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0436810                           PAGE   27

    1356                      .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    1357              $C$DW$126       .dwtag  DW_TAG_member
    1358                      .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$19)
    1359                      .dwattr $C$DW$126, DW_AT_name("EPWM3ENCLK")
    1360                      .dwattr $C$DW$126, DW_AT_TI_symbol_name("_EPWM3ENCLK")
    1361                      .dwattr $C$DW$126, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    1362                      .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1363                      .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    1364              $C$DW$127       .dwtag  DW_TAG_member
    1365                      .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$19)
    1366                      .dwattr $C$DW$127, DW_AT_name("EPWM4ENCLK")
    1367                      .dwattr $C$DW$127, DW_AT_TI_symbol_name("_EPWM4ENCLK")
    1368                      .dwattr $C$DW$127, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    1369                      .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1370                      .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    1371              $C$DW$128       .dwtag  DW_TAG_member
    1372                      .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$19)
    1373                      .dwattr $C$DW$128, DW_AT_name("EPWM5ENCLK")
    1374                      .dwattr $C$DW$128, DW_AT_TI_symbol_name("_EPWM5ENCLK")
    1375                      .dwattr $C$DW$128, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    1376                      .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1377                      .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    1378              $C$DW$129       .dwtag  DW_TAG_member
    1379                      .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$19)
    1380                      .dwattr $C$DW$129, DW_AT_name("EPWM6ENCLK")
    1381                      .dwattr $C$DW$129, DW_AT_TI_symbol_name("_EPWM6ENCLK")
    1382                      .dwattr $C$DW$129, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    1383                      .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1384                      .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    1385              $C$DW$130       .dwtag  DW_TAG_member
    1386                      .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$19)
    1387                      .dwattr $C$DW$130, DW_AT_name("rsvd1")
    1388                      .dwattr $C$DW$130, DW_AT_TI_symbol_name("_rsvd1")
    1389                      .dwattr $C$DW$130, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x02)
    1390                      .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1391                      .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    1392              $C$DW$131       .dwtag  DW_TAG_member
    1393                      .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$19)
    1394                      .dwattr $C$DW$131, DW_AT_name("ECAP1ENCLK")
    1395                      .dwattr $C$DW$131, DW_AT_TI_symbol_name("_ECAP1ENCLK")
    1396                      .dwattr $C$DW$131, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
    1397                      .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1398                      .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    1399              $C$DW$132       .dwtag  DW_TAG_member
    1400                      .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$19)
    1401                      .dwattr $C$DW$132, DW_AT_name("ECAP2ENCLK")
    1402                      .dwattr $C$DW$132, DW_AT_TI_symbol_name("_ECAP2ENCLK")
    1403                      .dwattr $C$DW$132, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    1404                      .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1405                      .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    1406              $C$DW$133       .dwtag  DW_TAG_member
    1407                      .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$19)
    1408                      .dwattr $C$DW$133, DW_AT_name("ECAP3ENCLK")
    1409                      .dwattr $C$DW$133, DW_AT_TI_symbol_name("_ECAP3ENCLK")
    1410                      .dwattr $C$DW$133, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:02 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0436810                           PAGE   28

    1411                      .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1412                      .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    1413              $C$DW$134       .dwtag  DW_TAG_member
    1414                      .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$19)
    1415                      .dwattr $C$DW$134, DW_AT_name("ECAP4ENCLK")
    1416                      .dwattr $C$DW$134, DW_AT_TI_symbol_name("_ECAP4ENCLK")
    1417                      .dwattr $C$DW$134, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
    1418                      .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1419                      .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    1420              $C$DW$135       .dwtag  DW_TAG_member
    1421                      .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$19)
    1422                      .dwattr $C$DW$135, DW_AT_name("ECAP5ENCLK")
    1423                      .dwattr $C$DW$135, DW_AT_TI_symbol_name("_ECAP5ENCLK")
    1424                      .dwattr $C$DW$135, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
    1425                      .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1426                      .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    1427              $C$DW$136       .dwtag  DW_TAG_member
    1428                      .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$19)
    1429                      .dwattr $C$DW$136, DW_AT_name("ECAP6ENCLK")
    1430                      .dwattr $C$DW$136, DW_AT_TI_symbol_name("_ECAP6ENCLK")
    1431                      .dwattr $C$DW$136, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
    1432                      .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1433                      .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    1434              $C$DW$137       .dwtag  DW_TAG_member
    1435                      .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$19)
    1436                      .dwattr $C$DW$137, DW_AT_name("EQEP1ENCLK")
    1437                      .dwattr $C$DW$137, DW_AT_TI_symbol_name("_EQEP1ENCLK")
    1438                      .dwattr $C$DW$137, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
    1439                      .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1440                      .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    1441              $C$DW$138       .dwtag  DW_TAG_member
    1442                      .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$19)
    1443                      .dwattr $C$DW$138, DW_AT_name("EQEP2ENCLK")
    1444                      .dwattr $C$DW$138, DW_AT_TI_symbol_name("_EQEP2ENCLK")
    1445                      .dwattr $C$DW$138, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    1446                      .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1447                      .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    1448                      .dwendtag $C$DW$T$52
    1449              
    1450              
    1451              $C$DW$T$53      .dwtag  DW_TAG_union_type
    1452                      .dwattr $C$DW$T$53, DW_AT_name("PCLKCR1_REG")
    1453                      .dwattr $C$DW$T$53, DW_AT_byte_size(0x01)
    1454              $C$DW$139       .dwtag  DW_TAG_member
    1455                      .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$19)
    1456                      .dwattr $C$DW$139, DW_AT_name("all")
    1457                      .dwattr $C$DW$139, DW_AT_TI_symbol_name("_all")
    1458                      .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1459                      .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    1460              $C$DW$140       .dwtag  DW_TAG_member
    1461                      .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$52)
    1462                      .dwattr $C$DW$140, DW_AT_name("bit")
    1463                      .dwattr $C$DW$140, DW_AT_TI_symbol_name("_bit")
    1464                      .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1465                      .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:02 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0436810                           PAGE   29

    1466                      .dwendtag $C$DW$T$53
    1467              
    1468              
    1469              $C$DW$T$54      .dwtag  DW_TAG_structure_type
    1470                      .dwattr $C$DW$T$54, DW_AT_name("PCLKCR3_BITS")
    1471                      .dwattr $C$DW$T$54, DW_AT_byte_size(0x01)
    1472              $C$DW$141       .dwtag  DW_TAG_member
    1473                      .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$19)
    1474                      .dwattr $C$DW$141, DW_AT_name("rsvd1")
    1475                      .dwattr $C$DW$141, DW_AT_TI_symbol_name("_rsvd1")
    1476                      .dwattr $C$DW$141, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x08)
    1477                      .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1478                      .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    1479              $C$DW$142       .dwtag  DW_TAG_member
    1480                      .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$19)
    1481                      .dwattr $C$DW$142, DW_AT_name("CPUTIMER0ENCLK")
    1482                      .dwattr $C$DW$142, DW_AT_TI_symbol_name("_CPUTIMER0ENCLK")
    1483                      .dwattr $C$DW$142, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
    1484                      .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1485                      .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    1486              $C$DW$143       .dwtag  DW_TAG_member
    1487                      .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$19)
    1488                      .dwattr $C$DW$143, DW_AT_name("CPUTIMER1ENCLK")
    1489                      .dwattr $C$DW$143, DW_AT_TI_symbol_name("_CPUTIMER1ENCLK")
    1490                      .dwattr $C$DW$143, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    1491                      .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1492                      .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    1493              $C$DW$144       .dwtag  DW_TAG_member
    1494                      .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$19)
    1495                      .dwattr $C$DW$144, DW_AT_name("CPUTIMER2ENCLK")
    1496                      .dwattr $C$DW$144, DW_AT_TI_symbol_name("_CPUTIMER2ENCLK")
    1497                      .dwattr $C$DW$144, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
    1498                      .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1499                      .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    1500              $C$DW$145       .dwtag  DW_TAG_member
    1501                      .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$19)
    1502                      .dwattr $C$DW$145, DW_AT_name("DMAENCLK")
    1503                      .dwattr $C$DW$145, DW_AT_TI_symbol_name("_DMAENCLK")
    1504                      .dwattr $C$DW$145, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
    1505                      .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1506                      .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    1507              $C$DW$146       .dwtag  DW_TAG_member
    1508                      .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$19)
    1509                      .dwattr $C$DW$146, DW_AT_name("XINTFENCLK")
    1510                      .dwattr $C$DW$146, DW_AT_TI_symbol_name("_XINTFENCLK")
    1511                      .dwattr $C$DW$146, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
    1512                      .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1513                      .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
    1514              $C$DW$147       .dwtag  DW_TAG_member
    1515                      .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$19)
    1516                      .dwattr $C$DW$147, DW_AT_name("GPIOINENCLK")
    1517                      .dwattr $C$DW$147, DW_AT_TI_symbol_name("_GPIOINENCLK")
    1518                      .dwattr $C$DW$147, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
    1519                      .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1520                      .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:02 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0436810                           PAGE   30

    1521              $C$DW$148       .dwtag  DW_TAG_member
    1522                      .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$19)
    1523                      .dwattr $C$DW$148, DW_AT_name("rsvd2")
    1524                      .dwattr $C$DW$148, DW_AT_TI_symbol_name("_rsvd2")
    1525                      .dwattr $C$DW$148, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x02)
    1526                      .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1527                      .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    1528                      .dwendtag $C$DW$T$54
    1529              
    1530              
    1531              $C$DW$T$55      .dwtag  DW_TAG_union_type
    1532                      .dwattr $C$DW$T$55, DW_AT_name("PCLKCR3_REG")
    1533                      .dwattr $C$DW$T$55, DW_AT_byte_size(0x01)
    1534              $C$DW$149       .dwtag  DW_TAG_member
    1535                      .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$19)
    1536                      .dwattr $C$DW$149, DW_AT_name("all")
    1537                      .dwattr $C$DW$149, DW_AT_TI_symbol_name("_all")
    1538                      .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1539                      .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    1540              $C$DW$150       .dwtag  DW_TAG_member
    1541                      .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$54)
    1542                      .dwattr $C$DW$150, DW_AT_name("bit")
    1543                      .dwattr $C$DW$150, DW_AT_TI_symbol_name("_bit")
    1544                      .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1545                      .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
    1546                      .dwendtag $C$DW$T$55
    1547              
    1548              
    1549              $C$DW$T$56      .dwtag  DW_TAG_structure_type
    1550                      .dwattr $C$DW$T$56, DW_AT_name("PIEACK_BITS")
    1551                      .dwattr $C$DW$T$56, DW_AT_byte_size(0x01)
    1552              $C$DW$151       .dwtag  DW_TAG_member
    1553                      .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$19)
    1554                      .dwattr $C$DW$151, DW_AT_name("ACK1")
    1555                      .dwattr $C$DW$151, DW_AT_TI_symbol_name("_ACK1")
    1556                      .dwattr $C$DW$151, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    1557                      .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1558                      .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    1559              $C$DW$152       .dwtag  DW_TAG_member
    1560                      .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$19)
    1561                      .dwattr $C$DW$152, DW_AT_name("ACK2")
    1562                      .dwattr $C$DW$152, DW_AT_TI_symbol_name("_ACK2")
    1563                      .dwattr $C$DW$152, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    1564                      .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1565                      .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    1566              $C$DW$153       .dwtag  DW_TAG_member
    1567                      .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$19)
    1568                      .dwattr $C$DW$153, DW_AT_name("ACK3")
    1569                      .dwattr $C$DW$153, DW_AT_TI_symbol_name("_ACK3")
    1570                      .dwattr $C$DW$153, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    1571                      .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1572                      .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    1573              $C$DW$154       .dwtag  DW_TAG_member
    1574                      .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$19)
    1575                      .dwattr $C$DW$154, DW_AT_name("ACK4")
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:02 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0436810                           PAGE   31

    1576                      .dwattr $C$DW$154, DW_AT_TI_symbol_name("_ACK4")
    1577                      .dwattr $C$DW$154, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    1578                      .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1579                      .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
    1580              $C$DW$155       .dwtag  DW_TAG_member
    1581                      .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$19)
    1582                      .dwattr $C$DW$155, DW_AT_name("ACK5")
    1583                      .dwattr $C$DW$155, DW_AT_TI_symbol_name("_ACK5")
    1584                      .dwattr $C$DW$155, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    1585                      .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1586                      .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
    1587              $C$DW$156       .dwtag  DW_TAG_member
    1588                      .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$19)
    1589                      .dwattr $C$DW$156, DW_AT_name("ACK6")
    1590                      .dwattr $C$DW$156, DW_AT_TI_symbol_name("_ACK6")
    1591                      .dwattr $C$DW$156, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    1592                      .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1593                      .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    1594              $C$DW$157       .dwtag  DW_TAG_member
    1595                      .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$19)
    1596                      .dwattr $C$DW$157, DW_AT_name("ACK7")
    1597                      .dwattr $C$DW$157, DW_AT_TI_symbol_name("_ACK7")
    1598                      .dwattr $C$DW$157, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    1599                      .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1600                      .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    1601              $C$DW$158       .dwtag  DW_TAG_member
    1602                      .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$19)
    1603                      .dwattr $C$DW$158, DW_AT_name("ACK8")
    1604                      .dwattr $C$DW$158, DW_AT_TI_symbol_name("_ACK8")
    1605                      .dwattr $C$DW$158, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    1606                      .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1607                      .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    1608              $C$DW$159       .dwtag  DW_TAG_member
    1609                      .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$19)
    1610                      .dwattr $C$DW$159, DW_AT_name("ACK9")
    1611                      .dwattr $C$DW$159, DW_AT_TI_symbol_name("_ACK9")
    1612                      .dwattr $C$DW$159, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
    1613                      .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1614                      .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    1615              $C$DW$160       .dwtag  DW_TAG_member
    1616                      .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$19)
    1617                      .dwattr $C$DW$160, DW_AT_name("ACK10")
    1618                      .dwattr $C$DW$160, DW_AT_TI_symbol_name("_ACK10")
    1619                      .dwattr $C$DW$160, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    1620                      .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1621                      .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    1622              $C$DW$161       .dwtag  DW_TAG_member
    1623                      .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$19)
    1624                      .dwattr $C$DW$161, DW_AT_name("ACK11")
    1625                      .dwattr $C$DW$161, DW_AT_TI_symbol_name("_ACK11")
    1626                      .dwattr $C$DW$161, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
    1627                      .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1628                      .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    1629              $C$DW$162       .dwtag  DW_TAG_member
    1630                      .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:02 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0436810                           PAGE   32

    1631                      .dwattr $C$DW$162, DW_AT_name("ACK12")
    1632                      .dwattr $C$DW$162, DW_AT_TI_symbol_name("_ACK12")
    1633                      .dwattr $C$DW$162, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
    1634                      .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1635                      .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    1636              $C$DW$163       .dwtag  DW_TAG_member
    1637                      .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$19)
    1638                      .dwattr $C$DW$163, DW_AT_name("rsvd")
    1639                      .dwattr $C$DW$163, DW_AT_TI_symbol_name("_rsvd")
    1640                      .dwattr $C$DW$163, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x04)
    1641                      .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1642                      .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    1643                      .dwendtag $C$DW$T$56
    1644              
    1645              
    1646              $C$DW$T$57      .dwtag  DW_TAG_union_type
    1647                      .dwattr $C$DW$T$57, DW_AT_name("PIEACK_REG")
    1648                      .dwattr $C$DW$T$57, DW_AT_byte_size(0x01)
    1649              $C$DW$164       .dwtag  DW_TAG_member
    1650                      .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$19)
    1651                      .dwattr $C$DW$164, DW_AT_name("all")
    1652                      .dwattr $C$DW$164, DW_AT_TI_symbol_name("_all")
    1653                      .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1654                      .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    1655              $C$DW$165       .dwtag  DW_TAG_member
    1656                      .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$56)
    1657                      .dwattr $C$DW$165, DW_AT_name("bit")
    1658                      .dwattr $C$DW$165, DW_AT_TI_symbol_name("_bit")
    1659                      .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1660                      .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    1661                      .dwendtag $C$DW$T$57
    1662              
    1663              
    1664              $C$DW$T$58      .dwtag  DW_TAG_structure_type
    1665                      .dwattr $C$DW$T$58, DW_AT_name("PIECTRL_BITS")
    1666                      .dwattr $C$DW$T$58, DW_AT_byte_size(0x01)
    1667              $C$DW$166       .dwtag  DW_TAG_member
    1668                      .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$19)
    1669                      .dwattr $C$DW$166, DW_AT_name("ENPIE")
    1670                      .dwattr $C$DW$166, DW_AT_TI_symbol_name("_ENPIE")
    1671                      .dwattr $C$DW$166, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    1672                      .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1673                      .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    1674              $C$DW$167       .dwtag  DW_TAG_member
    1675                      .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$19)
    1676                      .dwattr $C$DW$167, DW_AT_name("PIEVECT")
    1677                      .dwattr $C$DW$167, DW_AT_TI_symbol_name("_PIEVECT")
    1678                      .dwattr $C$DW$167, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0f)
    1679                      .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1680                      .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    1681                      .dwendtag $C$DW$T$58
    1682              
    1683              
    1684              $C$DW$T$59      .dwtag  DW_TAG_union_type
    1685                      .dwattr $C$DW$T$59, DW_AT_name("PIECTRL_REG")
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:02 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0436810                           PAGE   33

    1686                      .dwattr $C$DW$T$59, DW_AT_byte_size(0x01)
    1687              $C$DW$168       .dwtag  DW_TAG_member
    1688                      .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$19)
    1689                      .dwattr $C$DW$168, DW_AT_name("all")
    1690                      .dwattr $C$DW$168, DW_AT_TI_symbol_name("_all")
    1691                      .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1692                      .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    1693              $C$DW$169       .dwtag  DW_TAG_member
    1694                      .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$58)
    1695                      .dwattr $C$DW$169, DW_AT_name("bit")
    1696                      .dwattr $C$DW$169, DW_AT_TI_symbol_name("_bit")
    1697                      .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1698                      .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    1699                      .dwendtag $C$DW$T$59
    1700              
    1701              
    1702              $C$DW$T$60      .dwtag  DW_TAG_structure_type
    1703                      .dwattr $C$DW$T$60, DW_AT_name("PIEIER_BITS")
    1704                      .dwattr $C$DW$T$60, DW_AT_byte_size(0x01)
