TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:04 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0323210                           PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v6.2.7 *
       3              ;* Date/Time created: Thu Jul 02 08:31:04 2015                 *
       4              ;***************************************************************
       5                      .compiler_opts --diag_wrap=off --float_support=fpu32 --hll_source=on --mem_model:code=flat --mem_mode
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("../cntrlPWM/cntrlBrek.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v6.2.7 Copyright (c) 1996-2014 Texas I
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("D:\ActiveProject\EKT5\PKMT_NONBIOS\InvertorCntrl\ISPprg")
      13              
      14              $C$DW$1 .dwtag  DW_TAG_subprogram, DW_AT_name("getRegister")
      15                      .dwattr $C$DW$1, DW_AT_TI_symbol_name("_getRegister")
      16                      .dwattr $C$DW$1, DW_AT_type(*$C$DW$T$10)

     180                      .dwattr $C$DW$12, DW_AT_TI_max_frame_size(-4)
     181                      .dwpsn  file "../cntrlPWM/cntrlBrek.c",line 43,column 22,is_stmt,address _cntrlBreak
     182              
     183                      .dwfde $C$DW$CIE, _cntrlBreak
     184              
     185              ;***************************************************************
     186              ;* FNAME: _cntrlBreak                   FR SIZE:   2           *
     187              ;*                                                             *
     188              ;* FUNCTION ENVIRONMENT                                        *
     189              ;*                                                             *
     190              ;* FUNCTION PROPERTIES                                         *
     191              ;*                            2 Parameter,  0 Auto,  0 SOE     *
     192              ;***************************************************************
     193              
     194 00000028       _cntrlBreak:
     195                      .dwcfi  cfa_offset, -2
     196                      .dwcfi  save_reg_to_mem, 26, 0
     197                      .dwcfi  save_reg_to_reg, 78, 26
     198 00000028 FE02          ADDB      SP,#2                 ; [CPU_U] 
     199                      .dwcfi  cfa_offset, -4
     200                      .dwpsn  file "../cntrlPWM/cntrlBrek.c",line 44,column 2,is_stmt
     201              $C$DW$13        .dwtag  DW_TAG_TI_branch
     202                      .dwattr $C$DW$13, DW_AT_low_pc(0x00)
     203                      .dwattr $C$DW$13, DW_AT_name("_getMomentaryVoltagDC")
     204                      .dwattr $C$DW$13, DW_AT_TI_call
     205 00000029 7640!         LCR       #_getMomentaryVoltagDC ; [CPU_] |44| 
         0000002a 0000 
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:04 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0323210                           PAGE    5

     206                      ; call occurs [#_getMomentaryVoltagDC] ; [] |44| 
     207 0000002b 761F-         MOVW      DP,#_levelBreak       ; [CPU_U] 
         0000002c 0000 
     208 0000002d E2AF-         MOV32     R1H,@_levelBreak      ; [CPU_] |44| 
         0000002e 0100 
     209 0000002f E694          CMPF32    R0H,R1H               ; [CPU_] |44| 
         00000030 0008 
     210 00000031 AD14          MOVST0    ZF, NF                ; [CPU_] |44| 
     211 00000032 6506          B         $C$L1,LEQ             ; [CPU_] |44| 
     212                      ; branchcc occurs ; [] |44| 
     213                      .dwpsn  file "../cntrlPWM/cntrlBrek.c",line 48,column 4,is_stmt
     214 00000033 761F!         MOVW      DP,#_GpioDataRegs+5   ; [CPU_U] 
         00000034 0000 
     215 00000035 1A05!         OR        @_GpioDataRegs+5,#0x0100 ; [CPU_] |48| 
         00000036 0100 
     216                      .dwpsn  file "../cntrlPWM/cntrlBrek.c",line 50,column 2,is_stmt
     217 00000037 6F05          B         $C$L2,UNC             ; [CPU_] |50| 
     218                      ; branch occurs ; [] |50| 
     219 00000038       $C$L1:    
     220                      .dwpsn  file "../cntrlPWM/cntrlBrek.c",line 54,column 4,is_stmt
     221 00000038 761F!         MOVW      DP,#_GpioDataRegs+3   ; [CPU_U] 
         00000039 0000 
     222 0000003a 1A03!         OR        @_GpioDataRegs+3,#0x0100 ; [CPU_] |54| 
         0000003b 0100 
     223                      .dwpsn  file "../cntrlPWM/cntrlBrek.c",line 57,column 1,is_stmt
     224 0000003c       $C$L2:    
     225 0000003c FE82          SUBB      SP,#2                 ; [CPU_U] 
     226                      .dwcfi  cfa_offset, -2
     227              $C$DW$14        .dwtag  DW_TAG_TI_branch
     228                      .dwattr $C$DW$14, DW_AT_low_pc(0x00)
     229                      .dwattr $C$DW$14, DW_AT_TI_return
     230 0000003d 0006          LRETR     ; [CPU_] 
     231                      ; return occurs ; [] 
     232                      .dwattr $C$DW$12, DW_AT_TI_end_file("../cntrlPWM/cntrlBrek.c")
     233                      .dwattr $C$DW$12, DW_AT_TI_end_line(0x39)
     234                      .dwattr $C$DW$12, DW_AT_TI_end_column(0x01)
     235                      .dwendentry
     236                      .dwendtag $C$DW$12
     237              
     238              ;**************************************************************
     239              ;* UNDEFINED EXTERNAL REFERENCES                              *
     240              ;**************************************************************
     241                      .global _getRegister
     242                      .global _getMomentaryVoltagDC
     243                      .global _GpioDataRegs
     244                      .global _GpioCtrlRegs
     245              
     246              ;***************************************************************
     247              ;* TYPE INFORMATION                                            *
     248              ;***************************************************************
     249              
     250              $C$DW$T$20      .dwtag  DW_TAG_structure_type
     251                      .dwattr $C$DW$T$20, DW_AT_name("GPA1_BITS")
     252                      .dwattr $C$DW$T$20, DW_AT_byte_size(0x02)
     253              $C$DW$15        .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:04 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0323210                           PAGE    6

     254                      .dwattr $C$DW$15, DW_AT_type(*$C$DW$T$19)
     255                      .dwattr $C$DW$15, DW_AT_name("GPIO0")
     256                      .dwattr $C$DW$15, DW_AT_TI_symbol_name("_GPIO0")
     257                      .dwattr $C$DW$15, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x02)
     258                      .dwattr $C$DW$15, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     259                      .dwattr $C$DW$15, DW_AT_accessibility(DW_ACCESS_public)
     260              $C$DW$16        .dwtag  DW_TAG_member
     261                      .dwattr $C$DW$16, DW_AT_type(*$C$DW$T$19)
     262                      .dwattr $C$DW$16, DW_AT_name("GPIO1")
     263                      .dwattr $C$DW$16, DW_AT_TI_symbol_name("_GPIO1")
     264                      .dwattr $C$DW$16, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x02)
     265                      .dwattr $C$DW$16, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     266                      .dwattr $C$DW$16, DW_AT_accessibility(DW_ACCESS_public)
     267              $C$DW$17        .dwtag  DW_TAG_member
     268                      .dwattr $C$DW$17, DW_AT_type(*$C$DW$T$19)
     269                      .dwattr $C$DW$17, DW_AT_name("GPIO2")
     270                      .dwattr $C$DW$17, DW_AT_TI_symbol_name("_GPIO2")
     271                      .dwattr $C$DW$17, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x02)
     272                      .dwattr $C$DW$17, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     273                      .dwattr $C$DW$17, DW_AT_accessibility(DW_ACCESS_public)
     274              $C$DW$18        .dwtag  DW_TAG_member
     275                      .dwattr $C$DW$18, DW_AT_type(*$C$DW$T$19)
     276                      .dwattr $C$DW$18, DW_AT_name("GPIO3")
     277                      .dwattr $C$DW$18, DW_AT_TI_symbol_name("_GPIO3")
     278                      .dwattr $C$DW$18, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x02)
     279                      .dwattr $C$DW$18, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     280                      .dwattr $C$DW$18, DW_AT_accessibility(DW_ACCESS_public)
     281              $C$DW$19        .dwtag  DW_TAG_member
     282                      .dwattr $C$DW$19, DW_AT_type(*$C$DW$T$19)
     283                      .dwattr $C$DW$19, DW_AT_name("GPIO4")
     284                      .dwattr $C$DW$19, DW_AT_TI_symbol_name("_GPIO4")
     285                      .dwattr $C$DW$19, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x02)
     286                      .dwattr $C$DW$19, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     287                      .dwattr $C$DW$19, DW_AT_accessibility(DW_ACCESS_public)
     288              $C$DW$20        .dwtag  DW_TAG_member
     289                      .dwattr $C$DW$20, DW_AT_type(*$C$DW$T$19)
     290                      .dwattr $C$DW$20, DW_AT_name("GPIO5")
     291                      .dwattr $C$DW$20, DW_AT_TI_symbol_name("_GPIO5")
     292                      .dwattr $C$DW$20, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x02)
     293                      .dwattr $C$DW$20, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     294                      .dwattr $C$DW$20, DW_AT_accessibility(DW_ACCESS_public)
     295              $C$DW$21        .dwtag  DW_TAG_member
     296                      .dwattr $C$DW$21, DW_AT_type(*$C$DW$T$19)
     297                      .dwattr $C$DW$21, DW_AT_name("GPIO6")
     298                      .dwattr $C$DW$21, DW_AT_TI_symbol_name("_GPIO6")
     299                      .dwattr $C$DW$21, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x02)
     300                      .dwattr $C$DW$21, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     301                      .dwattr $C$DW$21, DW_AT_accessibility(DW_ACCESS_public)
     302              $C$DW$22        .dwtag  DW_TAG_member
     303                      .dwattr $C$DW$22, DW_AT_type(*$C$DW$T$19)
     304                      .dwattr $C$DW$22, DW_AT_name("GPIO7")
     305                      .dwattr $C$DW$22, DW_AT_TI_symbol_name("_GPIO7")
     306                      .dwattr $C$DW$22, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x02)
     307                      .dwattr $C$DW$22, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     308                      .dwattr $C$DW$22, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:04 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0323210                           PAGE    7

     309              $C$DW$23        .dwtag  DW_TAG_member
     310                      .dwattr $C$DW$23, DW_AT_type(*$C$DW$T$19)
     311                      .dwattr $C$DW$23, DW_AT_name("GPIO8")
     312                      .dwattr $C$DW$23, DW_AT_TI_symbol_name("_GPIO8")
     313                      .dwattr $C$DW$23, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x02)
     314                      .dwattr $C$DW$23, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     315                      .dwattr $C$DW$23, DW_AT_accessibility(DW_ACCESS_public)
     316              $C$DW$24        .dwtag  DW_TAG_member
     317                      .dwattr $C$DW$24, DW_AT_type(*$C$DW$T$19)
     318                      .dwattr $C$DW$24, DW_AT_name("GPIO9")
     319                      .dwattr $C$DW$24, DW_AT_TI_symbol_name("_GPIO9")
     320                      .dwattr $C$DW$24, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x02)
     321                      .dwattr $C$DW$24, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     322                      .dwattr $C$DW$24, DW_AT_accessibility(DW_ACCESS_public)
     323              $C$DW$25        .dwtag  DW_TAG_member
     324                      .dwattr $C$DW$25, DW_AT_type(*$C$DW$T$19)
     325                      .dwattr $C$DW$25, DW_AT_name("GPIO10")
     326                      .dwattr $C$DW$25, DW_AT_TI_symbol_name("_GPIO10")
     327                      .dwattr $C$DW$25, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x02)
     328                      .dwattr $C$DW$25, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     329                      .dwattr $C$DW$25, DW_AT_accessibility(DW_ACCESS_public)
     330              $C$DW$26        .dwtag  DW_TAG_member
     331                      .dwattr $C$DW$26, DW_AT_type(*$C$DW$T$19)
     332                      .dwattr $C$DW$26, DW_AT_name("GPIO11")
     333                      .dwattr $C$DW$26, DW_AT_TI_symbol_name("_GPIO11")
     334                      .dwattr $C$DW$26, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x02)
     335                      .dwattr $C$DW$26, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     336                      .dwattr $C$DW$26, DW_AT_accessibility(DW_ACCESS_public)
     337              $C$DW$27        .dwtag  DW_TAG_member
     338                      .dwattr $C$DW$27, DW_AT_type(*$C$DW$T$19)
     339                      .dwattr $C$DW$27, DW_AT_name("GPIO12")
     340                      .dwattr $C$DW$27, DW_AT_TI_symbol_name("_GPIO12")
     341                      .dwattr $C$DW$27, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x02)
     342                      .dwattr $C$DW$27, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     343                      .dwattr $C$DW$27, DW_AT_accessibility(DW_ACCESS_public)
     344              $C$DW$28        .dwtag  DW_TAG_member
     345                      .dwattr $C$DW$28, DW_AT_type(*$C$DW$T$19)
     346                      .dwattr $C$DW$28, DW_AT_name("GPIO13")
     347                      .dwattr $C$DW$28, DW_AT_TI_symbol_name("_GPIO13")
     348                      .dwattr $C$DW$28, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x02)
     349                      .dwattr $C$DW$28, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     350                      .dwattr $C$DW$28, DW_AT_accessibility(DW_ACCESS_public)
     351              $C$DW$29        .dwtag  DW_TAG_member
     352                      .dwattr $C$DW$29, DW_AT_type(*$C$DW$T$19)
     353                      .dwattr $C$DW$29, DW_AT_name("GPIO14")
     354                      .dwattr $C$DW$29, DW_AT_TI_symbol_name("_GPIO14")
     355                      .dwattr $C$DW$29, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x02)
     356                      .dwattr $C$DW$29, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     357                      .dwattr $C$DW$29, DW_AT_accessibility(DW_ACCESS_public)
     358              $C$DW$30        .dwtag  DW_TAG_member
     359                      .dwattr $C$DW$30, DW_AT_type(*$C$DW$T$19)
     360                      .dwattr $C$DW$30, DW_AT_name("GPIO15")
     361                      .dwattr $C$DW$30, DW_AT_TI_symbol_name("_GPIO15")
     362                      .dwattr $C$DW$30, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x02)
     363                      .dwattr $C$DW$30, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:04 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0323210                           PAGE    8

     364                      .dwattr $C$DW$30, DW_AT_accessibility(DW_ACCESS_public)
     365                      .dwendtag $C$DW$T$20
     366              
     367              
     368              $C$DW$T$22      .dwtag  DW_TAG_union_type
     369                      .dwattr $C$DW$T$22, DW_AT_name("GPA1_REG")
     370                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x02)
     371              $C$DW$31        .dwtag  DW_TAG_member
     372                      .dwattr $C$DW$31, DW_AT_type(*$C$DW$T$21)
     373                      .dwattr $C$DW$31, DW_AT_name("all")
     374                      .dwattr $C$DW$31, DW_AT_TI_symbol_name("_all")
     375                      .dwattr $C$DW$31, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     376                      .dwattr $C$DW$31, DW_AT_accessibility(DW_ACCESS_public)
     377              $C$DW$32        .dwtag  DW_TAG_member
     378                      .dwattr $C$DW$32, DW_AT_type(*$C$DW$T$20)
     379                      .dwattr $C$DW$32, DW_AT_name("bit")
     380                      .dwattr $C$DW$32, DW_AT_TI_symbol_name("_bit")
     381                      .dwattr $C$DW$32, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     382                      .dwattr $C$DW$32, DW_AT_accessibility(DW_ACCESS_public)
     383                      .dwendtag $C$DW$T$22
     384              
     385              
     386              $C$DW$T$23      .dwtag  DW_TAG_structure_type
     387                      .dwattr $C$DW$T$23, DW_AT_name("GPA2_BITS")
     388                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x02)
     389              $C$DW$33        .dwtag  DW_TAG_member
     390                      .dwattr $C$DW$33, DW_AT_type(*$C$DW$T$19)
     391                      .dwattr $C$DW$33, DW_AT_name("GPIO16")
     392                      .dwattr $C$DW$33, DW_AT_TI_symbol_name("_GPIO16")
     393                      .dwattr $C$DW$33, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x02)
     394                      .dwattr $C$DW$33, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     395                      .dwattr $C$DW$33, DW_AT_accessibility(DW_ACCESS_public)
     396              $C$DW$34        .dwtag  DW_TAG_member
     397                      .dwattr $C$DW$34, DW_AT_type(*$C$DW$T$19)
     398                      .dwattr $C$DW$34, DW_AT_name("GPIO17")
     399                      .dwattr $C$DW$34, DW_AT_TI_symbol_name("_GPIO17")
     400                      .dwattr $C$DW$34, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x02)
     401                      .dwattr $C$DW$34, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     402                      .dwattr $C$DW$34, DW_AT_accessibility(DW_ACCESS_public)
     403              $C$DW$35        .dwtag  DW_TAG_member
     404                      .dwattr $C$DW$35, DW_AT_type(*$C$DW$T$19)
     405                      .dwattr $C$DW$35, DW_AT_name("GPIO18")
     406                      .dwattr $C$DW$35, DW_AT_TI_symbol_name("_GPIO18")
     407                      .dwattr $C$DW$35, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x02)
     408                      .dwattr $C$DW$35, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     409                      .dwattr $C$DW$35, DW_AT_accessibility(DW_ACCESS_public)
     410              $C$DW$36        .dwtag  DW_TAG_member
     411                      .dwattr $C$DW$36, DW_AT_type(*$C$DW$T$19)
     412                      .dwattr $C$DW$36, DW_AT_name("GPIO19")
     413                      .dwattr $C$DW$36, DW_AT_TI_symbol_name("_GPIO19")
     414                      .dwattr $C$DW$36, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x02)
     415                      .dwattr $C$DW$36, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     416                      .dwattr $C$DW$36, DW_AT_accessibility(DW_ACCESS_public)
     417              $C$DW$37        .dwtag  DW_TAG_member
     418                      .dwattr $C$DW$37, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:04 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0323210                           PAGE    9

     419                      .dwattr $C$DW$37, DW_AT_name("GPIO20")
     420                      .dwattr $C$DW$37, DW_AT_TI_symbol_name("_GPIO20")
     421                      .dwattr $C$DW$37, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x02)
     422                      .dwattr $C$DW$37, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     423                      .dwattr $C$DW$37, DW_AT_accessibility(DW_ACCESS_public)
     424              $C$DW$38        .dwtag  DW_TAG_member
     425                      .dwattr $C$DW$38, DW_AT_type(*$C$DW$T$19)
     426                      .dwattr $C$DW$38, DW_AT_name("GPIO21")
     427                      .dwattr $C$DW$38, DW_AT_TI_symbol_name("_GPIO21")
     428                      .dwattr $C$DW$38, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x02)
     429                      .dwattr $C$DW$38, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     430                      .dwattr $C$DW$38, DW_AT_accessibility(DW_ACCESS_public)
     431              $C$DW$39        .dwtag  DW_TAG_member
     432                      .dwattr $C$DW$39, DW_AT_type(*$C$DW$T$19)
     433                      .dwattr $C$DW$39, DW_AT_name("GPIO22")
     434                      .dwattr $C$DW$39, DW_AT_TI_symbol_name("_GPIO22")
     435                      .dwattr $C$DW$39, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x02)
     436                      .dwattr $C$DW$39, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     437                      .dwattr $C$DW$39, DW_AT_accessibility(DW_ACCESS_public)
     438              $C$DW$40        .dwtag  DW_TAG_member
     439                      .dwattr $C$DW$40, DW_AT_type(*$C$DW$T$19)
     440                      .dwattr $C$DW$40, DW_AT_name("GPIO23")
     441                      .dwattr $C$DW$40, DW_AT_TI_symbol_name("_GPIO23")
     442                      .dwattr $C$DW$40, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x02)
     443                      .dwattr $C$DW$40, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     444                      .dwattr $C$DW$40, DW_AT_accessibility(DW_ACCESS_public)
     445              $C$DW$41        .dwtag  DW_TAG_member
     446                      .dwattr $C$DW$41, DW_AT_type(*$C$DW$T$19)
     447                      .dwattr $C$DW$41, DW_AT_name("GPIO24")
     448                      .dwattr $C$DW$41, DW_AT_TI_symbol_name("_GPIO24")
     449                      .dwattr $C$DW$41, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x02)
     450                      .dwattr $C$DW$41, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     451                      .dwattr $C$DW$41, DW_AT_accessibility(DW_ACCESS_public)
     452              $C$DW$42        .dwtag  DW_TAG_member
     453                      .dwattr $C$DW$42, DW_AT_type(*$C$DW$T$19)
     454                      .dwattr $C$DW$42, DW_AT_name("GPIO25")
     455                      .dwattr $C$DW$42, DW_AT_TI_symbol_name("_GPIO25")
     456                      .dwattr $C$DW$42, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x02)
     457                      .dwattr $C$DW$42, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     458                      .dwattr $C$DW$42, DW_AT_accessibility(DW_ACCESS_public)
     459              $C$DW$43        .dwtag  DW_TAG_member
     460                      .dwattr $C$DW$43, DW_AT_type(*$C$DW$T$19)
     461                      .dwattr $C$DW$43, DW_AT_name("GPIO26")
     462                      .dwattr $C$DW$43, DW_AT_TI_symbol_name("_GPIO26")
     463                      .dwattr $C$DW$43, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x02)
     464                      .dwattr $C$DW$43, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     465                      .dwattr $C$DW$43, DW_AT_accessibility(DW_ACCESS_public)
     466              $C$DW$44        .dwtag  DW_TAG_member
     467                      .dwattr $C$DW$44, DW_AT_type(*$C$DW$T$19)
     468                      .dwattr $C$DW$44, DW_AT_name("GPIO27")
     469                      .dwattr $C$DW$44, DW_AT_TI_symbol_name("_GPIO27")
     470                      .dwattr $C$DW$44, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x02)
     471                      .dwattr $C$DW$44, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     472                      .dwattr $C$DW$44, DW_AT_accessibility(DW_ACCESS_public)
     473              $C$DW$45        .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:04 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0323210                           PAGE   10

     474                      .dwattr $C$DW$45, DW_AT_type(*$C$DW$T$19)
     475                      .dwattr $C$DW$45, DW_AT_name("GPIO28")
     476                      .dwattr $C$DW$45, DW_AT_TI_symbol_name("_GPIO28")
     477                      .dwattr $C$DW$45, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x02)
     478                      .dwattr $C$DW$45, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     479                      .dwattr $C$DW$45, DW_AT_accessibility(DW_ACCESS_public)
     480              $C$DW$46        .dwtag  DW_TAG_member
     481                      .dwattr $C$DW$46, DW_AT_type(*$C$DW$T$19)
     482                      .dwattr $C$DW$46, DW_AT_name("GPIO29")
     483                      .dwattr $C$DW$46, DW_AT_TI_symbol_name("_GPIO29")
     484                      .dwattr $C$DW$46, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x02)
     485                      .dwattr $C$DW$46, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     486                      .dwattr $C$DW$46, DW_AT_accessibility(DW_ACCESS_public)
     487              $C$DW$47        .dwtag  DW_TAG_member
     488                      .dwattr $C$DW$47, DW_AT_type(*$C$DW$T$19)
     489                      .dwattr $C$DW$47, DW_AT_name("GPIO30")
     490                      .dwattr $C$DW$47, DW_AT_TI_symbol_name("_GPIO30")
     491                      .dwattr $C$DW$47, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x02)
     492                      .dwattr $C$DW$47, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     493                      .dwattr $C$DW$47, DW_AT_accessibility(DW_ACCESS_public)
     494              $C$DW$48        .dwtag  DW_TAG_member
     495                      .dwattr $C$DW$48, DW_AT_type(*$C$DW$T$19)
     496                      .dwattr $C$DW$48, DW_AT_name("GPIO31")
     497                      .dwattr $C$DW$48, DW_AT_TI_symbol_name("_GPIO31")
     498                      .dwattr $C$DW$48, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x02)
     499                      .dwattr $C$DW$48, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     500                      .dwattr $C$DW$48, DW_AT_accessibility(DW_ACCESS_public)
     501                      .dwendtag $C$DW$T$23
     502              
     503              
     504              $C$DW$T$24      .dwtag  DW_TAG_union_type
     505                      .dwattr $C$DW$T$24, DW_AT_name("GPA2_REG")
     506                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x02)
     507              $C$DW$49        .dwtag  DW_TAG_member
     508                      .dwattr $C$DW$49, DW_AT_type(*$C$DW$T$21)
     509                      .dwattr $C$DW$49, DW_AT_name("all")
     510                      .dwattr $C$DW$49, DW_AT_TI_symbol_name("_all")
     511                      .dwattr $C$DW$49, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     512                      .dwattr $C$DW$49, DW_AT_accessibility(DW_ACCESS_public)
     513              $C$DW$50        .dwtag  DW_TAG_member
     514                      .dwattr $C$DW$50, DW_AT_type(*$C$DW$T$23)
     515                      .dwattr $C$DW$50, DW_AT_name("bit")
     516                      .dwattr $C$DW$50, DW_AT_TI_symbol_name("_bit")
     517                      .dwattr $C$DW$50, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     518                      .dwattr $C$DW$50, DW_AT_accessibility(DW_ACCESS_public)
     519                      .dwendtag $C$DW$T$24
     520              
     521              
     522              $C$DW$T$25      .dwtag  DW_TAG_structure_type
     523                      .dwattr $C$DW$T$25, DW_AT_name("GPACTRL_BITS")
     524                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x02)
     525              $C$DW$51        .dwtag  DW_TAG_member
     526                      .dwattr $C$DW$51, DW_AT_type(*$C$DW$T$19)
     527                      .dwattr $C$DW$51, DW_AT_name("QUALPRD0")
     528                      .dwattr $C$DW$51, DW_AT_TI_symbol_name("_QUALPRD0")
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:04 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0323210                           PAGE   11

     529                      .dwattr $C$DW$51, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x08)
     530                      .dwattr $C$DW$51, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     531                      .dwattr $C$DW$51, DW_AT_accessibility(DW_ACCESS_public)
     532              $C$DW$52        .dwtag  DW_TAG_member
     533                      .dwattr $C$DW$52, DW_AT_type(*$C$DW$T$19)
     534                      .dwattr $C$DW$52, DW_AT_name("QUALPRD1")
     535                      .dwattr $C$DW$52, DW_AT_TI_symbol_name("_QUALPRD1")
     536                      .dwattr $C$DW$52, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x08)
     537                      .dwattr $C$DW$52, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     538                      .dwattr $C$DW$52, DW_AT_accessibility(DW_ACCESS_public)
     539              $C$DW$53        .dwtag  DW_TAG_member
     540                      .dwattr $C$DW$53, DW_AT_type(*$C$DW$T$19)
     541                      .dwattr $C$DW$53, DW_AT_name("QUALPRD2")
     542                      .dwattr $C$DW$53, DW_AT_TI_symbol_name("_QUALPRD2")
     543                      .dwattr $C$DW$53, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x08)
     544                      .dwattr $C$DW$53, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     545                      .dwattr $C$DW$53, DW_AT_accessibility(DW_ACCESS_public)
     546              $C$DW$54        .dwtag  DW_TAG_member
     547                      .dwattr $C$DW$54, DW_AT_type(*$C$DW$T$19)
     548                      .dwattr $C$DW$54, DW_AT_name("QUALPRD3")
     549                      .dwattr $C$DW$54, DW_AT_TI_symbol_name("_QUALPRD3")
     550                      .dwattr $C$DW$54, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x08)
     551                      .dwattr $C$DW$54, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     552                      .dwattr $C$DW$54, DW_AT_accessibility(DW_ACCESS_public)
     553                      .dwendtag $C$DW$T$25
     554              
     555              
     556              $C$DW$T$26      .dwtag  DW_TAG_union_type
     557                      .dwattr $C$DW$T$26, DW_AT_name("GPACTRL_REG")
     558                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x02)
     559              $C$DW$55        .dwtag  DW_TAG_member
     560                      .dwattr $C$DW$55, DW_AT_type(*$C$DW$T$21)
     561                      .dwattr $C$DW$55, DW_AT_name("all")
     562                      .dwattr $C$DW$55, DW_AT_TI_symbol_name("_all")
     563                      .dwattr $C$DW$55, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     564                      .dwattr $C$DW$55, DW_AT_accessibility(DW_ACCESS_public)
     565              $C$DW$56        .dwtag  DW_TAG_member
     566                      .dwattr $C$DW$56, DW_AT_type(*$C$DW$T$25)
     567                      .dwattr $C$DW$56, DW_AT_name("bit")
     568                      .dwattr $C$DW$56, DW_AT_TI_symbol_name("_bit")
     569                      .dwattr $C$DW$56, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     570                      .dwattr $C$DW$56, DW_AT_accessibility(DW_ACCESS_public)
     571                      .dwendtag $C$DW$T$26
     572              
     573              
     574              $C$DW$T$27      .dwtag  DW_TAG_structure_type
     575                      .dwattr $C$DW$T$27, DW_AT_name("GPADAT_BITS")
     576                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x02)
     577              $C$DW$57        .dwtag  DW_TAG_member
     578                      .dwattr $C$DW$57, DW_AT_type(*$C$DW$T$19)
     579                      .dwattr $C$DW$57, DW_AT_name("GPIO0")
     580                      .dwattr $C$DW$57, DW_AT_TI_symbol_name("_GPIO0")
     581                      .dwattr $C$DW$57, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
     582                      .dwattr $C$DW$57, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     583                      .dwattr $C$DW$57, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:04 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0323210                           PAGE   12

     584              $C$DW$58        .dwtag  DW_TAG_member
     585                      .dwattr $C$DW$58, DW_AT_type(*$C$DW$T$19)
     586                      .dwattr $C$DW$58, DW_AT_name("GPIO1")
     587                      .dwattr $C$DW$58, DW_AT_TI_symbol_name("_GPIO1")
     588                      .dwattr $C$DW$58, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
     589                      .dwattr $C$DW$58, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     590                      .dwattr $C$DW$58, DW_AT_accessibility(DW_ACCESS_public)
     591              $C$DW$59        .dwtag  DW_TAG_member
     592                      .dwattr $C$DW$59, DW_AT_type(*$C$DW$T$19)
     593                      .dwattr $C$DW$59, DW_AT_name("GPIO2")
     594                      .dwattr $C$DW$59, DW_AT_TI_symbol_name("_GPIO2")
     595                      .dwattr $C$DW$59, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
     596                      .dwattr $C$DW$59, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     597                      .dwattr $C$DW$59, DW_AT_accessibility(DW_ACCESS_public)
     598              $C$DW$60        .dwtag  DW_TAG_member
     599                      .dwattr $C$DW$60, DW_AT_type(*$C$DW$T$19)
     600                      .dwattr $C$DW$60, DW_AT_name("GPIO3")
     601                      .dwattr $C$DW$60, DW_AT_TI_symbol_name("_GPIO3")
     602                      .dwattr $C$DW$60, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
     603                      .dwattr $C$DW$60, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     604                      .dwattr $C$DW$60, DW_AT_accessibility(DW_ACCESS_public)
     605              $C$DW$61        .dwtag  DW_TAG_member
     606                      .dwattr $C$DW$61, DW_AT_type(*$C$DW$T$19)
     607                      .dwattr $C$DW$61, DW_AT_name("GPIO4")
     608                      .dwattr $C$DW$61, DW_AT_TI_symbol_name("_GPIO4")
     609                      .dwattr $C$DW$61, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
     610                      .dwattr $C$DW$61, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     611                      .dwattr $C$DW$61, DW_AT_accessibility(DW_ACCESS_public)
     612              $C$DW$62        .dwtag  DW_TAG_member
     613                      .dwattr $C$DW$62, DW_AT_type(*$C$DW$T$19)
     614                      .dwattr $C$DW$62, DW_AT_name("GPIO5")
     615                      .dwattr $C$DW$62, DW_AT_TI_symbol_name("_GPIO5")
     616                      .dwattr $C$DW$62, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
     617                      .dwattr $C$DW$62, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     618                      .dwattr $C$DW$62, DW_AT_accessibility(DW_ACCESS_public)
     619              $C$DW$63        .dwtag  DW_TAG_member
     620                      .dwattr $C$DW$63, DW_AT_type(*$C$DW$T$19)
     621                      .dwattr $C$DW$63, DW_AT_name("GPIO6")
     622                      .dwattr $C$DW$63, DW_AT_TI_symbol_name("_GPIO6")
     623                      .dwattr $C$DW$63, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
     624                      .dwattr $C$DW$63, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     625                      .dwattr $C$DW$63, DW_AT_accessibility(DW_ACCESS_public)
     626              $C$DW$64        .dwtag  DW_TAG_member
     627                      .dwattr $C$DW$64, DW_AT_type(*$C$DW$T$19)
     628                      .dwattr $C$DW$64, DW_AT_name("GPIO7")
     629                      .dwattr $C$DW$64, DW_AT_TI_symbol_name("_GPIO7")
     630                      .dwattr $C$DW$64, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
     631                      .dwattr $C$DW$64, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     632                      .dwattr $C$DW$64, DW_AT_accessibility(DW_ACCESS_public)
     633              $C$DW$65        .dwtag  DW_TAG_member
     634                      .dwattr $C$DW$65, DW_AT_type(*$C$DW$T$19)
     635                      .dwattr $C$DW$65, DW_AT_name("GPIO8")
     636                      .dwattr $C$DW$65, DW_AT_TI_symbol_name("_GPIO8")
     637                      .dwattr $C$DW$65, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
     638                      .dwattr $C$DW$65, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:04 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0323210                           PAGE   13

     639                      .dwattr $C$DW$65, DW_AT_accessibility(DW_ACCESS_public)
     640              $C$DW$66        .dwtag  DW_TAG_member
     641                      .dwattr $C$DW$66, DW_AT_type(*$C$DW$T$19)
     642                      .dwattr $C$DW$66, DW_AT_name("GPIO9")
     643                      .dwattr $C$DW$66, DW_AT_TI_symbol_name("_GPIO9")
     644                      .dwattr $C$DW$66, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
     645                      .dwattr $C$DW$66, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     646                      .dwattr $C$DW$66, DW_AT_accessibility(DW_ACCESS_public)
     647              $C$DW$67        .dwtag  DW_TAG_member
     648                      .dwattr $C$DW$67, DW_AT_type(*$C$DW$T$19)
     649                      .dwattr $C$DW$67, DW_AT_name("GPIO10")
     650                      .dwattr $C$DW$67, DW_AT_TI_symbol_name("_GPIO10")
     651                      .dwattr $C$DW$67, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
     652                      .dwattr $C$DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     653                      .dwattr $C$DW$67, DW_AT_accessibility(DW_ACCESS_public)
     654              $C$DW$68        .dwtag  DW_TAG_member
     655                      .dwattr $C$DW$68, DW_AT_type(*$C$DW$T$19)
     656                      .dwattr $C$DW$68, DW_AT_name("GPIO11")
     657                      .dwattr $C$DW$68, DW_AT_TI_symbol_name("_GPIO11")
     658                      .dwattr $C$DW$68, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
     659                      .dwattr $C$DW$68, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     660                      .dwattr $C$DW$68, DW_AT_accessibility(DW_ACCESS_public)
     661              $C$DW$69        .dwtag  DW_TAG_member
     662                      .dwattr $C$DW$69, DW_AT_type(*$C$DW$T$19)
     663                      .dwattr $C$DW$69, DW_AT_name("GPIO12")
     664                      .dwattr $C$DW$69, DW_AT_TI_symbol_name("_GPIO12")
     665                      .dwattr $C$DW$69, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
     666                      .dwattr $C$DW$69, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     667                      .dwattr $C$DW$69, DW_AT_accessibility(DW_ACCESS_public)
     668              $C$DW$70        .dwtag  DW_TAG_member
     669                      .dwattr $C$DW$70, DW_AT_type(*$C$DW$T$19)
     670                      .dwattr $C$DW$70, DW_AT_name("GPIO13")
     671                      .dwattr $C$DW$70, DW_AT_TI_symbol_name("_GPIO13")
     672                      .dwattr $C$DW$70, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
     673                      .dwattr $C$DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     674                      .dwattr $C$DW$70, DW_AT_accessibility(DW_ACCESS_public)
     675              $C$DW$71        .dwtag  DW_TAG_member
     676                      .dwattr $C$DW$71, DW_AT_type(*$C$DW$T$19)
     677                      .dwattr $C$DW$71, DW_AT_name("GPIO14")
     678                      .dwattr $C$DW$71, DW_AT_TI_symbol_name("_GPIO14")
     679                      .dwattr $C$DW$71, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
     680                      .dwattr $C$DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     681                      .dwattr $C$DW$71, DW_AT_accessibility(DW_ACCESS_public)
     682              $C$DW$72        .dwtag  DW_TAG_member
     683                      .dwattr $C$DW$72, DW_AT_type(*$C$DW$T$19)
     684                      .dwattr $C$DW$72, DW_AT_name("GPIO15")
     685                      .dwattr $C$DW$72, DW_AT_TI_symbol_name("_GPIO15")
     686                      .dwattr $C$DW$72, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
     687                      .dwattr $C$DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     688                      .dwattr $C$DW$72, DW_AT_accessibility(DW_ACCESS_public)
     689              $C$DW$73        .dwtag  DW_TAG_member
     690                      .dwattr $C$DW$73, DW_AT_type(*$C$DW$T$19)
     691                      .dwattr $C$DW$73, DW_AT_name("GPIO16")
     692                      .dwattr $C$DW$73, DW_AT_TI_symbol_name("_GPIO16")
     693                      .dwattr $C$DW$73, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:04 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0323210                           PAGE   14

     694                      .dwattr $C$DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     695                      .dwattr $C$DW$73, DW_AT_accessibility(DW_ACCESS_public)
     696              $C$DW$74        .dwtag  DW_TAG_member
     697                      .dwattr $C$DW$74, DW_AT_type(*$C$DW$T$19)
     698                      .dwattr $C$DW$74, DW_AT_name("GPIO17")
     699                      .dwattr $C$DW$74, DW_AT_TI_symbol_name("_GPIO17")
     700                      .dwattr $C$DW$74, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
     701                      .dwattr $C$DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     702                      .dwattr $C$DW$74, DW_AT_accessibility(DW_ACCESS_public)
     703              $C$DW$75        .dwtag  DW_TAG_member
     704                      .dwattr $C$DW$75, DW_AT_type(*$C$DW$T$19)
     705                      .dwattr $C$DW$75, DW_AT_name("GPIO18")
     706                      .dwattr $C$DW$75, DW_AT_TI_symbol_name("_GPIO18")
     707                      .dwattr $C$DW$75, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
     708                      .dwattr $C$DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     709                      .dwattr $C$DW$75, DW_AT_accessibility(DW_ACCESS_public)
     710              $C$DW$76        .dwtag  DW_TAG_member
     711                      .dwattr $C$DW$76, DW_AT_type(*$C$DW$T$19)
     712                      .dwattr $C$DW$76, DW_AT_name("GPIO19")
     713                      .dwattr $C$DW$76, DW_AT_TI_symbol_name("_GPIO19")
     714                      .dwattr $C$DW$76, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
     715                      .dwattr $C$DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     716                      .dwattr $C$DW$76, DW_AT_accessibility(DW_ACCESS_public)
     717              $C$DW$77        .dwtag  DW_TAG_member
     718                      .dwattr $C$DW$77, DW_AT_type(*$C$DW$T$19)
     719                      .dwattr $C$DW$77, DW_AT_name("GPIO20")
     720                      .dwattr $C$DW$77, DW_AT_TI_symbol_name("_GPIO20")
     721                      .dwattr $C$DW$77, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
     722                      .dwattr $C$DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     723                      .dwattr $C$DW$77, DW_AT_accessibility(DW_ACCESS_public)
     724              $C$DW$78        .dwtag  DW_TAG_member
     725                      .dwattr $C$DW$78, DW_AT_type(*$C$DW$T$19)
     726                      .dwattr $C$DW$78, DW_AT_name("GPIO21")
     727                      .dwattr $C$DW$78, DW_AT_TI_symbol_name("_GPIO21")
     728                      .dwattr $C$DW$78, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
     729                      .dwattr $C$DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     730                      .dwattr $C$DW$78, DW_AT_accessibility(DW_ACCESS_public)
     731              $C$DW$79        .dwtag  DW_TAG_member
     732                      .dwattr $C$DW$79, DW_AT_type(*$C$DW$T$19)
     733                      .dwattr $C$DW$79, DW_AT_name("GPIO22")
     734                      .dwattr $C$DW$79, DW_AT_TI_symbol_name("_GPIO22")
     735                      .dwattr $C$DW$79, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
     736                      .dwattr $C$DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     737                      .dwattr $C$DW$79, DW_AT_accessibility(DW_ACCESS_public)
     738              $C$DW$80        .dwtag  DW_TAG_member
     739                      .dwattr $C$DW$80, DW_AT_type(*$C$DW$T$19)
     740                      .dwattr $C$DW$80, DW_AT_name("GPIO23")
     741                      .dwattr $C$DW$80, DW_AT_TI_symbol_name("_GPIO23")
     742                      .dwattr $C$DW$80, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
     743                      .dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     744                      .dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
     745              $C$DW$81        .dwtag  DW_TAG_member
     746                      .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$19)
     747                      .dwattr $C$DW$81, DW_AT_name("GPIO24")
     748                      .dwattr $C$DW$81, DW_AT_TI_symbol_name("_GPIO24")
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:04 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0323210                           PAGE   15

     749                      .dwattr $C$DW$81, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
     750                      .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     751                      .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
     752              $C$DW$82        .dwtag  DW_TAG_member
     753                      .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$19)
     754                      .dwattr $C$DW$82, DW_AT_name("GPIO25")
     755                      .dwattr $C$DW$82, DW_AT_TI_symbol_name("_GPIO25")
     756                      .dwattr $C$DW$82, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
     757                      .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     758                      .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
     759              $C$DW$83        .dwtag  DW_TAG_member
     760                      .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$19)
     761                      .dwattr $C$DW$83, DW_AT_name("GPIO26")
     762                      .dwattr $C$DW$83, DW_AT_TI_symbol_name("_GPIO26")
     763                      .dwattr $C$DW$83, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
     764                      .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     765                      .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
     766              $C$DW$84        .dwtag  DW_TAG_member
     767                      .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$19)
     768                      .dwattr $C$DW$84, DW_AT_name("GPIO27")
     769                      .dwattr $C$DW$84, DW_AT_TI_symbol_name("_GPIO27")
     770                      .dwattr $C$DW$84, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
     771                      .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     772                      .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
     773              $C$DW$85        .dwtag  DW_TAG_member
     774                      .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$19)
     775                      .dwattr $C$DW$85, DW_AT_name("GPIO28")
     776                      .dwattr $C$DW$85, DW_AT_TI_symbol_name("_GPIO28")
     777                      .dwattr $C$DW$85, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
     778                      .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     779                      .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
     780              $C$DW$86        .dwtag  DW_TAG_member
     781                      .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$19)
     782                      .dwattr $C$DW$86, DW_AT_name("GPIO29")
     783                      .dwattr $C$DW$86, DW_AT_TI_symbol_name("_GPIO29")
     784                      .dwattr $C$DW$86, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
     785                      .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     786                      .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
     787              $C$DW$87        .dwtag  DW_TAG_member
     788                      .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$19)
     789                      .dwattr $C$DW$87, DW_AT_name("GPIO30")
     790                      .dwattr $C$DW$87, DW_AT_TI_symbol_name("_GPIO30")
     791                      .dwattr $C$DW$87, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
     792                      .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     793                      .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
     794              $C$DW$88        .dwtag  DW_TAG_member
     795                      .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$19)
     796                      .dwattr $C$DW$88, DW_AT_name("GPIO31")
     797                      .dwattr $C$DW$88, DW_AT_TI_symbol_name("_GPIO31")
     798                      .dwattr $C$DW$88, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
     799                      .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     800                      .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
     801                      .dwendtag $C$DW$T$27
     802              
     803              
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:04 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0323210                           PAGE   16

     804              $C$DW$T$28      .dwtag  DW_TAG_union_type
     805                      .dwattr $C$DW$T$28, DW_AT_name("GPADAT_REG")
     806                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x02)
     807              $C$DW$89        .dwtag  DW_TAG_member
     808                      .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$21)
     809                      .dwattr $C$DW$89, DW_AT_name("all")
     810                      .dwattr $C$DW$89, DW_AT_TI_symbol_name("_all")
     811                      .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     812                      .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
     813              $C$DW$90        .dwtag  DW_TAG_member
     814                      .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$27)
     815                      .dwattr $C$DW$90, DW_AT_name("bit")
     816                      .dwattr $C$DW$90, DW_AT_TI_symbol_name("_bit")
     817                      .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     818                      .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
     819                      .dwendtag $C$DW$T$28
     820              
     821              
     822              $C$DW$T$29      .dwtag  DW_TAG_structure_type
     823                      .dwattr $C$DW$T$29, DW_AT_name("GPB1_BITS")
     824                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x02)
     825              $C$DW$91        .dwtag  DW_TAG_member
     826                      .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$19)
     827                      .dwattr $C$DW$91, DW_AT_name("GPIO32")
     828                      .dwattr $C$DW$91, DW_AT_TI_symbol_name("_GPIO32")
     829                      .dwattr $C$DW$91, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x02)
     830                      .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     831                      .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
     832              $C$DW$92        .dwtag  DW_TAG_member
     833                      .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$19)
     834                      .dwattr $C$DW$92, DW_AT_name("GPIO33")
     835                      .dwattr $C$DW$92, DW_AT_TI_symbol_name("_GPIO33")
     836                      .dwattr $C$DW$92, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x02)
     837                      .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     838                      .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
     839              $C$DW$93        .dwtag  DW_TAG_member
     840                      .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$19)
     841                      .dwattr $C$DW$93, DW_AT_name("GPIO34")
     842                      .dwattr $C$DW$93, DW_AT_TI_symbol_name("_GPIO34")
     843                      .dwattr $C$DW$93, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x02)
     844                      .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     845                      .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
     846              $C$DW$94        .dwtag  DW_TAG_member
     847                      .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$19)
     848                      .dwattr $C$DW$94, DW_AT_name("GPIO35")
     849                      .dwattr $C$DW$94, DW_AT_TI_symbol_name("_GPIO35")
     850                      .dwattr $C$DW$94, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x02)
     851                      .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     852                      .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
     853              $C$DW$95        .dwtag  DW_TAG_member
     854                      .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$19)
     855                      .dwattr $C$DW$95, DW_AT_name("GPIO36")
     856                      .dwattr $C$DW$95, DW_AT_TI_symbol_name("_GPIO36")
     857                      .dwattr $C$DW$95, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x02)
     858                      .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:04 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0323210                           PAGE   17

     859                      .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
     860              $C$DW$96        .dwtag  DW_TAG_member
     861                      .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$19)
     862                      .dwattr $C$DW$96, DW_AT_name("GPIO37")
     863                      .dwattr $C$DW$96, DW_AT_TI_symbol_name("_GPIO37")
     864                      .dwattr $C$DW$96, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x02)
     865                      .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     866                      .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
     867              $C$DW$97        .dwtag  DW_TAG_member
     868                      .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$19)
     869                      .dwattr $C$DW$97, DW_AT_name("GPIO38")
     870                      .dwattr $C$DW$97, DW_AT_TI_symbol_name("_GPIO38")
     871                      .dwattr $C$DW$97, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x02)
     872                      .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     873                      .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
     874              $C$DW$98        .dwtag  DW_TAG_member
     875                      .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$19)
     876                      .dwattr $C$DW$98, DW_AT_name("GPIO39")
     877                      .dwattr $C$DW$98, DW_AT_TI_symbol_name("_GPIO39")
     878                      .dwattr $C$DW$98, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x02)
     879                      .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     880                      .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
     881              $C$DW$99        .dwtag  DW_TAG_member
     882                      .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$19)
     883                      .dwattr $C$DW$99, DW_AT_name("GPIO40")
     884                      .dwattr $C$DW$99, DW_AT_TI_symbol_name("_GPIO40")
     885                      .dwattr $C$DW$99, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x02)
     886                      .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     887                      .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
     888              $C$DW$100       .dwtag  DW_TAG_member
     889                      .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$19)
     890                      .dwattr $C$DW$100, DW_AT_name("GPIO41")
     891                      .dwattr $C$DW$100, DW_AT_TI_symbol_name("_GPIO41")
     892                      .dwattr $C$DW$100, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x02)
     893                      .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     894                      .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
     895              $C$DW$101       .dwtag  DW_TAG_member
     896                      .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$19)
     897                      .dwattr $C$DW$101, DW_AT_name("GPIO42")
     898                      .dwattr $C$DW$101, DW_AT_TI_symbol_name("_GPIO42")
     899                      .dwattr $C$DW$101, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x02)
     900                      .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     901                      .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
     902              $C$DW$102       .dwtag  DW_TAG_member
     903                      .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$19)
     904                      .dwattr $C$DW$102, DW_AT_name("GPIO43")
     905                      .dwattr $C$DW$102, DW_AT_TI_symbol_name("_GPIO43")
     906                      .dwattr $C$DW$102, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x02)
     907                      .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     908                      .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
     909              $C$DW$103       .dwtag  DW_TAG_member
     910                      .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$19)
     911                      .dwattr $C$DW$103, DW_AT_name("GPIO44")
     912                      .dwattr $C$DW$103, DW_AT_TI_symbol_name("_GPIO44")
     913                      .dwattr $C$DW$103, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x02)
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:04 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0323210                           PAGE   18

     914                      .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     915                      .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
     916              $C$DW$104       .dwtag  DW_TAG_member
     917                      .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$19)
     918                      .dwattr $C$DW$104, DW_AT_name("GPIO45")
     919                      .dwattr $C$DW$104, DW_AT_TI_symbol_name("_GPIO45")
     920                      .dwattr $C$DW$104, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x02)
     921                      .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     922                      .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
     923              $C$DW$105       .dwtag  DW_TAG_member
     924                      .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$19)
     925                      .dwattr $C$DW$105, DW_AT_name("GPIO46")
     926                      .dwattr $C$DW$105, DW_AT_TI_symbol_name("_GPIO46")
     927                      .dwattr $C$DW$105, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x02)
     928                      .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     929                      .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
     930              $C$DW$106       .dwtag  DW_TAG_member
     931                      .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$19)
     932                      .dwattr $C$DW$106, DW_AT_name("GPIO47")
     933                      .dwattr $C$DW$106, DW_AT_TI_symbol_name("_GPIO47")
     934                      .dwattr $C$DW$106, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x02)
     935                      .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
     936                      .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
     937                      .dwendtag $C$DW$T$29
     938              
     939              
     940              $C$DW$T$30      .dwtag  DW_TAG_union_type
     941                      .dwattr $C$DW$T$30, DW_AT_name("GPB1_REG")
     942                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x02)
     943              $C$DW$107       .dwtag  DW_TAG_member
     944                      .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$21)
     945                      .dwattr $C$DW$107, DW_AT_name("all")
     946                      .dwattr $C$DW$107, DW_AT_TI_symbol_name("_all")
     947                      .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     948                      .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
     949              $C$DW$108       .dwtag  DW_TAG_member
     950                      .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$29)
     951                      .dwattr $C$DW$108, DW_AT_name("bit")
     952                      .dwattr $C$DW$108, DW_AT_TI_symbol_name("_bit")
     953                      .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     954                      .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
     955                      .dwendtag $C$DW$T$30
     956              
     957              
     958              $C$DW$T$31      .dwtag  DW_TAG_structure_type
     959                      .dwattr $C$DW$T$31, DW_AT_name("GPB2_BITS")
     960                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x02)
     961              $C$DW$109       .dwtag  DW_TAG_member
     962                      .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$19)
     963                      .dwattr $C$DW$109, DW_AT_name("GPIO48")
     964                      .dwattr $C$DW$109, DW_AT_TI_symbol_name("_GPIO48")
     965                      .dwattr $C$DW$109, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x02)
     966                      .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     967                      .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
     968              $C$DW$110       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:04 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0323210                           PAGE   19

     969                      .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$19)
     970                      .dwattr $C$DW$110, DW_AT_name("GPIO49")
     971                      .dwattr $C$DW$110, DW_AT_TI_symbol_name("_GPIO49")
     972                      .dwattr $C$DW$110, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x02)
     973                      .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     974                      .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
     975              $C$DW$111       .dwtag  DW_TAG_member
     976                      .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$19)
     977                      .dwattr $C$DW$111, DW_AT_name("GPIO50")
     978                      .dwattr $C$DW$111, DW_AT_TI_symbol_name("_GPIO50")
     979                      .dwattr $C$DW$111, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x02)
     980                      .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     981                      .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
     982              $C$DW$112       .dwtag  DW_TAG_member
     983                      .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$19)
     984                      .dwattr $C$DW$112, DW_AT_name("GPIO51")
     985                      .dwattr $C$DW$112, DW_AT_TI_symbol_name("_GPIO51")
     986                      .dwattr $C$DW$112, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x02)
     987                      .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     988                      .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
     989              $C$DW$113       .dwtag  DW_TAG_member
     990                      .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$19)
     991                      .dwattr $C$DW$113, DW_AT_name("GPIO52")
     992                      .dwattr $C$DW$113, DW_AT_TI_symbol_name("_GPIO52")
     993                      .dwattr $C$DW$113, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x02)
     994                      .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     995                      .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
     996              $C$DW$114       .dwtag  DW_TAG_member
     997                      .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$19)
     998                      .dwattr $C$DW$114, DW_AT_name("GPIO53")
     999                      .dwattr $C$DW$114, DW_AT_TI_symbol_name("_GPIO53")
    1000                      .dwattr $C$DW$114, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x02)
    1001                      .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1002                      .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    1003              $C$DW$115       .dwtag  DW_TAG_member
    1004                      .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$19)
    1005                      .dwattr $C$DW$115, DW_AT_name("GPIO54")
    1006                      .dwattr $C$DW$115, DW_AT_TI_symbol_name("_GPIO54")
    1007                      .dwattr $C$DW$115, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x02)
    1008                      .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1009                      .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    1010              $C$DW$116       .dwtag  DW_TAG_member
    1011                      .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$19)
    1012                      .dwattr $C$DW$116, DW_AT_name("GPIO55")
    1013                      .dwattr $C$DW$116, DW_AT_TI_symbol_name("_GPIO55")
    1014                      .dwattr $C$DW$116, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x02)
    1015                      .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1016                      .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    1017              $C$DW$117       .dwtag  DW_TAG_member
    1018                      .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$19)
    1019                      .dwattr $C$DW$117, DW_AT_name("GPIO56")
    1020                      .dwattr $C$DW$117, DW_AT_TI_symbol_name("_GPIO56")
    1021                      .dwattr $C$DW$117, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x02)
    1022                      .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1023                      .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:04 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0323210                           PAGE   20

    1024              $C$DW$118       .dwtag  DW_TAG_member
    1025                      .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$19)
    1026                      .dwattr $C$DW$118, DW_AT_name("GPIO57")
    1027                      .dwattr $C$DW$118, DW_AT_TI_symbol_name("_GPIO57")
    1028                      .dwattr $C$DW$118, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x02)
    1029                      .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1030                      .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    1031              $C$DW$119       .dwtag  DW_TAG_member
    1032                      .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$19)
    1033                      .dwattr $C$DW$119, DW_AT_name("GPIO58")
    1034                      .dwattr $C$DW$119, DW_AT_TI_symbol_name("_GPIO58")
    1035                      .dwattr $C$DW$119, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x02)
    1036                      .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1037                      .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    1038              $C$DW$120       .dwtag  DW_TAG_member
    1039                      .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$19)
    1040                      .dwattr $C$DW$120, DW_AT_name("GPIO59")
    1041                      .dwattr $C$DW$120, DW_AT_TI_symbol_name("_GPIO59")
    1042                      .dwattr $C$DW$120, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x02)
    1043                      .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1044                      .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    1045              $C$DW$121       .dwtag  DW_TAG_member
    1046                      .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$19)
    1047                      .dwattr $C$DW$121, DW_AT_name("GPIO60")
    1048                      .dwattr $C$DW$121, DW_AT_TI_symbol_name("_GPIO60")
    1049                      .dwattr $C$DW$121, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x02)
    1050                      .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1051                      .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    1052              $C$DW$122       .dwtag  DW_TAG_member
    1053                      .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$19)
    1054                      .dwattr $C$DW$122, DW_AT_name("GPIO61")
    1055                      .dwattr $C$DW$122, DW_AT_TI_symbol_name("_GPIO61")
    1056                      .dwattr $C$DW$122, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x02)
    1057                      .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1058                      .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    1059              $C$DW$123       .dwtag  DW_TAG_member
    1060                      .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$19)
    1061                      .dwattr $C$DW$123, DW_AT_name("GPIO62")
    1062                      .dwattr $C$DW$123, DW_AT_TI_symbol_name("_GPIO62")
    1063                      .dwattr $C$DW$123, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x02)
    1064                      .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1065                      .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    1066              $C$DW$124       .dwtag  DW_TAG_member
    1067                      .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$19)
    1068                      .dwattr $C$DW$124, DW_AT_name("GPIO63")
    1069                      .dwattr $C$DW$124, DW_AT_TI_symbol_name("_GPIO63")
    1070                      .dwattr $C$DW$124, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x02)
    1071                      .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1072                      .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    1073                      .dwendtag $C$DW$T$31
    1074              
    1075              
    1076              $C$DW$T$32      .dwtag  DW_TAG_union_type
    1077                      .dwattr $C$DW$T$32, DW_AT_name("GPB2_REG")
    1078                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x02)
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:04 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0323210                           PAGE   21

    1079              $C$DW$125       .dwtag  DW_TAG_member
    1080                      .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$21)
    1081                      .dwattr $C$DW$125, DW_AT_name("all")
    1082                      .dwattr $C$DW$125, DW_AT_TI_symbol_name("_all")
    1083                      .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1084                      .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    1085              $C$DW$126       .dwtag  DW_TAG_member
    1086                      .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$31)
    1087                      .dwattr $C$DW$126, DW_AT_name("bit")
    1088                      .dwattr $C$DW$126, DW_AT_TI_symbol_name("_bit")
    1089                      .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1090                      .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    1091                      .dwendtag $C$DW$T$32
    1092              
    1093              
    1094              $C$DW$T$33      .dwtag  DW_TAG_structure_type
    1095                      .dwattr $C$DW$T$33, DW_AT_name("GPBCTRL_BITS")
    1096                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x02)
    1097              $C$DW$127       .dwtag  DW_TAG_member
    1098                      .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$19)
    1099                      .dwattr $C$DW$127, DW_AT_name("QUALPRD0")
    1100                      .dwattr $C$DW$127, DW_AT_TI_symbol_name("_QUALPRD0")
    1101                      .dwattr $C$DW$127, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x08)
    1102                      .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1103                      .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    1104              $C$DW$128       .dwtag  DW_TAG_member
    1105                      .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$19)
    1106                      .dwattr $C$DW$128, DW_AT_name("QUALPRD1")
    1107                      .dwattr $C$DW$128, DW_AT_TI_symbol_name("_QUALPRD1")
    1108                      .dwattr $C$DW$128, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x08)
    1109                      .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1110                      .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    1111              $C$DW$129       .dwtag  DW_TAG_member
    1112                      .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$19)
    1113                      .dwattr $C$DW$129, DW_AT_name("QUALPRD2")
    1114                      .dwattr $C$DW$129, DW_AT_TI_symbol_name("_QUALPRD2")
    1115                      .dwattr $C$DW$129, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x08)
    1116                      .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1117                      .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    1118              $C$DW$130       .dwtag  DW_TAG_member
    1119                      .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$19)
    1120                      .dwattr $C$DW$130, DW_AT_name("QUALPRD3")
    1121                      .dwattr $C$DW$130, DW_AT_TI_symbol_name("_QUALPRD3")
    1122                      .dwattr $C$DW$130, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x08)
    1123                      .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1124                      .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    1125                      .dwendtag $C$DW$T$33
    1126              
    1127              
    1128              $C$DW$T$34      .dwtag  DW_TAG_union_type
    1129                      .dwattr $C$DW$T$34, DW_AT_name("GPBCTRL_REG")
    1130                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x02)
    1131              $C$DW$131       .dwtag  DW_TAG_member
    1132                      .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$21)
    1133                      .dwattr $C$DW$131, DW_AT_name("all")
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:04 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0323210                           PAGE   22

    1134                      .dwattr $C$DW$131, DW_AT_TI_symbol_name("_all")
    1135                      .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1136                      .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    1137              $C$DW$132       .dwtag  DW_TAG_member
    1138                      .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$33)
    1139                      .dwattr $C$DW$132, DW_AT_name("bit")
    1140                      .dwattr $C$DW$132, DW_AT_TI_symbol_name("_bit")
    1141                      .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1142                      .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    1143                      .dwendtag $C$DW$T$34
    1144              
    1145              
    1146              $C$DW$T$35      .dwtag  DW_TAG_structure_type
    1147                      .dwattr $C$DW$T$35, DW_AT_name("GPBDAT_BITS")
    1148                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x02)
    1149              $C$DW$133       .dwtag  DW_TAG_member
    1150                      .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$19)
    1151                      .dwattr $C$DW$133, DW_AT_name("GPIO32")
    1152                      .dwattr $C$DW$133, DW_AT_TI_symbol_name("_GPIO32")
    1153                      .dwattr $C$DW$133, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    1154                      .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1155                      .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    1156              $C$DW$134       .dwtag  DW_TAG_member
    1157                      .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$19)
    1158                      .dwattr $C$DW$134, DW_AT_name("GPIO33")
    1159                      .dwattr $C$DW$134, DW_AT_TI_symbol_name("_GPIO33")
    1160                      .dwattr $C$DW$134, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    1161                      .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1162                      .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    1163              $C$DW$135       .dwtag  DW_TAG_member
    1164                      .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$19)
    1165                      .dwattr $C$DW$135, DW_AT_name("GPIO34")
    1166                      .dwattr $C$DW$135, DW_AT_TI_symbol_name("_GPIO34")
    1167                      .dwattr $C$DW$135, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    1168                      .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1169                      .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    1170              $C$DW$136       .dwtag  DW_TAG_member
    1171                      .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$19)
    1172                      .dwattr $C$DW$136, DW_AT_name("GPIO35")
    1173                      .dwattr $C$DW$136, DW_AT_TI_symbol_name("_GPIO35")
    1174                      .dwattr $C$DW$136, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    1175                      .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1176                      .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    1177              $C$DW$137       .dwtag  DW_TAG_member
    1178                      .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$19)
    1179                      .dwattr $C$DW$137, DW_AT_name("GPIO36")
    1180                      .dwattr $C$DW$137, DW_AT_TI_symbol_name("_GPIO36")
    1181                      .dwattr $C$DW$137, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    1182                      .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1183                      .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    1184              $C$DW$138       .dwtag  DW_TAG_member
    1185                      .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$19)
    1186                      .dwattr $C$DW$138, DW_AT_name("GPIO37")
    1187                      .dwattr $C$DW$138, DW_AT_TI_symbol_name("_GPIO37")
    1188                      .dwattr $C$DW$138, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:04 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0323210                           PAGE   23

    1189                      .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1190                      .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    1191              $C$DW$139       .dwtag  DW_TAG_member
    1192                      .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$19)
    1193                      .dwattr $C$DW$139, DW_AT_name("GPIO38")
    1194                      .dwattr $C$DW$139, DW_AT_TI_symbol_name("_GPIO38")
    1195                      .dwattr $C$DW$139, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    1196                      .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1197                      .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    1198              $C$DW$140       .dwtag  DW_TAG_member
    1199                      .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$19)
    1200                      .dwattr $C$DW$140, DW_AT_name("GPIO39")
    1201                      .dwattr $C$DW$140, DW_AT_TI_symbol_name("_GPIO39")
    1202                      .dwattr $C$DW$140, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    1203                      .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1204                      .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    1205              $C$DW$141       .dwtag  DW_TAG_member
    1206                      .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$19)
    1207                      .dwattr $C$DW$141, DW_AT_name("GPIO40")
    1208                      .dwattr $C$DW$141, DW_AT_TI_symbol_name("_GPIO40")
    1209                      .dwattr $C$DW$141, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
    1210                      .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1211                      .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    1212              $C$DW$142       .dwtag  DW_TAG_member
    1213                      .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$19)
    1214                      .dwattr $C$DW$142, DW_AT_name("GPIO41")
    1215                      .dwattr $C$DW$142, DW_AT_TI_symbol_name("_GPIO41")
    1216                      .dwattr $C$DW$142, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    1217                      .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1218                      .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    1219              $C$DW$143       .dwtag  DW_TAG_member
    1220                      .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$19)
    1221                      .dwattr $C$DW$143, DW_AT_name("GPIO42")
    1222                      .dwattr $C$DW$143, DW_AT_TI_symbol_name("_GPIO42")
    1223                      .dwattr $C$DW$143, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
    1224                      .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1225                      .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    1226              $C$DW$144       .dwtag  DW_TAG_member
    1227                      .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$19)
    1228                      .dwattr $C$DW$144, DW_AT_name("GPIO43")
    1229                      .dwattr $C$DW$144, DW_AT_TI_symbol_name("_GPIO43")
    1230                      .dwattr $C$DW$144, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
    1231                      .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1232                      .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    1233              $C$DW$145       .dwtag  DW_TAG_member
    1234                      .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$19)
    1235                      .dwattr $C$DW$145, DW_AT_name("GPIO44")
    1236                      .dwattr $C$DW$145, DW_AT_TI_symbol_name("_GPIO44")
    1237                      .dwattr $C$DW$145, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
    1238                      .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1239                      .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    1240              $C$DW$146       .dwtag  DW_TAG_member
    1241                      .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$19)
    1242                      .dwattr $C$DW$146, DW_AT_name("GPIO45")
    1243                      .dwattr $C$DW$146, DW_AT_TI_symbol_name("_GPIO45")
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:04 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0323210                           PAGE   24

    1244                      .dwattr $C$DW$146, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
    1245                      .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1246                      .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
    1247              $C$DW$147       .dwtag  DW_TAG_member
    1248                      .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$19)
    1249                      .dwattr $C$DW$147, DW_AT_name("GPIO46")
    1250                      .dwattr $C$DW$147, DW_AT_TI_symbol_name("_GPIO46")
    1251                      .dwattr $C$DW$147, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
    1252                      .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1253                      .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
    1254              $C$DW$148       .dwtag  DW_TAG_member
    1255                      .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$19)
    1256                      .dwattr $C$DW$148, DW_AT_name("GPIO47")
    1257                      .dwattr $C$DW$148, DW_AT_TI_symbol_name("_GPIO47")
    1258                      .dwattr $C$DW$148, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    1259                      .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1260                      .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    1261              $C$DW$149       .dwtag  DW_TAG_member
    1262                      .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$19)
    1263                      .dwattr $C$DW$149, DW_AT_name("GPIO48")
    1264                      .dwattr $C$DW$149, DW_AT_TI_symbol_name("_GPIO48")
    1265                      .dwattr $C$DW$149, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    1266                      .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1267                      .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    1268              $C$DW$150       .dwtag  DW_TAG_member
    1269                      .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$19)
    1270                      .dwattr $C$DW$150, DW_AT_name("GPIO49")
    1271                      .dwattr $C$DW$150, DW_AT_TI_symbol_name("_GPIO49")
    1272                      .dwattr $C$DW$150, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    1273                      .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1274                      .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
    1275              $C$DW$151       .dwtag  DW_TAG_member
    1276                      .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$19)
    1277                      .dwattr $C$DW$151, DW_AT_name("GPIO50")
    1278                      .dwattr $C$DW$151, DW_AT_TI_symbol_name("_GPIO50")
    1279                      .dwattr $C$DW$151, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    1280                      .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1281                      .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    1282              $C$DW$152       .dwtag  DW_TAG_member
    1283                      .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$19)
    1284                      .dwattr $C$DW$152, DW_AT_name("GPIO51")
    1285                      .dwattr $C$DW$152, DW_AT_TI_symbol_name("_GPIO51")
    1286                      .dwattr $C$DW$152, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    1287                      .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1288                      .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    1289              $C$DW$153       .dwtag  DW_TAG_member
    1290                      .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$19)
    1291                      .dwattr $C$DW$153, DW_AT_name("GPIO52")
    1292                      .dwattr $C$DW$153, DW_AT_TI_symbol_name("_GPIO52")
    1293                      .dwattr $C$DW$153, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    1294                      .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1295                      .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    1296              $C$DW$154       .dwtag  DW_TAG_member
    1297                      .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$19)
    1298                      .dwattr $C$DW$154, DW_AT_name("GPIO53")
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:04 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0323210                           PAGE   25

    1299                      .dwattr $C$DW$154, DW_AT_TI_symbol_name("_GPIO53")
    1300                      .dwattr $C$DW$154, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    1301                      .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1302                      .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
    1303              $C$DW$155       .dwtag  DW_TAG_member
    1304                      .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$19)
    1305                      .dwattr $C$DW$155, DW_AT_name("GPIO54")
    1306                      .dwattr $C$DW$155, DW_AT_TI_symbol_name("_GPIO54")
    1307                      .dwattr $C$DW$155, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    1308                      .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1309                      .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
    1310              $C$DW$156       .dwtag  DW_TAG_member
    1311                      .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$19)
    1312                      .dwattr $C$DW$156, DW_AT_name("GPIO55")
    1313                      .dwattr $C$DW$156, DW_AT_TI_symbol_name("_GPIO55")
    1314                      .dwattr $C$DW$156, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    1315                      .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1316                      .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    1317              $C$DW$157       .dwtag  DW_TAG_member
    1318                      .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$19)
    1319                      .dwattr $C$DW$157, DW_AT_name("GPIO56")
    1320                      .dwattr $C$DW$157, DW_AT_TI_symbol_name("_GPIO56")
    1321                      .dwattr $C$DW$157, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
    1322                      .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1323                      .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    1324              $C$DW$158       .dwtag  DW_TAG_member
    1325                      .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$19)
    1326                      .dwattr $C$DW$158, DW_AT_name("GPIO57")
    1327                      .dwattr $C$DW$158, DW_AT_TI_symbol_name("_GPIO57")
    1328                      .dwattr $C$DW$158, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    1329                      .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1330                      .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    1331              $C$DW$159       .dwtag  DW_TAG_member
    1332                      .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$19)
    1333                      .dwattr $C$DW$159, DW_AT_name("GPIO58")
    1334                      .dwattr $C$DW$159, DW_AT_TI_symbol_name("_GPIO58")
    1335                      .dwattr $C$DW$159, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
    1336                      .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1337                      .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    1338              $C$DW$160       .dwtag  DW_TAG_member
    1339                      .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$19)
    1340                      .dwattr $C$DW$160, DW_AT_name("GPIO59")
    1341                      .dwattr $C$DW$160, DW_AT_TI_symbol_name("_GPIO59")
    1342                      .dwattr $C$DW$160, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
    1343                      .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1344                      .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    1345              $C$DW$161       .dwtag  DW_TAG_member
    1346                      .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$19)
    1347                      .dwattr $C$DW$161, DW_AT_name("GPIO60")
    1348                      .dwattr $C$DW$161, DW_AT_TI_symbol_name("_GPIO60")
    1349                      .dwattr $C$DW$161, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
    1350                      .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1351                      .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    1352              $C$DW$162       .dwtag  DW_TAG_member
    1353                      .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:04 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0323210                           PAGE   26

    1354                      .dwattr $C$DW$162, DW_AT_name("GPIO61")
    1355                      .dwattr $C$DW$162, DW_AT_TI_symbol_name("_GPIO61")
    1356                      .dwattr $C$DW$162, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
    1357                      .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1358                      .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    1359              $C$DW$163       .dwtag  DW_TAG_member
    1360                      .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$19)
    1361                      .dwattr $C$DW$163, DW_AT_name("GPIO62")
    1362                      .dwattr $C$DW$163, DW_AT_TI_symbol_name("_GPIO62")
    1363                      .dwattr $C$DW$163, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
    1364                      .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1365                      .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    1366              $C$DW$164       .dwtag  DW_TAG_member
    1367                      .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$19)
    1368                      .dwattr $C$DW$164, DW_AT_name("GPIO63")
    1369                      .dwattr $C$DW$164, DW_AT_TI_symbol_name("_GPIO63")
    1370                      .dwattr $C$DW$164, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    1371                      .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1372                      .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    1373                      .dwendtag $C$DW$T$35
    1374              
    1375              
    1376              $C$DW$T$36      .dwtag  DW_TAG_union_type
    1377                      .dwattr $C$DW$T$36, DW_AT_name("GPBDAT_REG")
    1378                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x02)
    1379              $C$DW$165       .dwtag  DW_TAG_member
    1380                      .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$21)
    1381                      .dwattr $C$DW$165, DW_AT_name("all")
    1382                      .dwattr $C$DW$165, DW_AT_TI_symbol_name("_all")
    1383                      .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1384                      .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    1385              $C$DW$166       .dwtag  DW_TAG_member
    1386                      .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$35)
    1387                      .dwattr $C$DW$166, DW_AT_name("bit")
    1388                      .dwattr $C$DW$166, DW_AT_TI_symbol_name("_bit")
    1389                      .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1390                      .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    1391                      .dwendtag $C$DW$T$36
    1392              
    1393              
    1394              $C$DW$T$37      .dwtag  DW_TAG_structure_type
    1395                      .dwattr $C$DW$T$37, DW_AT_name("GPC1_BITS")
    1396                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x02)
    1397              $C$DW$167       .dwtag  DW_TAG_member
    1398                      .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$19)
    1399                      .dwattr $C$DW$167, DW_AT_name("GPIO64")
    1400                      .dwattr $C$DW$167, DW_AT_TI_symbol_name("_GPIO64")
