TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:03 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0471610                           PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v6.2.7 *
       3              ;* Date/Time created: Thu Jul 02 08:31:03 2015                 *
       4              ;***************************************************************
       5                      .compiler_opts --diag_wrap=off --float_support=fpu32 --hll_source=on --mem_model:code=flat --mem_mode
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("../cntrlPWM/PWM.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v6.2.7 Copyright (c) 1996-2014 Texas I
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("D:\ActiveProject\EKT5\PKMT_NONBIOS\InvertorCntrl\ISPprg")
      13              
      14              $C$DW$1 .dwtag  DW_TAG_subprogram, DW_AT_name("rstPwmCntrl")
      15                      .dwattr $C$DW$1, DW_AT_TI_symbol_name("_rstPwmCntrl")
      16                      .dwattr $C$DW$1, DW_AT_declaration

    2000                      .dwpsn  file "../cntrlPWM/PWM.c",line 422,column 1,is_stmt
    2001              $C$DW$82        .dwtag  DW_TAG_TI_branch
    2002                      .dwattr $C$DW$82, DW_AT_low_pc(0x00)
    2003                      .dwattr $C$DW$82, DW_AT_TI_return
    2004 00000256 0006          LRETR     ; [CPU_] 
    2005                      ; return occurs ; [] 
    2006                      .dwattr $C$DW$81, DW_AT_TI_end_file("../cntrlPWM/PWM.c")
    2007                      .dwattr $C$DW$81, DW_AT_TI_end_line(0x1a6)
    2008                      .dwattr $C$DW$81, DW_AT_TI_end_column(0x01)
    2009                      .dwendentry
    2010                      .dwendtag $C$DW$81
    2011              
    2012 00000257               .sect   ".text"
    2013                      .clink
    2014                      .global _disablePwmInt
    2015              
    2016              $C$DW$83        .dwtag  DW_TAG_subprogram, DW_AT_name("disablePwmInt")
    2017                      .dwattr $C$DW$83, DW_AT_low_pc(_disablePwmInt)
    2018                      .dwattr $C$DW$83, DW_AT_high_pc(0x00)
    2019                      .dwattr $C$DW$83, DW_AT_TI_symbol_name("_disablePwmInt")
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:03 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0471610                           PAGE   43

    2020                      .dwattr $C$DW$83, DW_AT_external
    2021                      .dwattr $C$DW$83, DW_AT_TI_begin_file("../cntrlPWM/PWM.c")
    2022                      .dwattr $C$DW$83, DW_AT_TI_begin_line(0x1a8)
    2023                      .dwattr $C$DW$83, DW_AT_TI_begin_column(0x06)
    2024                      .dwattr $C$DW$83, DW_AT_TI_max_frame_size(-2)
    2025                      .dwpsn  file "../cntrlPWM/PWM.c",line 424,column 25,is_stmt,address _disablePwmInt
    2026              
    2027                      .dwfde $C$DW$CIE, _disablePwmInt
    2028              
    2029              ;***************************************************************
    2030              ;* FNAME: _disablePwmInt                FR SIZE:   0           *
    2031              ;*                                                             *
    2032              ;* FUNCTION ENVIRONMENT                                        *
    2033              ;*                                                             *
    2034              ;* FUNCTION PROPERTIES                                         *
    2035              ;*                            0 Parameter,  0 Auto,  0 SOE     *
    2036              ;***************************************************************
    2037              
    2038 00000257       _disablePwmInt:
    2039                      .dwcfi  cfa_offset, -2
    2040                      .dwcfi  save_reg_to_mem, 26, 0
    2041                      .dwcfi  save_reg_to_reg, 78, 26
    2042                      .dwpsn  file "../cntrlPWM/PWM.c",line 425,column 2,is_stmt
    2043 00000257 761F!         MOVW      DP,#_EPwm1Regs+25     ; [CPU_U] 
         00000258 0000 
    2044 00000259 1819!         AND       @_EPwm1Regs+25,#0xfff7 ; [CPU_] |425| 
         0000025a FFF7 
    2045                      .dwpsn  file "../cntrlPWM/PWM.c",line 426,column 1,is_stmt
    2046              $C$DW$84        .dwtag  DW_TAG_TI_branch
    2047                      .dwattr $C$DW$84, DW_AT_low_pc(0x00)
    2048                      .dwattr $C$DW$84, DW_AT_TI_return
    2049 0000025b 0006          LRETR     ; [CPU_] 
    2050                      ; return occurs ; [] 
    2051                      .dwattr $C$DW$83, DW_AT_TI_end_file("../cntrlPWM/PWM.c")
    2052                      .dwattr $C$DW$83, DW_AT_TI_end_line(0x1aa)
    2053                      .dwattr $C$DW$83, DW_AT_TI_end_column(0x01)
    2054                      .dwendentry
    2055                      .dwendtag $C$DW$83
    2056              
    2057              ;**************************************************************
    2058              ;* UNDEFINED EXTERNAL REFERENCES                              *
    2059              ;**************************************************************
    2060                      .global _rstPwmCntrl
    2061                      .global _getPhaseTimePWM
    2062                      .global _setStatusConvertor
    2063                      .global _getRegister
    2064                      .global _PieCtrlRegs
    2065                      .global _SysCtrlRegs
    2066                      .global _GpioDataRegs
    2067                      .global _EPwm1Regs
    2068                      .global _EPwm2Regs
    2069                      .global _EPwm4Regs
    2070                      .global _EPwm3Regs
    2071                      .global _GpioCtrlRegs
    2072                      .global _PieVectTable
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:03 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0471610                           PAGE   44

    2073              
    2074              ;***************************************************************
    2075              ;* TYPE INFORMATION                                            *
    2076              ;***************************************************************
    2077              
    2078              $C$DW$T$20      .dwtag  DW_TAG_structure_type
    2079                      .dwattr $C$DW$T$20, DW_AT_name("AQCSFRC_BITS")
    2080                      .dwattr $C$DW$T$20, DW_AT_byte_size(0x01)
    2081              $C$DW$85        .dwtag  DW_TAG_member
    2082                      .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$19)
    2083                      .dwattr $C$DW$85, DW_AT_name("CSFA")
    2084                      .dwattr $C$DW$85, DW_AT_TI_symbol_name("_CSFA")
    2085                      .dwattr $C$DW$85, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x02)
    2086                      .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2087                      .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
    2088              $C$DW$86        .dwtag  DW_TAG_member
    2089                      .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$19)
    2090                      .dwattr $C$DW$86, DW_AT_name("CSFB")
    2091                      .dwattr $C$DW$86, DW_AT_TI_symbol_name("_CSFB")
    2092                      .dwattr $C$DW$86, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x02)
    2093                      .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2094                      .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
    2095              $C$DW$87        .dwtag  DW_TAG_member
    2096                      .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$19)
    2097                      .dwattr $C$DW$87, DW_AT_name("rsvd1")
    2098                      .dwattr $C$DW$87, DW_AT_TI_symbol_name("_rsvd1")
    2099                      .dwattr $C$DW$87, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0c)
    2100                      .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2101                      .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
    2102                      .dwendtag $C$DW$T$20
    2103              
    2104              
    2105              $C$DW$T$21      .dwtag  DW_TAG_union_type
    2106                      .dwattr $C$DW$T$21, DW_AT_name("AQCSFRC_REG")
    2107                      .dwattr $C$DW$T$21, DW_AT_byte_size(0x01)
    2108              $C$DW$88        .dwtag  DW_TAG_member
    2109                      .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$19)
    2110                      .dwattr $C$DW$88, DW_AT_name("all")
    2111                      .dwattr $C$DW$88, DW_AT_TI_symbol_name("_all")
    2112                      .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2113                      .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
    2114              $C$DW$89        .dwtag  DW_TAG_member
    2115                      .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$20)
    2116                      .dwattr $C$DW$89, DW_AT_name("bit")
    2117                      .dwattr $C$DW$89, DW_AT_TI_symbol_name("_bit")
    2118                      .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2119                      .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
    2120                      .dwendtag $C$DW$T$21
    2121              
    2122              
    2123              $C$DW$T$22      .dwtag  DW_TAG_structure_type
    2124                      .dwattr $C$DW$T$22, DW_AT_name("AQCTL_BITS")
    2125                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x01)
    2126              $C$DW$90        .dwtag  DW_TAG_member
    2127                      .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:03 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0471610                           PAGE   45

    2128                      .dwattr $C$DW$90, DW_AT_name("ZRO")
    2129                      .dwattr $C$DW$90, DW_AT_TI_symbol_name("_ZRO")
    2130                      .dwattr $C$DW$90, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x02)
    2131                      .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2132                      .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
    2133              $C$DW$91        .dwtag  DW_TAG_member
    2134                      .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$19)
    2135                      .dwattr $C$DW$91, DW_AT_name("PRD")
    2136                      .dwattr $C$DW$91, DW_AT_TI_symbol_name("_PRD")
    2137                      .dwattr $C$DW$91, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x02)
    2138                      .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2139                      .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
    2140              $C$DW$92        .dwtag  DW_TAG_member
    2141                      .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$19)
    2142                      .dwattr $C$DW$92, DW_AT_name("CAU")
    2143                      .dwattr $C$DW$92, DW_AT_TI_symbol_name("_CAU")
    2144                      .dwattr $C$DW$92, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x02)
    2145                      .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2146                      .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
    2147              $C$DW$93        .dwtag  DW_TAG_member
    2148                      .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$19)
    2149                      .dwattr $C$DW$93, DW_AT_name("CAD")
    2150                      .dwattr $C$DW$93, DW_AT_TI_symbol_name("_CAD")
    2151                      .dwattr $C$DW$93, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x02)
    2152                      .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2153                      .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
    2154              $C$DW$94        .dwtag  DW_TAG_member
    2155                      .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$19)
    2156                      .dwattr $C$DW$94, DW_AT_name("CBU")
    2157                      .dwattr $C$DW$94, DW_AT_TI_symbol_name("_CBU")
    2158                      .dwattr $C$DW$94, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x02)
    2159                      .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2160                      .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
    2161              $C$DW$95        .dwtag  DW_TAG_member
    2162                      .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$19)
    2163                      .dwattr $C$DW$95, DW_AT_name("CBD")
    2164                      .dwattr $C$DW$95, DW_AT_TI_symbol_name("_CBD")
    2165                      .dwattr $C$DW$95, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x02)
    2166                      .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2167                      .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
    2168              $C$DW$96        .dwtag  DW_TAG_member
    2169                      .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$19)
    2170                      .dwattr $C$DW$96, DW_AT_name("rsvd")
    2171                      .dwattr $C$DW$96, DW_AT_TI_symbol_name("_rsvd")
    2172                      .dwattr $C$DW$96, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x04)
    2173                      .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2174                      .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
    2175                      .dwendtag $C$DW$T$22
    2176              
    2177              
    2178              $C$DW$T$23      .dwtag  DW_TAG_union_type
    2179                      .dwattr $C$DW$T$23, DW_AT_name("AQCTL_REG")
    2180                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x01)
    2181              $C$DW$97        .dwtag  DW_TAG_member
    2182                      .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:03 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0471610                           PAGE   46

    2183                      .dwattr $C$DW$97, DW_AT_name("all")
    2184                      .dwattr $C$DW$97, DW_AT_TI_symbol_name("_all")
    2185                      .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2186                      .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
    2187              $C$DW$98        .dwtag  DW_TAG_member
    2188                      .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$22)
    2189                      .dwattr $C$DW$98, DW_AT_name("bit")
    2190                      .dwattr $C$DW$98, DW_AT_TI_symbol_name("_bit")
    2191                      .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2192                      .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
    2193                      .dwendtag $C$DW$T$23
    2194              
    2195              
    2196              $C$DW$T$24      .dwtag  DW_TAG_structure_type
    2197                      .dwattr $C$DW$T$24, DW_AT_name("AQSFRC_BITS")
    2198                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x01)
    2199              $C$DW$99        .dwtag  DW_TAG_member
    2200                      .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$19)
    2201                      .dwattr $C$DW$99, DW_AT_name("ACTSFA")
    2202                      .dwattr $C$DW$99, DW_AT_TI_symbol_name("_ACTSFA")
    2203                      .dwattr $C$DW$99, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x02)
    2204                      .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2205                      .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
    2206              $C$DW$100       .dwtag  DW_TAG_member
    2207                      .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$19)
    2208                      .dwattr $C$DW$100, DW_AT_name("OTSFA")
    2209                      .dwattr $C$DW$100, DW_AT_TI_symbol_name("_OTSFA")
    2210                      .dwattr $C$DW$100, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    2211                      .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2212                      .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
    2213              $C$DW$101       .dwtag  DW_TAG_member
    2214                      .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$19)
    2215                      .dwattr $C$DW$101, DW_AT_name("ACTSFB")
    2216                      .dwattr $C$DW$101, DW_AT_TI_symbol_name("_ACTSFB")
    2217                      .dwattr $C$DW$101, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x02)
    2218                      .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2219                      .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
    2220              $C$DW$102       .dwtag  DW_TAG_member
    2221                      .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$19)
    2222                      .dwattr $C$DW$102, DW_AT_name("OTSFB")
    2223                      .dwattr $C$DW$102, DW_AT_TI_symbol_name("_OTSFB")
    2224                      .dwattr $C$DW$102, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    2225                      .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2226                      .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
    2227              $C$DW$103       .dwtag  DW_TAG_member
    2228                      .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$19)
    2229                      .dwattr $C$DW$103, DW_AT_name("RLDCSF")
    2230                      .dwattr $C$DW$103, DW_AT_TI_symbol_name("_RLDCSF")
    2231                      .dwattr $C$DW$103, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x02)
    2232                      .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2233                      .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
    2234              $C$DW$104       .dwtag  DW_TAG_member
    2235                      .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$19)
    2236                      .dwattr $C$DW$104, DW_AT_name("rsvd1")
    2237                      .dwattr $C$DW$104, DW_AT_TI_symbol_name("_rsvd1")
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:03 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0471610                           PAGE   47

    2238                      .dwattr $C$DW$104, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x08)
    2239                      .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2240                      .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
    2241                      .dwendtag $C$DW$T$24
    2242              
    2243              
    2244              $C$DW$T$25      .dwtag  DW_TAG_union_type
    2245                      .dwattr $C$DW$T$25, DW_AT_name("AQSFRC_REG")
    2246                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x01)
    2247              $C$DW$105       .dwtag  DW_TAG_member
    2248                      .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$19)
    2249                      .dwattr $C$DW$105, DW_AT_name("all")
    2250                      .dwattr $C$DW$105, DW_AT_TI_symbol_name("_all")
    2251                      .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2252                      .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
    2253              $C$DW$106       .dwtag  DW_TAG_member
    2254                      .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$24)
    2255                      .dwattr $C$DW$106, DW_AT_name("bit")
    2256                      .dwattr $C$DW$106, DW_AT_TI_symbol_name("_bit")
    2257                      .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2258                      .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    2259                      .dwendtag $C$DW$T$25
    2260              
    2261              
    2262              $C$DW$T$27      .dwtag  DW_TAG_union_type
    2263                      .dwattr $C$DW$T$27, DW_AT_name("CMPA_HRPWM_GROUP")
    2264                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x02)
    2265              $C$DW$107       .dwtag  DW_TAG_member
    2266                      .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$26)
    2267                      .dwattr $C$DW$107, DW_AT_name("all")
    2268                      .dwattr $C$DW$107, DW_AT_TI_symbol_name("_all")
    2269                      .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2270                      .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
    2271              $C$DW$108       .dwtag  DW_TAG_member
    2272                      .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$28)
    2273                      .dwattr $C$DW$108, DW_AT_name("half")
    2274                      .dwattr $C$DW$108, DW_AT_TI_symbol_name("_half")
    2275                      .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2276                      .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    2277                      .dwendtag $C$DW$T$27
    2278              
    2279              
    2280              $C$DW$T$28      .dwtag  DW_TAG_structure_type
    2281                      .dwattr $C$DW$T$28, DW_AT_name("CMPA_HRPWM_REG")
    2282                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x02)
    2283              $C$DW$109       .dwtag  DW_TAG_member
    2284                      .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$19)
    2285                      .dwattr $C$DW$109, DW_AT_name("CMPAHR")
    2286                      .dwattr $C$DW$109, DW_AT_TI_symbol_name("_CMPAHR")
    2287                      .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2288                      .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    2289              $C$DW$110       .dwtag  DW_TAG_member
    2290                      .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$19)
    2291                      .dwattr $C$DW$110, DW_AT_name("CMPA")
    2292                      .dwattr $C$DW$110, DW_AT_TI_symbol_name("_CMPA")
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:03 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0471610                           PAGE   48

    2293                      .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2294                      .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    2295                      .dwendtag $C$DW$T$28
    2296              
    2297              
    2298              $C$DW$T$29      .dwtag  DW_TAG_structure_type
    2299                      .dwattr $C$DW$T$29, DW_AT_name("CMPCTL_BITS")
    2300                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x01)
    2301              $C$DW$111       .dwtag  DW_TAG_member
    2302                      .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$19)
    2303                      .dwattr $C$DW$111, DW_AT_name("LOADAMODE")
    2304                      .dwattr $C$DW$111, DW_AT_TI_symbol_name("_LOADAMODE")
    2305                      .dwattr $C$DW$111, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x02)
    2306                      .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2307                      .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    2308              $C$DW$112       .dwtag  DW_TAG_member
    2309                      .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$19)
    2310                      .dwattr $C$DW$112, DW_AT_name("LOADBMODE")
    2311                      .dwattr $C$DW$112, DW_AT_TI_symbol_name("_LOADBMODE")
    2312                      .dwattr $C$DW$112, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x02)
    2313                      .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2314                      .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    2315              $C$DW$113       .dwtag  DW_TAG_member
    2316                      .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$19)
    2317                      .dwattr $C$DW$113, DW_AT_name("SHDWAMODE")
    2318                      .dwattr $C$DW$113, DW_AT_TI_symbol_name("_SHDWAMODE")
    2319                      .dwattr $C$DW$113, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    2320                      .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2321                      .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    2322              $C$DW$114       .dwtag  DW_TAG_member
    2323                      .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$19)
    2324                      .dwattr $C$DW$114, DW_AT_name("rsvd1")
    2325                      .dwattr $C$DW$114, DW_AT_TI_symbol_name("_rsvd1")
    2326                      .dwattr $C$DW$114, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    2327                      .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2328                      .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    2329              $C$DW$115       .dwtag  DW_TAG_member
    2330                      .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$19)
    2331                      .dwattr $C$DW$115, DW_AT_name("SHDWBMODE")
    2332                      .dwattr $C$DW$115, DW_AT_TI_symbol_name("_SHDWBMODE")
    2333                      .dwattr $C$DW$115, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    2334                      .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2335                      .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    2336              $C$DW$116       .dwtag  DW_TAG_member
    2337                      .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$19)
    2338                      .dwattr $C$DW$116, DW_AT_name("rsvd2")
    2339                      .dwattr $C$DW$116, DW_AT_TI_symbol_name("_rsvd2")
    2340                      .dwattr $C$DW$116, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    2341                      .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2342                      .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    2343              $C$DW$117       .dwtag  DW_TAG_member
    2344                      .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$19)
    2345                      .dwattr $C$DW$117, DW_AT_name("SHDWAFULL")
    2346                      .dwattr $C$DW$117, DW_AT_TI_symbol_name("_SHDWAFULL")
    2347                      .dwattr $C$DW$117, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:03 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0471610                           PAGE   49

    2348                      .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2349                      .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    2350              $C$DW$118       .dwtag  DW_TAG_member
    2351                      .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$19)
    2352                      .dwattr $C$DW$118, DW_AT_name("SHDWBFULL")
    2353                      .dwattr $C$DW$118, DW_AT_TI_symbol_name("_SHDWBFULL")
    2354                      .dwattr $C$DW$118, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    2355                      .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2356                      .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    2357              $C$DW$119       .dwtag  DW_TAG_member
    2358                      .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$19)
    2359                      .dwattr $C$DW$119, DW_AT_name("rsvd3")
    2360                      .dwattr $C$DW$119, DW_AT_TI_symbol_name("_rsvd3")
    2361                      .dwattr $C$DW$119, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x06)
    2362                      .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2363                      .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    2364                      .dwendtag $C$DW$T$29
    2365              
    2366              
    2367              $C$DW$T$30      .dwtag  DW_TAG_union_type
    2368                      .dwattr $C$DW$T$30, DW_AT_name("CMPCTL_REG")
    2369                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x01)
    2370              $C$DW$120       .dwtag  DW_TAG_member
    2371                      .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$19)
    2372                      .dwattr $C$DW$120, DW_AT_name("all")
    2373                      .dwattr $C$DW$120, DW_AT_TI_symbol_name("_all")
    2374                      .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2375                      .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    2376              $C$DW$121       .dwtag  DW_TAG_member
    2377                      .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$29)
    2378                      .dwattr $C$DW$121, DW_AT_name("bit")
    2379                      .dwattr $C$DW$121, DW_AT_TI_symbol_name("_bit")
    2380                      .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2381                      .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    2382                      .dwendtag $C$DW$T$30
    2383              
    2384              
    2385              $C$DW$T$31      .dwtag  DW_TAG_structure_type
    2386                      .dwattr $C$DW$T$31, DW_AT_name("DBCTL_BITS")
    2387                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x01)
    2388              $C$DW$122       .dwtag  DW_TAG_member
    2389                      .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$19)
    2390                      .dwattr $C$DW$122, DW_AT_name("OUT_MODE")
    2391                      .dwattr $C$DW$122, DW_AT_TI_symbol_name("_OUT_MODE")
    2392                      .dwattr $C$DW$122, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x02)
    2393                      .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2394                      .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    2395              $C$DW$123       .dwtag  DW_TAG_member
    2396                      .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$19)
    2397                      .dwattr $C$DW$123, DW_AT_name("POLSEL")
    2398                      .dwattr $C$DW$123, DW_AT_TI_symbol_name("_POLSEL")
    2399                      .dwattr $C$DW$123, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x02)
    2400                      .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2401                      .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    2402              $C$DW$124       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:03 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0471610                           PAGE   50

    2403                      .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$19)
    2404                      .dwattr $C$DW$124, DW_AT_name("IN_MODE")
    2405                      .dwattr $C$DW$124, DW_AT_TI_symbol_name("_IN_MODE")
    2406                      .dwattr $C$DW$124, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x02)
    2407                      .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2408                      .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    2409              $C$DW$125       .dwtag  DW_TAG_member
    2410                      .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$19)
    2411                      .dwattr $C$DW$125, DW_AT_name("rsvd1")
    2412                      .dwattr $C$DW$125, DW_AT_TI_symbol_name("_rsvd1")
    2413                      .dwattr $C$DW$125, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0a)
    2414                      .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2415                      .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    2416                      .dwendtag $C$DW$T$31
    2417              
    2418              
    2419              $C$DW$T$32      .dwtag  DW_TAG_union_type
    2420                      .dwattr $C$DW$T$32, DW_AT_name("DBCTL_REG")
    2421                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x01)
    2422              $C$DW$126       .dwtag  DW_TAG_member
    2423                      .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$19)
    2424                      .dwattr $C$DW$126, DW_AT_name("all")
    2425                      .dwattr $C$DW$126, DW_AT_TI_symbol_name("_all")
    2426                      .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2427                      .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    2428              $C$DW$127       .dwtag  DW_TAG_member
    2429                      .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$31)
    2430                      .dwattr $C$DW$127, DW_AT_name("bit")
    2431                      .dwattr $C$DW$127, DW_AT_TI_symbol_name("_bit")
    2432                      .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2433                      .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    2434                      .dwendtag $C$DW$T$32
    2435              
    2436              
    2437              $C$DW$T$33      .dwtag  DW_TAG_structure_type
    2438                      .dwattr $C$DW$T$33, DW_AT_name("EPWM_REGS")
    2439                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x22)
    2440              $C$DW$128       .dwtag  DW_TAG_member
    2441                      .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$109)
    2442                      .dwattr $C$DW$128, DW_AT_name("TBCTL")
    2443                      .dwattr $C$DW$128, DW_AT_TI_symbol_name("_TBCTL")
    2444                      .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2445                      .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    2446              $C$DW$129       .dwtag  DW_TAG_member
    2447                      .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$113)
    2448                      .dwattr $C$DW$129, DW_AT_name("TBSTS")
    2449                      .dwattr $C$DW$129, DW_AT_TI_symbol_name("_TBSTS")
    2450                      .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2451                      .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    2452              $C$DW$130       .dwtag  DW_TAG_member
    2453                      .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$110)
    2454                      .dwattr $C$DW$130, DW_AT_name("TBPHS")
    2455                      .dwattr $C$DW$130, DW_AT_TI_symbol_name("_TBPHS")
    2456                      .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    2457                      .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:03 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0471610                           PAGE   51

    2458              $C$DW$131       .dwtag  DW_TAG_member
    2459                      .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$19)
    2460                      .dwattr $C$DW$131, DW_AT_name("TBCTR")
    2461                      .dwattr $C$DW$131, DW_AT_TI_symbol_name("_TBCTR")
    2462                      .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2463                      .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    2464              $C$DW$132       .dwtag  DW_TAG_member
    2465                      .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$19)
    2466                      .dwattr $C$DW$132, DW_AT_name("TBPRD")
    2467                      .dwattr $C$DW$132, DW_AT_TI_symbol_name("_TBPRD")
    2468                      .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    2469                      .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    2470              $C$DW$133       .dwtag  DW_TAG_member
    2471                      .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$19)
    2472                      .dwattr $C$DW$133, DW_AT_name("rsvd1")
    2473                      .dwattr $C$DW$133, DW_AT_TI_symbol_name("_rsvd1")
    2474                      .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    2475                      .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    2476              $C$DW$134       .dwtag  DW_TAG_member
    2477                      .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$30)
    2478                      .dwattr $C$DW$134, DW_AT_name("CMPCTL")
    2479                      .dwattr $C$DW$134, DW_AT_TI_symbol_name("_CMPCTL")
    2480                      .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    2481                      .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    2482              $C$DW$135       .dwtag  DW_TAG_member
    2483                      .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$27)
    2484                      .dwattr $C$DW$135, DW_AT_name("CMPA")
    2485                      .dwattr $C$DW$135, DW_AT_TI_symbol_name("_CMPA")
    2486                      .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2487                      .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    2488              $C$DW$136       .dwtag  DW_TAG_member
    2489                      .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$19)
    2490                      .dwattr $C$DW$136, DW_AT_name("CMPB")
    2491                      .dwattr $C$DW$136, DW_AT_TI_symbol_name("_CMPB")
    2492                      .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    2493                      .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    2494              $C$DW$137       .dwtag  DW_TAG_member
    2495                      .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$23)
    2496                      .dwattr $C$DW$137, DW_AT_name("AQCTLA")
    2497                      .dwattr $C$DW$137, DW_AT_TI_symbol_name("_AQCTLA")
    2498                      .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
    2499                      .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    2500              $C$DW$138       .dwtag  DW_TAG_member
    2501                      .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$23)
    2502                      .dwattr $C$DW$138, DW_AT_name("AQCTLB")
    2503                      .dwattr $C$DW$138, DW_AT_TI_symbol_name("_AQCTLB")
    2504                      .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2505                      .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    2506              $C$DW$139       .dwtag  DW_TAG_member
    2507                      .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$25)
    2508                      .dwattr $C$DW$139, DW_AT_name("AQSFRC")
    2509                      .dwattr $C$DW$139, DW_AT_TI_symbol_name("_AQSFRC")
    2510                      .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    2511                      .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    2512              $C$DW$140       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:03 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0471610                           PAGE   52

    2513                      .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$21)
    2514                      .dwattr $C$DW$140, DW_AT_name("AQCSFRC")
    2515                      .dwattr $C$DW$140, DW_AT_TI_symbol_name("_AQCSFRC")
    2516                      .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    2517                      .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    2518              $C$DW$141       .dwtag  DW_TAG_member
    2519                      .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$32)
    2520                      .dwattr $C$DW$141, DW_AT_name("DBCTL")
    2521                      .dwattr $C$DW$141, DW_AT_TI_symbol_name("_DBCTL")
    2522                      .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
    2523                      .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    2524              $C$DW$142       .dwtag  DW_TAG_member
    2525                      .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$19)
    2526                      .dwattr $C$DW$142, DW_AT_name("DBRED")
    2527                      .dwattr $C$DW$142, DW_AT_TI_symbol_name("_DBRED")
    2528                      .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2529                      .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    2530              $C$DW$143       .dwtag  DW_TAG_member
    2531                      .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$19)
    2532                      .dwattr $C$DW$143, DW_AT_name("DBFED")
    2533                      .dwattr $C$DW$143, DW_AT_TI_symbol_name("_DBFED")
    2534                      .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    2535                      .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    2536              $C$DW$144       .dwtag  DW_TAG_member
    2537                      .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$125)
    2538                      .dwattr $C$DW$144, DW_AT_name("TZSEL")
    2539                      .dwattr $C$DW$144, DW_AT_TI_symbol_name("_TZSEL")
    2540                      .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    2541                      .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    2542              $C$DW$145       .dwtag  DW_TAG_member
    2543                      .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$19)
    2544                      .dwattr $C$DW$145, DW_AT_name("rsvd2")
    2545                      .dwattr $C$DW$145, DW_AT_TI_symbol_name("_rsvd2")
    2546                      .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x13]
    2547                      .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    2548              $C$DW$146       .dwtag  DW_TAG_member
    2549                      .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$117)
    2550                      .dwattr $C$DW$146, DW_AT_name("TZCTL")
    2551                      .dwattr $C$DW$146, DW_AT_TI_symbol_name("_TZCTL")
    2552                      .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    2553                      .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
    2554              $C$DW$147       .dwtag  DW_TAG_member
    2555                      .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$119)
    2556                      .dwattr $C$DW$147, DW_AT_name("TZEINT")
    2557                      .dwattr $C$DW$147, DW_AT_TI_symbol_name("_TZEINT")
    2558                      .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    2559                      .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
    2560              $C$DW$148       .dwtag  DW_TAG_member
    2561                      .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$121)
    2562                      .dwattr $C$DW$148, DW_AT_name("TZFLG")
    2563                      .dwattr $C$DW$148, DW_AT_TI_symbol_name("_TZFLG")
    2564                      .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    2565                      .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    2566              $C$DW$149       .dwtag  DW_TAG_member
    2567                      .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$115)
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:03 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0471610                           PAGE   53

    2568                      .dwattr $C$DW$149, DW_AT_name("TZCLR")
    2569                      .dwattr $C$DW$149, DW_AT_TI_symbol_name("_TZCLR")
    2570                      .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
    2571                      .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    2572              $C$DW$150       .dwtag  DW_TAG_member
    2573                      .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$123)
    2574                      .dwattr $C$DW$150, DW_AT_name("TZFRC")
    2575                      .dwattr $C$DW$150, DW_AT_TI_symbol_name("_TZFRC")
    2576                      .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    2577                      .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
    2578              $C$DW$151       .dwtag  DW_TAG_member
    2579                      .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$43)
    2580                      .dwattr $C$DW$151, DW_AT_name("ETSEL")
    2581                      .dwattr $C$DW$151, DW_AT_TI_symbol_name("_ETSEL")
    2582                      .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
    2583                      .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    2584              $C$DW$152       .dwtag  DW_TAG_member
    2585                      .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$41)
    2586                      .dwattr $C$DW$152, DW_AT_name("ETPS")
    2587                      .dwattr $C$DW$152, DW_AT_TI_symbol_name("_ETPS")
    2588                      .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    2589                      .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    2590              $C$DW$153       .dwtag  DW_TAG_member
    2591                      .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$37)
    2592                      .dwattr $C$DW$153, DW_AT_name("ETFLG")
    2593                      .dwattr $C$DW$153, DW_AT_TI_symbol_name("_ETFLG")
    2594                      .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x1b]
    2595                      .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    2596              $C$DW$154       .dwtag  DW_TAG_member
    2597                      .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$35)
    2598                      .dwattr $C$DW$154, DW_AT_name("ETCLR")
    2599                      .dwattr $C$DW$154, DW_AT_TI_symbol_name("_ETCLR")
    2600                      .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    2601                      .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
    2602              $C$DW$155       .dwtag  DW_TAG_member
    2603                      .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$39)
    2604                      .dwattr $C$DW$155, DW_AT_name("ETFRC")
    2605                      .dwattr $C$DW$155, DW_AT_TI_symbol_name("_ETFRC")
    2606                      .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x1d]
    2607                      .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
    2608              $C$DW$156       .dwtag  DW_TAG_member
    2609                      .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$80)
    2610                      .dwattr $C$DW$156, DW_AT_name("PCCTL")
    2611                      .dwattr $C$DW$156, DW_AT_TI_symbol_name("_PCCTL")
    2612                      .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    2613                      .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    2614              $C$DW$157       .dwtag  DW_TAG_member
    2615                      .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$19)
    2616                      .dwattr $C$DW$157, DW_AT_name("rsvd3")
    2617                      .dwattr $C$DW$157, DW_AT_TI_symbol_name("_rsvd3")
    2618                      .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x1f]
    2619                      .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    2620              $C$DW$158       .dwtag  DW_TAG_member
    2621                      .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$72)
    2622                      .dwattr $C$DW$158, DW_AT_name("HRCNFG")
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:03 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0471610                           PAGE   54

    2623                      .dwattr $C$DW$158, DW_AT_TI_symbol_name("_HRCNFG")
    2624                      .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    2625                      .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    2626                      .dwendtag $C$DW$T$33
    2627              
    2628              $C$DW$159       .dwtag  DW_TAG_TI_far_type
    2629                      .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$33)
    2630              $C$DW$T$134     .dwtag  DW_TAG_volatile_type
    2631                      .dwattr $C$DW$T$134, DW_AT_type(*$C$DW$159)
    2632              
    2633              $C$DW$T$34      .dwtag  DW_TAG_structure_type
    2634                      .dwattr $C$DW$T$34, DW_AT_name("ETCLR_BITS")
    2635                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x01)
    2636              $C$DW$160       .dwtag  DW_TAG_member
    2637                      .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$19)
    2638                      .dwattr $C$DW$160, DW_AT_name("INT")
    2639                      .dwattr $C$DW$160, DW_AT_TI_symbol_name("_INT")
    2640                      .dwattr $C$DW$160, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    2641                      .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2642                      .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    2643              $C$DW$161       .dwtag  DW_TAG_member
    2644                      .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$19)
    2645                      .dwattr $C$DW$161, DW_AT_name("rsvd1")
    2646                      .dwattr $C$DW$161, DW_AT_TI_symbol_name("_rsvd1")
    2647                      .dwattr $C$DW$161, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    2648                      .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2649                      .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    2650              $C$DW$162       .dwtag  DW_TAG_member
    2651                      .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$19)
    2652                      .dwattr $C$DW$162, DW_AT_name("SOCA")
    2653                      .dwattr $C$DW$162, DW_AT_TI_symbol_name("_SOCA")
    2654                      .dwattr $C$DW$162, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    2655                      .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2656                      .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    2657              $C$DW$163       .dwtag  DW_TAG_member
    2658                      .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$19)
    2659                      .dwattr $C$DW$163, DW_AT_name("SOCB")
    2660                      .dwattr $C$DW$163, DW_AT_TI_symbol_name("_SOCB")
    2661                      .dwattr $C$DW$163, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    2662                      .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2663                      .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    2664              $C$DW$164       .dwtag  DW_TAG_member
    2665                      .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$19)
    2666                      .dwattr $C$DW$164, DW_AT_name("rsvd2")
    2667                      .dwattr $C$DW$164, DW_AT_TI_symbol_name("_rsvd2")
    2668                      .dwattr $C$DW$164, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0c)
    2669                      .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2670                      .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    2671                      .dwendtag $C$DW$T$34
    2672              
    2673              
    2674              $C$DW$T$35      .dwtag  DW_TAG_union_type
    2675                      .dwattr $C$DW$T$35, DW_AT_name("ETCLR_REG")
    2676                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x01)
    2677              $C$DW$165       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:03 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0471610                           PAGE   55

    2678                      .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$19)
    2679                      .dwattr $C$DW$165, DW_AT_name("all")
    2680                      .dwattr $C$DW$165, DW_AT_TI_symbol_name("_all")
    2681                      .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2682                      .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    2683              $C$DW$166       .dwtag  DW_TAG_member
    2684                      .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$34)
    2685                      .dwattr $C$DW$166, DW_AT_name("bit")
    2686                      .dwattr $C$DW$166, DW_AT_TI_symbol_name("_bit")
    2687                      .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2688                      .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    2689                      .dwendtag $C$DW$T$35
    2690              
    2691              
    2692              $C$DW$T$36      .dwtag  DW_TAG_structure_type
    2693                      .dwattr $C$DW$T$36, DW_AT_name("ETFLG_BITS")
    2694                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x01)
    2695              $C$DW$167       .dwtag  DW_TAG_member
    2696                      .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$19)
    2697                      .dwattr $C$DW$167, DW_AT_name("INT")
    2698                      .dwattr $C$DW$167, DW_AT_TI_symbol_name("_INT")
    2699                      .dwattr $C$DW$167, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    2700                      .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2701                      .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    2702              $C$DW$168       .dwtag  DW_TAG_member
    2703                      .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$19)
    2704                      .dwattr $C$DW$168, DW_AT_name("rsvd1")
    2705                      .dwattr $C$DW$168, DW_AT_TI_symbol_name("_rsvd1")
    2706                      .dwattr $C$DW$168, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    2707                      .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2708                      .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    2709              $C$DW$169       .dwtag  DW_TAG_member
    2710                      .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$19)
    2711                      .dwattr $C$DW$169, DW_AT_name("SOCA")
    2712                      .dwattr $C$DW$169, DW_AT_TI_symbol_name("_SOCA")
    2713                      .dwattr $C$DW$169, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    2714                      .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2715                      .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    2716              $C$DW$170       .dwtag  DW_TAG_member
    2717                      .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$19)
    2718                      .dwattr $C$DW$170, DW_AT_name("SOCB")
    2719                      .dwattr $C$DW$170, DW_AT_TI_symbol_name("_SOCB")
    2720                      .dwattr $C$DW$170, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    2721                      .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2722                      .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    2723              $C$DW$171       .dwtag  DW_TAG_member
    2724                      .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$19)
    2725                      .dwattr $C$DW$171, DW_AT_name("rsvd2")
    2726                      .dwattr $C$DW$171, DW_AT_TI_symbol_name("_rsvd2")
    2727                      .dwattr $C$DW$171, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0c)
    2728                      .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2729                      .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    2730                      .dwendtag $C$DW$T$36
    2731              
    2732              
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:03 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0471610                           PAGE   56

    2733              $C$DW$T$37      .dwtag  DW_TAG_union_type
    2734                      .dwattr $C$DW$T$37, DW_AT_name("ETFLG_REG")
    2735                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x01)
    2736              $C$DW$172       .dwtag  DW_TAG_member
    2737                      .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$19)
    2738                      .dwattr $C$DW$172, DW_AT_name("all")
    2739                      .dwattr $C$DW$172, DW_AT_TI_symbol_name("_all")
    2740                      .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2741                      .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    2742              $C$DW$173       .dwtag  DW_TAG_member
    2743                      .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$36)
    2744                      .dwattr $C$DW$173, DW_AT_name("bit")
    2745                      .dwattr $C$DW$173, DW_AT_TI_symbol_name("_bit")
    2746                      .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2747                      .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
    2748                      .dwendtag $C$DW$T$37
    2749              
    2750              
    2751              $C$DW$T$38      .dwtag  DW_TAG_structure_type
    2752                      .dwattr $C$DW$T$38, DW_AT_name("ETFRC_BITS")
    2753                      .dwattr $C$DW$T$38, DW_AT_byte_size(0x01)
    2754              $C$DW$174       .dwtag  DW_TAG_member
    2755                      .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$19)
    2756                      .dwattr $C$DW$174, DW_AT_name("INT")
    2757                      .dwattr $C$DW$174, DW_AT_TI_symbol_name("_INT")
    2758                      .dwattr $C$DW$174, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    2759                      .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2760                      .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
    2761              $C$DW$175       .dwtag  DW_TAG_member
    2762                      .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$19)
    2763                      .dwattr $C$DW$175, DW_AT_name("rsvd1")
    2764                      .dwattr $C$DW$175, DW_AT_TI_symbol_name("_rsvd1")
    2765                      .dwattr $C$DW$175, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    2766                      .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2767                      .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
    2768              $C$DW$176       .dwtag  DW_TAG_member
    2769                      .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$19)
    2770                      .dwattr $C$DW$176, DW_AT_name("SOCA")
    2771                      .dwattr $C$DW$176, DW_AT_TI_symbol_name("_SOCA")
    2772                      .dwattr $C$DW$176, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    2773                      .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2774                      .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
    2775              $C$DW$177       .dwtag  DW_TAG_member
    2776                      .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$19)
    2777                      .dwattr $C$DW$177, DW_AT_name("SOCB")
    2778                      .dwattr $C$DW$177, DW_AT_TI_symbol_name("_SOCB")
    2779                      .dwattr $C$DW$177, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    2780                      .dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2781                      .dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
    2782              $C$DW$178       .dwtag  DW_TAG_member
    2783                      .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$19)
    2784                      .dwattr $C$DW$178, DW_AT_name("rsvd2")
    2785                      .dwattr $C$DW$178, DW_AT_TI_symbol_name("_rsvd2")
    2786                      .dwattr $C$DW$178, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0c)
    2787                      .dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:03 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0471610                           PAGE   57

    2788                      .dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
    2789                      .dwendtag $C$DW$T$38
    2790              
    2791              
    2792              $C$DW$T$39      .dwtag  DW_TAG_union_type
    2793                      .dwattr $C$DW$T$39, DW_AT_name("ETFRC_REG")
    2794                      .dwattr $C$DW$T$39, DW_AT_byte_size(0x01)
    2795              $C$DW$179       .dwtag  DW_TAG_member
    2796                      .dwattr $C$DW$179, DW_AT_type(*$C$DW$T$19)
    2797                      .dwattr $C$DW$179, DW_AT_name("all")
    2798                      .dwattr $C$DW$179, DW_AT_TI_symbol_name("_all")
    2799                      .dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2800                      .dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
    2801              $C$DW$180       .dwtag  DW_TAG_member
    2802                      .dwattr $C$DW$180, DW_AT_type(*$C$DW$T$38)
    2803                      .dwattr $C$DW$180, DW_AT_name("bit")
    2804                      .dwattr $C$DW$180, DW_AT_TI_symbol_name("_bit")
    2805                      .dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2806                      .dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
    2807                      .dwendtag $C$DW$T$39
    2808              
    2809              
    2810              $C$DW$T$40      .dwtag  DW_TAG_structure_type
    2811                      .dwattr $C$DW$T$40, DW_AT_name("ETPS_BITS")
    2812                      .dwattr $C$DW$T$40, DW_AT_byte_size(0x01)
    2813              $C$DW$181       .dwtag  DW_TAG_member
    2814                      .dwattr $C$DW$181, DW_AT_type(*$C$DW$T$19)
    2815                      .dwattr $C$DW$181, DW_AT_name("INTPRD")
    2816                      .dwattr $C$DW$181, DW_AT_TI_symbol_name("_INTPRD")
    2817                      .dwattr $C$DW$181, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x02)
    2818                      .dwattr $C$DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2819                      .dwattr $C$DW$181, DW_AT_accessibility(DW_ACCESS_public)
    2820              $C$DW$182       .dwtag  DW_TAG_member
    2821                      .dwattr $C$DW$182, DW_AT_type(*$C$DW$T$19)
    2822                      .dwattr $C$DW$182, DW_AT_name("INTCNT")
    2823                      .dwattr $C$DW$182, DW_AT_TI_symbol_name("_INTCNT")
    2824                      .dwattr $C$DW$182, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x02)
    2825                      .dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2826                      .dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)
    2827              $C$DW$183       .dwtag  DW_TAG_member
    2828                      .dwattr $C$DW$183, DW_AT_type(*$C$DW$T$19)
    2829                      .dwattr $C$DW$183, DW_AT_name("rsvd1")
    2830                      .dwattr $C$DW$183, DW_AT_TI_symbol_name("_rsvd1")
    2831                      .dwattr $C$DW$183, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x04)
    2832                      .dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2833                      .dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
    2834              $C$DW$184       .dwtag  DW_TAG_member
    2835                      .dwattr $C$DW$184, DW_AT_type(*$C$DW$T$19)
    2836                      .dwattr $C$DW$184, DW_AT_name("SOCAPRD")
    2837                      .dwattr $C$DW$184, DW_AT_TI_symbol_name("_SOCAPRD")
    2838                      .dwattr $C$DW$184, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x02)
    2839                      .dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2840                      .dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
    2841              $C$DW$185       .dwtag  DW_TAG_member
    2842                      .dwattr $C$DW$185, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:03 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0471610                           PAGE   58

    2843                      .dwattr $C$DW$185, DW_AT_name("SOCACNT")
    2844                      .dwattr $C$DW$185, DW_AT_TI_symbol_name("_SOCACNT")
    2845                      .dwattr $C$DW$185, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x02)
    2846                      .dwattr $C$DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2847                      .dwattr $C$DW$185, DW_AT_accessibility(DW_ACCESS_public)
    2848              $C$DW$186       .dwtag  DW_TAG_member
    2849                      .dwattr $C$DW$186, DW_AT_type(*$C$DW$T$19)
    2850                      .dwattr $C$DW$186, DW_AT_name("SOCBPRD")
    2851                      .dwattr $C$DW$186, DW_AT_TI_symbol_name("_SOCBPRD")
    2852                      .dwattr $C$DW$186, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x02)
    2853                      .dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2854                      .dwattr $C$DW$186, DW_AT_accessibility(DW_ACCESS_public)
    2855              $C$DW$187       .dwtag  DW_TAG_member
    2856                      .dwattr $C$DW$187, DW_AT_type(*$C$DW$T$19)
    2857                      .dwattr $C$DW$187, DW_AT_name("SOCBCNT")
    2858                      .dwattr $C$DW$187, DW_AT_TI_symbol_name("_SOCBCNT")
    2859                      .dwattr $C$DW$187, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x02)
    2860                      .dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2861                      .dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)
    2862                      .dwendtag $C$DW$T$40
    2863              
    2864              
    2865              $C$DW$T$41      .dwtag  DW_TAG_union_type
    2866                      .dwattr $C$DW$T$41, DW_AT_name("ETPS_REG")
    2867                      .dwattr $C$DW$T$41, DW_AT_byte_size(0x01)
    2868              $C$DW$188       .dwtag  DW_TAG_member
    2869                      .dwattr $C$DW$188, DW_AT_type(*$C$DW$T$19)
    2870                      .dwattr $C$DW$188, DW_AT_name("all")
    2871                      .dwattr $C$DW$188, DW_AT_TI_symbol_name("_all")
    2872                      .dwattr $C$DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2873                      .dwattr $C$DW$188, DW_AT_accessibility(DW_ACCESS_public)
    2874              $C$DW$189       .dwtag  DW_TAG_member
    2875                      .dwattr $C$DW$189, DW_AT_type(*$C$DW$T$40)
    2876                      .dwattr $C$DW$189, DW_AT_name("bit")
    2877                      .dwattr $C$DW$189, DW_AT_TI_symbol_name("_bit")
    2878                      .dwattr $C$DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2879                      .dwattr $C$DW$189, DW_AT_accessibility(DW_ACCESS_public)
    2880                      .dwendtag $C$DW$T$41
    2881              
    2882              
    2883              $C$DW$T$42      .dwtag  DW_TAG_structure_type
    2884                      .dwattr $C$DW$T$42, DW_AT_name("ETSEL_BITS")
    2885                      .dwattr $C$DW$T$42, DW_AT_byte_size(0x01)
    2886              $C$DW$190       .dwtag  DW_TAG_member
    2887                      .dwattr $C$DW$190, DW_AT_type(*$C$DW$T$19)
    2888                      .dwattr $C$DW$190, DW_AT_name("INTSEL")
    2889                      .dwattr $C$DW$190, DW_AT_TI_symbol_name("_INTSEL")
    2890                      .dwattr $C$DW$190, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x03)
    2891                      .dwattr $C$DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2892                      .dwattr $C$DW$190, DW_AT_accessibility(DW_ACCESS_public)
    2893              $C$DW$191       .dwtag  DW_TAG_member
    2894                      .dwattr $C$DW$191, DW_AT_type(*$C$DW$T$19)
    2895                      .dwattr $C$DW$191, DW_AT_name("INTEN")
    2896                      .dwattr $C$DW$191, DW_AT_TI_symbol_name("_INTEN")
    2897                      .dwattr $C$DW$191, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:03 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0471610                           PAGE   59

    2898                      .dwattr $C$DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2899                      .dwattr $C$DW$191, DW_AT_accessibility(DW_ACCESS_public)
    2900              $C$DW$192       .dwtag  DW_TAG_member
    2901                      .dwattr $C$DW$192, DW_AT_type(*$C$DW$T$19)
    2902                      .dwattr $C$DW$192, DW_AT_name("rsvd1")
    2903                      .dwattr $C$DW$192, DW_AT_TI_symbol_name("_rsvd1")
    2904                      .dwattr $C$DW$192, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x04)
    2905                      .dwattr $C$DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2906                      .dwattr $C$DW$192, DW_AT_accessibility(DW_ACCESS_public)
    2907              $C$DW$193       .dwtag  DW_TAG_member
    2908                      .dwattr $C$DW$193, DW_AT_type(*$C$DW$T$19)
    2909                      .dwattr $C$DW$193, DW_AT_name("SOCASEL")
    2910                      .dwattr $C$DW$193, DW_AT_TI_symbol_name("_SOCASEL")
    2911                      .dwattr $C$DW$193, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x03)
    2912                      .dwattr $C$DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2913                      .dwattr $C$DW$193, DW_AT_accessibility(DW_ACCESS_public)
    2914              $C$DW$194       .dwtag  DW_TAG_member
    2915                      .dwattr $C$DW$194, DW_AT_type(*$C$DW$T$19)
    2916                      .dwattr $C$DW$194, DW_AT_name("SOCAEN")
    2917                      .dwattr $C$DW$194, DW_AT_TI_symbol_name("_SOCAEN")
    2918                      .dwattr $C$DW$194, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
    2919                      .dwattr $C$DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2920                      .dwattr $C$DW$194, DW_AT_accessibility(DW_ACCESS_public)
    2921              $C$DW$195       .dwtag  DW_TAG_member
    2922                      .dwattr $C$DW$195, DW_AT_type(*$C$DW$T$19)
    2923                      .dwattr $C$DW$195, DW_AT_name("SOCBSEL")
    2924                      .dwattr $C$DW$195, DW_AT_TI_symbol_name("_SOCBSEL")
    2925                      .dwattr $C$DW$195, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x03)
    2926                      .dwattr $C$DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2927                      .dwattr $C$DW$195, DW_AT_accessibility(DW_ACCESS_public)
    2928              $C$DW$196       .dwtag  DW_TAG_member
    2929                      .dwattr $C$DW$196, DW_AT_type(*$C$DW$T$19)
    2930                      .dwattr $C$DW$196, DW_AT_name("SOCBEN")
    2931                      .dwattr $C$DW$196, DW_AT_TI_symbol_name("_SOCBEN")
    2932                      .dwattr $C$DW$196, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    2933                      .dwattr $C$DW$196, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2934                      .dwattr $C$DW$196, DW_AT_accessibility(DW_ACCESS_public)
    2935                      .dwendtag $C$DW$T$42
    2936              
    2937              
    2938              $C$DW$T$43      .dwtag  DW_TAG_union_type
    2939                      .dwattr $C$DW$T$43, DW_AT_name("ETSEL_REG")
    2940                      .dwattr $C$DW$T$43, DW_AT_byte_size(0x01)
    2941              $C$DW$197       .dwtag  DW_TAG_member
    2942                      .dwattr $C$DW$197, DW_AT_type(*$C$DW$T$19)
    2943                      .dwattr $C$DW$197, DW_AT_name("all")
    2944                      .dwattr $C$DW$197, DW_AT_TI_symbol_name("_all")
    2945                      .dwattr $C$DW$197, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2946                      .dwattr $C$DW$197, DW_AT_accessibility(DW_ACCESS_public)
    2947              $C$DW$198       .dwtag  DW_TAG_member
    2948                      .dwattr $C$DW$198, DW_AT_type(*$C$DW$T$42)
    2949                      .dwattr $C$DW$198, DW_AT_name("bit")
    2950                      .dwattr $C$DW$198, DW_AT_TI_symbol_name("_bit")
    2951                      .dwattr $C$DW$198, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2952                      .dwattr $C$DW$198, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:03 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0471610                           PAGE   60

    2953                      .dwendtag $C$DW$T$43
    2954              
    2955              
    2956              $C$DW$T$44      .dwtag  DW_TAG_structure_type
    2957                      .dwattr $C$DW$T$44, DW_AT_name("GPA1_BITS")
    2958                      .dwattr $C$DW$T$44, DW_AT_byte_size(0x02)
    2959              $C$DW$199       .dwtag  DW_TAG_member
    2960                      .dwattr $C$DW$199, DW_AT_type(*$C$DW$T$19)
    2961                      .dwattr $C$DW$199, DW_AT_name("GPIO0")
    2962                      .dwattr $C$DW$199, DW_AT_TI_symbol_name("_GPIO0")
    2963                      .dwattr $C$DW$199, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x02)
    2964                      .dwattr $C$DW$199, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2965                      .dwattr $C$DW$199, DW_AT_accessibility(DW_ACCESS_public)
    2966              $C$DW$200       .dwtag  DW_TAG_member
    2967                      .dwattr $C$DW$200, DW_AT_type(*$C$DW$T$19)
    2968                      .dwattr $C$DW$200, DW_AT_name("GPIO1")
    2969                      .dwattr $C$DW$200, DW_AT_TI_symbol_name("_GPIO1")
    2970                      .dwattr $C$DW$200, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x02)
    2971                      .dwattr $C$DW$200, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2972                      .dwattr $C$DW$200, DW_AT_accessibility(DW_ACCESS_public)
    2973              $C$DW$201       .dwtag  DW_TAG_member
    2974                      .dwattr $C$DW$201, DW_AT_type(*$C$DW$T$19)
    2975                      .dwattr $C$DW$201, DW_AT_name("GPIO2")
    2976                      .dwattr $C$DW$201, DW_AT_TI_symbol_name("_GPIO2")
    2977                      .dwattr $C$DW$201, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x02)
    2978                      .dwattr $C$DW$201, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2979                      .dwattr $C$DW$201, DW_AT_accessibility(DW_ACCESS_public)
    2980              $C$DW$202       .dwtag  DW_TAG_member
    2981                      .dwattr $C$DW$202, DW_AT_type(*$C$DW$T$19)
    2982                      .dwattr $C$DW$202, DW_AT_name("GPIO3")
    2983                      .dwattr $C$DW$202, DW_AT_TI_symbol_name("_GPIO3")
    2984                      .dwattr $C$DW$202, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x02)
    2985                      .dwattr $C$DW$202, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2986                      .dwattr $C$DW$202, DW_AT_accessibility(DW_ACCESS_public)
    2987              $C$DW$203       .dwtag  DW_TAG_member
    2988                      .dwattr $C$DW$203, DW_AT_type(*$C$DW$T$19)
    2989                      .dwattr $C$DW$203, DW_AT_name("GPIO4")
    2990                      .dwattr $C$DW$203, DW_AT_TI_symbol_name("_GPIO4")
    2991                      .dwattr $C$DW$203, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x02)
    2992                      .dwattr $C$DW$203, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2993                      .dwattr $C$DW$203, DW_AT_accessibility(DW_ACCESS_public)
    2994              $C$DW$204       .dwtag  DW_TAG_member
    2995                      .dwattr $C$DW$204, DW_AT_type(*$C$DW$T$19)
    2996                      .dwattr $C$DW$204, DW_AT_name("GPIO5")
    2997                      .dwattr $C$DW$204, DW_AT_TI_symbol_name("_GPIO5")
    2998                      .dwattr $C$DW$204, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x02)
    2999                      .dwattr $C$DW$204, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3000                      .dwattr $C$DW$204, DW_AT_accessibility(DW_ACCESS_public)
    3001              $C$DW$205       .dwtag  DW_TAG_member
    3002                      .dwattr $C$DW$205, DW_AT_type(*$C$DW$T$19)
    3003                      .dwattr $C$DW$205, DW_AT_name("GPIO6")
    3004                      .dwattr $C$DW$205, DW_AT_TI_symbol_name("_GPIO6")
    3005                      .dwattr $C$DW$205, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x02)
    3006                      .dwattr $C$DW$205, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3007                      .dwattr $C$DW$205, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:03 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0471610                           PAGE   61

    3008              $C$DW$206       .dwtag  DW_TAG_member
    3009                      .dwattr $C$DW$206, DW_AT_type(*$C$DW$T$19)
    3010                      .dwattr $C$DW$206, DW_AT_name("GPIO7")
    3011                      .dwattr $C$DW$206, DW_AT_TI_symbol_name("_GPIO7")
    3012                      .dwattr $C$DW$206, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x02)
    3013                      .dwattr $C$DW$206, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3014                      .dwattr $C$DW$206, DW_AT_accessibility(DW_ACCESS_public)
    3015              $C$DW$207       .dwtag  DW_TAG_member
    3016                      .dwattr $C$DW$207, DW_AT_type(*$C$DW$T$19)
    3017                      .dwattr $C$DW$207, DW_AT_name("GPIO8")
    3018                      .dwattr $C$DW$207, DW_AT_TI_symbol_name("_GPIO8")
    3019                      .dwattr $C$DW$207, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x02)
    3020                      .dwattr $C$DW$207, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3021                      .dwattr $C$DW$207, DW_AT_accessibility(DW_ACCESS_public)
    3022              $C$DW$208       .dwtag  DW_TAG_member
    3023                      .dwattr $C$DW$208, DW_AT_type(*$C$DW$T$19)
    3024                      .dwattr $C$DW$208, DW_AT_name("GPIO9")
    3025                      .dwattr $C$DW$208, DW_AT_TI_symbol_name("_GPIO9")
    3026                      .dwattr $C$DW$208, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x02)
    3027                      .dwattr $C$DW$208, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3028                      .dwattr $C$DW$208, DW_AT_accessibility(DW_ACCESS_public)
    3029              $C$DW$209       .dwtag  DW_TAG_member
    3030                      .dwattr $C$DW$209, DW_AT_type(*$C$DW$T$19)
    3031                      .dwattr $C$DW$209, DW_AT_name("GPIO10")
    3032                      .dwattr $C$DW$209, DW_AT_TI_symbol_name("_GPIO10")
    3033                      .dwattr $C$DW$209, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x02)
    3034                      .dwattr $C$DW$209, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3035                      .dwattr $C$DW$209, DW_AT_accessibility(DW_ACCESS_public)
    3036              $C$DW$210       .dwtag  DW_TAG_member
    3037                      .dwattr $C$DW$210, DW_AT_type(*$C$DW$T$19)
    3038                      .dwattr $C$DW$210, DW_AT_name("GPIO11")
    3039                      .dwattr $C$DW$210, DW_AT_TI_symbol_name("_GPIO11")
    3040                      .dwattr $C$DW$210, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x02)
    3041                      .dwattr $C$DW$210, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3042                      .dwattr $C$DW$210, DW_AT_accessibility(DW_ACCESS_public)
    3043              $C$DW$211       .dwtag  DW_TAG_member
    3044                      .dwattr $C$DW$211, DW_AT_type(*$C$DW$T$19)
    3045                      .dwattr $C$DW$211, DW_AT_name("GPIO12")
    3046                      .dwattr $C$DW$211, DW_AT_TI_symbol_name("_GPIO12")
    3047                      .dwattr $C$DW$211, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x02)
    3048                      .dwattr $C$DW$211, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3049                      .dwattr $C$DW$211, DW_AT_accessibility(DW_ACCESS_public)
    3050              $C$DW$212       .dwtag  DW_TAG_member
    3051                      .dwattr $C$DW$212, DW_AT_type(*$C$DW$T$19)
    3052                      .dwattr $C$DW$212, DW_AT_name("GPIO13")
    3053                      .dwattr $C$DW$212, DW_AT_TI_symbol_name("_GPIO13")
    3054                      .dwattr $C$DW$212, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x02)
    3055                      .dwattr $C$DW$212, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3056                      .dwattr $C$DW$212, DW_AT_accessibility(DW_ACCESS_public)
    3057              $C$DW$213       .dwtag  DW_TAG_member
    3058                      .dwattr $C$DW$213, DW_AT_type(*$C$DW$T$19)
    3059                      .dwattr $C$DW$213, DW_AT_name("GPIO14")
    3060                      .dwattr $C$DW$213, DW_AT_TI_symbol_name("_GPIO14")
    3061                      .dwattr $C$DW$213, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x02)
    3062                      .dwattr $C$DW$213, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:03 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0471610                           PAGE   62

    3063                      .dwattr $C$DW$213, DW_AT_accessibility(DW_ACCESS_public)
    3064              $C$DW$214       .dwtag  DW_TAG_member
    3065                      .dwattr $C$DW$214, DW_AT_type(*$C$DW$T$19)
    3066                      .dwattr $C$DW$214, DW_AT_name("GPIO15")
    3067                      .dwattr $C$DW$214, DW_AT_TI_symbol_name("_GPIO15")
    3068                      .dwattr $C$DW$214, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x02)
    3069                      .dwattr $C$DW$214, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3070                      .dwattr $C$DW$214, DW_AT_accessibility(DW_ACCESS_public)
    3071                      .dwendtag $C$DW$T$44
    3072              
    3073              
    3074              $C$DW$T$45      .dwtag  DW_TAG_union_type
    3075                      .dwattr $C$DW$T$45, DW_AT_name("GPA1_REG")
    3076                      .dwattr $C$DW$T$45, DW_AT_byte_size(0x02)
    3077              $C$DW$215       .dwtag  DW_TAG_member
    3078                      .dwattr $C$DW$215, DW_AT_type(*$C$DW$T$26)
    3079                      .dwattr $C$DW$215, DW_AT_name("all")
    3080                      .dwattr $C$DW$215, DW_AT_TI_symbol_name("_all")
    3081                      .dwattr $C$DW$215, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3082                      .dwattr $C$DW$215, DW_AT_accessibility(DW_ACCESS_public)
    3083              $C$DW$216       .dwtag  DW_TAG_member
    3084                      .dwattr $C$DW$216, DW_AT_type(*$C$DW$T$44)
    3085                      .dwattr $C$DW$216, DW_AT_name("bit")
    3086                      .dwattr $C$DW$216, DW_AT_TI_symbol_name("_bit")
    3087                      .dwattr $C$DW$216, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3088                      .dwattr $C$DW$216, DW_AT_accessibility(DW_ACCESS_public)
    3089                      .dwendtag $C$DW$T$45
    3090              
    3091              
    3092              $C$DW$T$46      .dwtag  DW_TAG_structure_type
    3093                      .dwattr $C$DW$T$46, DW_AT_name("GPA2_BITS")
    3094                      .dwattr $C$DW$T$46, DW_AT_byte_size(0x02)
    3095              $C$DW$217       .dwtag  DW_TAG_member
    3096                      .dwattr $C$DW$217, DW_AT_type(*$C$DW$T$19)
    3097                      .dwattr $C$DW$217, DW_AT_name("GPIO16")
    3098                      .dwattr $C$DW$217, DW_AT_TI_symbol_name("_GPIO16")
    3099                      .dwattr $C$DW$217, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x02)
    3100                      .dwattr $C$DW$217, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3101                      .dwattr $C$DW$217, DW_AT_accessibility(DW_ACCESS_public)
    3102              $C$DW$218       .dwtag  DW_TAG_member
    3103                      .dwattr $C$DW$218, DW_AT_type(*$C$DW$T$19)
    3104                      .dwattr $C$DW$218, DW_AT_name("GPIO17")
    3105                      .dwattr $C$DW$218, DW_AT_TI_symbol_name("_GPIO17")
    3106                      .dwattr $C$DW$218, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x02)
    3107                      .dwattr $C$DW$218, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3108                      .dwattr $C$DW$218, DW_AT_accessibility(DW_ACCESS_public)
    3109              $C$DW$219       .dwtag  DW_TAG_member
    3110                      .dwattr $C$DW$219, DW_AT_type(*$C$DW$T$19)
    3111                      .dwattr $C$DW$219, DW_AT_name("GPIO18")
    3112                      .dwattr $C$DW$219, DW_AT_TI_symbol_name("_GPIO18")
    3113                      .dwattr $C$DW$219, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x02)
    3114                      .dwattr $C$DW$219, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3115                      .dwattr $C$DW$219, DW_AT_accessibility(DW_ACCESS_public)
    3116              $C$DW$220       .dwtag  DW_TAG_member
    3117                      .dwattr $C$DW$220, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:03 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0471610                           PAGE   63

    3118                      .dwattr $C$DW$220, DW_AT_name("GPIO19")
    3119                      .dwattr $C$DW$220, DW_AT_TI_symbol_name("_GPIO19")
    3120                      .dwattr $C$DW$220, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x02)
    3121                      .dwattr $C$DW$220, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3122                      .dwattr $C$DW$220, DW_AT_accessibility(DW_ACCESS_public)
    3123              $C$DW$221       .dwtag  DW_TAG_member
    3124                      .dwattr $C$DW$221, DW_AT_type(*$C$DW$T$19)
    3125                      .dwattr $C$DW$221, DW_AT_name("GPIO20")
    3126                      .dwattr $C$DW$221, DW_AT_TI_symbol_name("_GPIO20")
    3127                      .dwattr $C$DW$221, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x02)
    3128                      .dwattr $C$DW$221, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3129                      .dwattr $C$DW$221, DW_AT_accessibility(DW_ACCESS_public)
    3130              $C$DW$222       .dwtag  DW_TAG_member
    3131                      .dwattr $C$DW$222, DW_AT_type(*$C$DW$T$19)
    3132                      .dwattr $C$DW$222, DW_AT_name("GPIO21")
    3133                      .dwattr $C$DW$222, DW_AT_TI_symbol_name("_GPIO21")
    3134                      .dwattr $C$DW$222, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x02)
    3135                      .dwattr $C$DW$222, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3136                      .dwattr $C$DW$222, DW_AT_accessibility(DW_ACCESS_public)
    3137              $C$DW$223       .dwtag  DW_TAG_member
    3138                      .dwattr $C$DW$223, DW_AT_type(*$C$DW$T$19)
    3139                      .dwattr $C$DW$223, DW_AT_name("GPIO22")
    3140                      .dwattr $C$DW$223, DW_AT_TI_symbol_name("_GPIO22")
    3141                      .dwattr $C$DW$223, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x02)
    3142                      .dwattr $C$DW$223, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3143                      .dwattr $C$DW$223, DW_AT_accessibility(DW_ACCESS_public)
    3144              $C$DW$224       .dwtag  DW_TAG_member
    3145                      .dwattr $C$DW$224, DW_AT_type(*$C$DW$T$19)
    3146                      .dwattr $C$DW$224, DW_AT_name("GPIO23")
    3147                      .dwattr $C$DW$224, DW_AT_TI_symbol_name("_GPIO23")
    3148                      .dwattr $C$DW$224, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x02)
    3149                      .dwattr $C$DW$224, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3150                      .dwattr $C$DW$224, DW_AT_accessibility(DW_ACCESS_public)
    3151              $C$DW$225       .dwtag  DW_TAG_member
    3152                      .dwattr $C$DW$225, DW_AT_type(*$C$DW$T$19)
    3153                      .dwattr $C$DW$225, DW_AT_name("GPIO24")
    3154                      .dwattr $C$DW$225, DW_AT_TI_symbol_name("_GPIO24")
    3155                      .dwattr $C$DW$225, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x02)
    3156                      .dwattr $C$DW$225, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3157                      .dwattr $C$DW$225, DW_AT_accessibility(DW_ACCESS_public)
    3158              $C$DW$226       .dwtag  DW_TAG_member
    3159                      .dwattr $C$DW$226, DW_AT_type(*$C$DW$T$19)
    3160                      .dwattr $C$DW$226, DW_AT_name("GPIO25")
    3161                      .dwattr $C$DW$226, DW_AT_TI_symbol_name("_GPIO25")
    3162                      .dwattr $C$DW$226, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x02)
    3163                      .dwattr $C$DW$226, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3164                      .dwattr $C$DW$226, DW_AT_accessibility(DW_ACCESS_public)
    3165              $C$DW$227       .dwtag  DW_TAG_member
    3166                      .dwattr $C$DW$227, DW_AT_type(*$C$DW$T$19)
    3167                      .dwattr $C$DW$227, DW_AT_name("GPIO26")
    3168                      .dwattr $C$DW$227, DW_AT_TI_symbol_name("_GPIO26")
    3169                      .dwattr $C$DW$227, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x02)
    3170                      .dwattr $C$DW$227, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3171                      .dwattr $C$DW$227, DW_AT_accessibility(DW_ACCESS_public)
    3172              $C$DW$228       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:03 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0471610                           PAGE   64

    3173                      .dwattr $C$DW$228, DW_AT_type(*$C$DW$T$19)
    3174                      .dwattr $C$DW$228, DW_AT_name("GPIO27")
    3175                      .dwattr $C$DW$228, DW_AT_TI_symbol_name("_GPIO27")
    3176                      .dwattr $C$DW$228, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x02)
    3177                      .dwattr $C$DW$228, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3178                      .dwattr $C$DW$228, DW_AT_accessibility(DW_ACCESS_public)
    3179              $C$DW$229       .dwtag  DW_TAG_member
    3180                      .dwattr $C$DW$229, DW_AT_type(*$C$DW$T$19)
    3181                      .dwattr $C$DW$229, DW_AT_name("GPIO28")
    3182                      .dwattr $C$DW$229, DW_AT_TI_symbol_name("_GPIO28")
    3183                      .dwattr $C$DW$229, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x02)
    3184                      .dwattr $C$DW$229, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3185                      .dwattr $C$DW$229, DW_AT_accessibility(DW_ACCESS_public)
    3186              $C$DW$230       .dwtag  DW_TAG_member
    3187                      .dwattr $C$DW$230, DW_AT_type(*$C$DW$T$19)
    3188                      .dwattr $C$DW$230, DW_AT_name("GPIO29")
    3189                      .dwattr $C$DW$230, DW_AT_TI_symbol_name("_GPIO29")
    3190                      .dwattr $C$DW$230, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x02)
    3191                      .dwattr $C$DW$230, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3192                      .dwattr $C$DW$230, DW_AT_accessibility(DW_ACCESS_public)
    3193              $C$DW$231       .dwtag  DW_TAG_member
    3194                      .dwattr $C$DW$231, DW_AT_type(*$C$DW$T$19)
    3195                      .dwattr $C$DW$231, DW_AT_name("GPIO30")
    3196                      .dwattr $C$DW$231, DW_AT_TI_symbol_name("_GPIO30")
    3197                      .dwattr $C$DW$231, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x02)
    3198                      .dwattr $C$DW$231, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3199                      .dwattr $C$DW$231, DW_AT_accessibility(DW_ACCESS_public)
    3200              $C$DW$232       .dwtag  DW_TAG_member
    3201                      .dwattr $C$DW$232, DW_AT_type(*$C$DW$T$19)
    3202                      .dwattr $C$DW$232, DW_AT_name("GPIO31")
    3203                      .dwattr $C$DW$232, DW_AT_TI_symbol_name("_GPIO31")
    3204                      .dwattr $C$DW$232, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x02)
    3205                      .dwattr $C$DW$232, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3206                      .dwattr $C$DW$232, DW_AT_accessibility(DW_ACCESS_public)
    3207                      .dwendtag $C$DW$T$46
    3208              
    3209              
    3210              $C$DW$T$47      .dwtag  DW_TAG_union_type
    3211                      .dwattr $C$DW$T$47, DW_AT_name("GPA2_REG")
    3212                      .dwattr $C$DW$T$47, DW_AT_byte_size(0x02)
    3213              $C$DW$233       .dwtag  DW_TAG_member
    3214                      .dwattr $C$DW$233, DW_AT_type(*$C$DW$T$26)
    3215                      .dwattr $C$DW$233, DW_AT_name("all")
    3216                      .dwattr $C$DW$233, DW_AT_TI_symbol_name("_all")
    3217                      .dwattr $C$DW$233, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3218                      .dwattr $C$DW$233, DW_AT_accessibility(DW_ACCESS_public)
    3219              $C$DW$234       .dwtag  DW_TAG_member
    3220                      .dwattr $C$DW$234, DW_AT_type(*$C$DW$T$46)
    3221                      .dwattr $C$DW$234, DW_AT_name("bit")
    3222                      .dwattr $C$DW$234, DW_AT_TI_symbol_name("_bit")
    3223                      .dwattr $C$DW$234, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3224                      .dwattr $C$DW$234, DW_AT_accessibility(DW_ACCESS_public)
    3225                      .dwendtag $C$DW$T$47
    3226              
    3227              
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:03 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0471610                           PAGE   65

    3228              $C$DW$T$48      .dwtag  DW_TAG_structure_type
    3229                      .dwattr $C$DW$T$48, DW_AT_name("GPACTRL_BITS")
    3230                      .dwattr $C$DW$T$48, DW_AT_byte_size(0x02)
    3231              $C$DW$235       .dwtag  DW_TAG_member
    3232                      .dwattr $C$DW$235, DW_AT_type(*$C$DW$T$19)
    3233                      .dwattr $C$DW$235, DW_AT_name("QUALPRD0")
    3234                      .dwattr $C$DW$235, DW_AT_TI_symbol_name("_QUALPRD0")
    3235                      .dwattr $C$DW$235, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x08)
    3236                      .dwattr $C$DW$235, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3237                      .dwattr $C$DW$235, DW_AT_accessibility(DW_ACCESS_public)
    3238              $C$DW$236       .dwtag  DW_TAG_member
    3239                      .dwattr $C$DW$236, DW_AT_type(*$C$DW$T$19)
    3240                      .dwattr $C$DW$236, DW_AT_name("QUALPRD1")
    3241                      .dwattr $C$DW$236, DW_AT_TI_symbol_name("_QUALPRD1")
    3242                      .dwattr $C$DW$236, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x08)
    3243                      .dwattr $C$DW$236, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3244                      .dwattr $C$DW$236, DW_AT_accessibility(DW_ACCESS_public)
    3245              $C$DW$237       .dwtag  DW_TAG_member
    3246                      .dwattr $C$DW$237, DW_AT_type(*$C$DW$T$19)
    3247                      .dwattr $C$DW$237, DW_AT_name("QUALPRD2")
    3248                      .dwattr $C$DW$237, DW_AT_TI_symbol_name("_QUALPRD2")
    3249                      .dwattr $C$DW$237, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x08)
    3250                      .dwattr $C$DW$237, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    3251                      .dwattr $C$DW$237, DW_AT_accessibility(DW_ACCESS_public)
    3252              $C$DW$238       .dwtag  DW_TAG_member
    3253                      .dwattr $C$DW$238, DW_AT_type(*$C$DW$T$19)
    3254                      .dwattr $C$DW$238, DW_AT_name("QUALPRD3")
