TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:14 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0371210                           PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v6.2.7 *
       3              ;* Date/Time created: Thu Jul 02 08:31:14 2015                 *
       4              ;***************************************************************
       5                      .compiler_opts --diag_wrap=off --float_support=fpu32 --hll_source=on --mem_model:code=flat --mem_mode
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("../SysTimer/SysTime.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v6.2.7 Copyright (c) 1996-2014 Texas I
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("D:\ActiveProject\EKT5\PKMT_NONBIOS\InvertorCntrl\ISPprg")
      13                      .global _SystemTime
      14 00000000       _SystemTime:    .usect  ".ebss",2,1,1
      15              $C$DW$1 .dwtag  DW_TAG_variable, DW_AT_name("SystemTime")
      16                      .dwattr $C$DW$1, DW_AT_TI_symbol_name("_SystemTime")

     647                      .dwpsn  file "../SysTimer/SysTime.c",line 147,column 10,is_stmt
     648 00000080 0644          MOVL      ACC,*-SP[4]           ; [CPU_] |147| 
     649 00000081 EC11          BF        $C$L12,EQ             ; [CPU_] |147| 
     650                      ; branchcc occurs ; [] |147| 
     651 00000082       $C$L10:    
     652                      .dwpsn  file "../SysTimer/SysTime.c",line 148,column 5,is_stmt
     653 00000082 8A44          MOVL      XAR4,*-SP[4]          ; [CPU_] |148| 
     654 00000083 C4D4          MOVL      XAR6,*+XAR4[2]        ; [CPU_] |148| 
     655 00000084 0642          MOVL      ACC,*-SP[2]           ; [CPU_] |148| 
     656 00000085 0FA6          CMPL      ACC,XAR6              ; [CPU_] |148| 
     657 00000086 ED07          BF        $C$L11,NEQ            ; [CPU_] |148| 
     658                      ; branchcc occurs ; [] |148| 
     659                      .dwpsn  file "../SysTimer/SysTime.c",line 149,column 6,is_stmt
     660 00000087 8A42          MOVL      XAR4,*-SP[2]          ; [CPU_] |149| 
     661 00000088 8344          MOVL      XAR5,*-SP[4]          ; [CPU_] |149| 
     662 00000089 06D4          MOVL      ACC,*+XAR4[2]         ; [CPU_] |149| 
     663 0000008a 1ED5          MOVL      *+XAR5[2],ACC         ; [CPU_] |149| 
     664                      .dwpsn  file "../SysTimer/SysTime.c",line 150,column 6,is_stmt
     665 0000008b 9A01          MOVB      AL,#1                 ; [CPU_] |150| 
     666 0000008c 6F0C          B         $C$L14,UNC            ; [CPU_] |150| 
     667                      ; branch occurs ; [] |150| 
     668 0000008d       $C$L11:    
     669                      .dwpsn  file "../SysTimer/SysTime.c",line 152,column 5,is_stmt
     670 0000008d 8A44          MOVL      XAR4,*-SP[4]          ; [CPU_] |152| 
     671 0000008e 06D4          MOVL      ACC,*+XAR4[2]         ; [CPU_] |152| 
     672 0000008f 1E44          MOVL      *-SP[4],ACC           ; [CPU_] |152| 
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:14 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0371210                           PAGE   14

     673                      .dwpsn  file "../SysTimer/SysTime.c",line 147,column 10,is_stmt
     674 00000090 0644          MOVL      ACC,*-SP[4]           ; [CPU_] |147| 
     675 00000091 EDF1          BF        $C$L10,NEQ            ; [CPU_] |147| 
     676                      ; branchcc occurs ; [] |147| 
     677 00000092       $C$L12:    
     678                      .dwpsn  file "../SysTimer/SysTime.c",line 154,column 4,is_stmt
     679 00000092 28A9          MOV       AL,#-1                ; [CPU_] |154| 
         00000093 FFFF 
     680 00000094 6F04          B         $C$L14,UNC            ; [CPU_] |154| 
     681                      ; branch occurs ; [] |154| 
     682 00000095       $C$L13:    
     683                      .dwpsn  file "../SysTimer/SysTime.c",line 157,column 2,is_stmt
     684              $C$DW$33        .dwtag  DW_TAG_TI_branch
     685                      .dwattr $C$DW$33, DW_AT_low_pc(0x00)
     686                      .dwattr $C$DW$33, DW_AT_name("_unprotectSysTimer")
     687                      .dwattr $C$DW$33, DW_AT_TI_call
     688 00000095 7640'         LCR       #_unprotectSysTimer   ; [CPU_] |157| 
         00000096 0048 
     689                      ; call occurs [#_unprotectSysTimer] ; [] |157| 
     690                      .dwpsn  file "../SysTimer/SysTime.c",line 158,column 2,is_stmt
     691 00000097 9A01          MOVB      AL,#1                 ; [CPU_] |158| 
     692 00000098       $C$L14:    
     693                      .dwpsn  file "../SysTimer/SysTime.c",line 159,column 1,is_stmt
     694 00000098 FE84          SUBB      SP,#4                 ; [CPU_U] 
     695                      .dwcfi  cfa_offset, -2
     696              $C$DW$34        .dwtag  DW_TAG_TI_branch
     697                      .dwattr $C$DW$34, DW_AT_low_pc(0x00)
     698                      .dwattr $C$DW$34, DW_AT_TI_return
     699 00000099 0006          LRETR     ; [CPU_] 
     700                      ; return occurs ; [] 
     701                      .dwattr $C$DW$28, DW_AT_TI_end_file("../SysTimer/SysTime.c")
     702                      .dwattr $C$DW$28, DW_AT_TI_end_line(0x9f)
     703                      .dwattr $C$DW$28, DW_AT_TI_end_column(0x01)
     704                      .dwendentry
     705                      .dwendtag $C$DW$28
     706              
     707              ;**************************************************************
     708              ;* UNDEFINED EXTERNAL REFERENCES                              *
     709              ;**************************************************************
     710                      .global _CpuTimer0Regs
     711                      .global _CpuTimer1Regs
     712                      .global _PieCtrlRegs
     713                      .global _PieVectTable
     714              
     715              ;***************************************************************
     716              ;* TYPE INFORMATION                                            *
     717              ;***************************************************************
     718              
     719              $C$DW$T$20      .dwtag  DW_TAG_structure_type
     720                      .dwattr $C$DW$T$20, DW_AT_name("CPUTIMER_REGS")
     721                      .dwattr $C$DW$T$20, DW_AT_byte_size(0x08)
     722              $C$DW$35        .dwtag  DW_TAG_member
     723                      .dwattr $C$DW$35, DW_AT_type(*$C$DW$T$39)
     724                      .dwattr $C$DW$35, DW_AT_name("TIM")
     725                      .dwattr $C$DW$35, DW_AT_TI_symbol_name("_TIM")
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:14 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0371210                           PAGE   15

     726                      .dwattr $C$DW$35, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     727                      .dwattr $C$DW$35, DW_AT_accessibility(DW_ACCESS_public)
     728              $C$DW$36        .dwtag  DW_TAG_member
     729                      .dwattr $C$DW$36, DW_AT_type(*$C$DW$T$35)
     730                      .dwattr $C$DW$36, DW_AT_name("PRD")
     731                      .dwattr $C$DW$36, DW_AT_TI_symbol_name("_PRD")
     732                      .dwattr $C$DW$36, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
     733                      .dwattr $C$DW$36, DW_AT_accessibility(DW_ACCESS_public)
     734              $C$DW$37        .dwtag  DW_TAG_member
     735                      .dwattr $C$DW$37, DW_AT_type(*$C$DW$T$38)
     736                      .dwattr $C$DW$37, DW_AT_name("TCR")
     737                      .dwattr $C$DW$37, DW_AT_TI_symbol_name("_TCR")
     738                      .dwattr $C$DW$37, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     739                      .dwattr $C$DW$37, DW_AT_accessibility(DW_ACCESS_public)
     740              $C$DW$38        .dwtag  DW_TAG_member
     741                      .dwattr $C$DW$38, DW_AT_type(*$C$DW$T$19)
     742                      .dwattr $C$DW$38, DW_AT_name("rsvd1")
     743                      .dwattr $C$DW$38, DW_AT_TI_symbol_name("_rsvd1")
     744                      .dwattr $C$DW$38, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
     745                      .dwattr $C$DW$38, DW_AT_accessibility(DW_ACCESS_public)
     746              $C$DW$39        .dwtag  DW_TAG_member
     747                      .dwattr $C$DW$39, DW_AT_type(*$C$DW$T$44)
     748                      .dwattr $C$DW$39, DW_AT_name("TPR")
     749                      .dwattr $C$DW$39, DW_AT_TI_symbol_name("_TPR")
     750                      .dwattr $C$DW$39, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
     751                      .dwattr $C$DW$39, DW_AT_accessibility(DW_ACCESS_public)
     752              $C$DW$40        .dwtag  DW_TAG_member
     753                      .dwattr $C$DW$40, DW_AT_type(*$C$DW$T$42)
     754                      .dwattr $C$DW$40, DW_AT_name("TPRH")
     755                      .dwattr $C$DW$40, DW_AT_TI_symbol_name("_TPRH")
     756                      .dwattr $C$DW$40, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
     757                      .dwattr $C$DW$40, DW_AT_accessibility(DW_ACCESS_public)
     758                      .dwendtag $C$DW$T$20
     759              
     760              $C$DW$41        .dwtag  DW_TAG_TI_far_type
     761                      .dwattr $C$DW$41, DW_AT_type(*$C$DW$T$20)
     762              $C$DW$T$49      .dwtag  DW_TAG_volatile_type
     763                      .dwattr $C$DW$T$49, DW_AT_type(*$C$DW$41)
     764              
     765              $C$DW$T$21      .dwtag  DW_TAG_structure_type
     766                      .dwattr $C$DW$T$21, DW_AT_name("PIEACK_BITS")
     767                      .dwattr $C$DW$T$21, DW_AT_byte_size(0x01)
     768              $C$DW$42        .dwtag  DW_TAG_member
     769                      .dwattr $C$DW$42, DW_AT_type(*$C$DW$T$19)
     770                      .dwattr $C$DW$42, DW_AT_name("ACK1")
     771                      .dwattr $C$DW$42, DW_AT_TI_symbol_name("_ACK1")
     772                      .dwattr $C$DW$42, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
     773                      .dwattr $C$DW$42, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     774                      .dwattr $C$DW$42, DW_AT_accessibility(DW_ACCESS_public)
     775              $C$DW$43        .dwtag  DW_TAG_member
     776                      .dwattr $C$DW$43, DW_AT_type(*$C$DW$T$19)
     777                      .dwattr $C$DW$43, DW_AT_name("ACK2")
     778                      .dwattr $C$DW$43, DW_AT_TI_symbol_name("_ACK2")
     779                      .dwattr $C$DW$43, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
     780                      .dwattr $C$DW$43, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:14 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0371210                           PAGE   16

     781                      .dwattr $C$DW$43, DW_AT_accessibility(DW_ACCESS_public)
     782              $C$DW$44        .dwtag  DW_TAG_member
     783                      .dwattr $C$DW$44, DW_AT_type(*$C$DW$T$19)
     784                      .dwattr $C$DW$44, DW_AT_name("ACK3")
     785                      .dwattr $C$DW$44, DW_AT_TI_symbol_name("_ACK3")
     786                      .dwattr $C$DW$44, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
     787                      .dwattr $C$DW$44, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     788                      .dwattr $C$DW$44, DW_AT_accessibility(DW_ACCESS_public)
     789              $C$DW$45        .dwtag  DW_TAG_member
     790                      .dwattr $C$DW$45, DW_AT_type(*$C$DW$T$19)
     791                      .dwattr $C$DW$45, DW_AT_name("ACK4")
     792                      .dwattr $C$DW$45, DW_AT_TI_symbol_name("_ACK4")
     793                      .dwattr $C$DW$45, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
     794                      .dwattr $C$DW$45, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     795                      .dwattr $C$DW$45, DW_AT_accessibility(DW_ACCESS_public)
     796              $C$DW$46        .dwtag  DW_TAG_member
     797                      .dwattr $C$DW$46, DW_AT_type(*$C$DW$T$19)
     798                      .dwattr $C$DW$46, DW_AT_name("ACK5")
     799                      .dwattr $C$DW$46, DW_AT_TI_symbol_name("_ACK5")
     800                      .dwattr $C$DW$46, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
     801                      .dwattr $C$DW$46, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     802                      .dwattr $C$DW$46, DW_AT_accessibility(DW_ACCESS_public)
     803              $C$DW$47        .dwtag  DW_TAG_member
     804                      .dwattr $C$DW$47, DW_AT_type(*$C$DW$T$19)
     805                      .dwattr $C$DW$47, DW_AT_name("ACK6")
     806                      .dwattr $C$DW$47, DW_AT_TI_symbol_name("_ACK6")
     807                      .dwattr $C$DW$47, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
     808                      .dwattr $C$DW$47, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     809                      .dwattr $C$DW$47, DW_AT_accessibility(DW_ACCESS_public)
     810              $C$DW$48        .dwtag  DW_TAG_member
     811                      .dwattr $C$DW$48, DW_AT_type(*$C$DW$T$19)
     812                      .dwattr $C$DW$48, DW_AT_name("ACK7")
     813                      .dwattr $C$DW$48, DW_AT_TI_symbol_name("_ACK7")
     814                      .dwattr $C$DW$48, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
     815                      .dwattr $C$DW$48, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     816                      .dwattr $C$DW$48, DW_AT_accessibility(DW_ACCESS_public)
     817              $C$DW$49        .dwtag  DW_TAG_member
     818                      .dwattr $C$DW$49, DW_AT_type(*$C$DW$T$19)
     819                      .dwattr $C$DW$49, DW_AT_name("ACK8")
     820                      .dwattr $C$DW$49, DW_AT_TI_symbol_name("_ACK8")
     821                      .dwattr $C$DW$49, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
     822                      .dwattr $C$DW$49, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     823                      .dwattr $C$DW$49, DW_AT_accessibility(DW_ACCESS_public)
     824              $C$DW$50        .dwtag  DW_TAG_member
     825                      .dwattr $C$DW$50, DW_AT_type(*$C$DW$T$19)
     826                      .dwattr $C$DW$50, DW_AT_name("ACK9")
     827                      .dwattr $C$DW$50, DW_AT_TI_symbol_name("_ACK9")
     828                      .dwattr $C$DW$50, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
     829                      .dwattr $C$DW$50, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     830                      .dwattr $C$DW$50, DW_AT_accessibility(DW_ACCESS_public)
     831              $C$DW$51        .dwtag  DW_TAG_member
     832                      .dwattr $C$DW$51, DW_AT_type(*$C$DW$T$19)
     833                      .dwattr $C$DW$51, DW_AT_name("ACK10")
     834                      .dwattr $C$DW$51, DW_AT_TI_symbol_name("_ACK10")
     835                      .dwattr $C$DW$51, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:14 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0371210                           PAGE   17

     836                      .dwattr $C$DW$51, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     837                      .dwattr $C$DW$51, DW_AT_accessibility(DW_ACCESS_public)
     838              $C$DW$52        .dwtag  DW_TAG_member
     839                      .dwattr $C$DW$52, DW_AT_type(*$C$DW$T$19)
     840                      .dwattr $C$DW$52, DW_AT_name("ACK11")
     841                      .dwattr $C$DW$52, DW_AT_TI_symbol_name("_ACK11")
     842                      .dwattr $C$DW$52, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
     843                      .dwattr $C$DW$52, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     844                      .dwattr $C$DW$52, DW_AT_accessibility(DW_ACCESS_public)
     845              $C$DW$53        .dwtag  DW_TAG_member
     846                      .dwattr $C$DW$53, DW_AT_type(*$C$DW$T$19)
     847                      .dwattr $C$DW$53, DW_AT_name("ACK12")
     848                      .dwattr $C$DW$53, DW_AT_TI_symbol_name("_ACK12")
     849                      .dwattr $C$DW$53, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
     850                      .dwattr $C$DW$53, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     851                      .dwattr $C$DW$53, DW_AT_accessibility(DW_ACCESS_public)
     852              $C$DW$54        .dwtag  DW_TAG_member
     853                      .dwattr $C$DW$54, DW_AT_type(*$C$DW$T$19)
     854                      .dwattr $C$DW$54, DW_AT_name("rsvd")
     855                      .dwattr $C$DW$54, DW_AT_TI_symbol_name("_rsvd")
     856                      .dwattr $C$DW$54, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x04)
     857                      .dwattr $C$DW$54, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     858                      .dwattr $C$DW$54, DW_AT_accessibility(DW_ACCESS_public)
     859                      .dwendtag $C$DW$T$21
     860              
     861              
     862              $C$DW$T$22      .dwtag  DW_TAG_union_type
     863                      .dwattr $C$DW$T$22, DW_AT_name("PIEACK_REG")
     864                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x01)
     865              $C$DW$55        .dwtag  DW_TAG_member
     866                      .dwattr $C$DW$55, DW_AT_type(*$C$DW$T$19)
     867                      .dwattr $C$DW$55, DW_AT_name("all")
     868                      .dwattr $C$DW$55, DW_AT_TI_symbol_name("_all")
     869                      .dwattr $C$DW$55, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     870                      .dwattr $C$DW$55, DW_AT_accessibility(DW_ACCESS_public)
     871              $C$DW$56        .dwtag  DW_TAG_member
     872                      .dwattr $C$DW$56, DW_AT_type(*$C$DW$T$21)
     873                      .dwattr $C$DW$56, DW_AT_name("bit")
     874                      .dwattr $C$DW$56, DW_AT_TI_symbol_name("_bit")
     875                      .dwattr $C$DW$56, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     876                      .dwattr $C$DW$56, DW_AT_accessibility(DW_ACCESS_public)
     877                      .dwendtag $C$DW$T$22
     878              
     879              
     880              $C$DW$T$23      .dwtag  DW_TAG_structure_type
     881                      .dwattr $C$DW$T$23, DW_AT_name("PIECTRL_BITS")
     882                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x01)
     883              $C$DW$57        .dwtag  DW_TAG_member
     884                      .dwattr $C$DW$57, DW_AT_type(*$C$DW$T$19)
     885                      .dwattr $C$DW$57, DW_AT_name("ENPIE")
     886                      .dwattr $C$DW$57, DW_AT_TI_symbol_name("_ENPIE")
     887                      .dwattr $C$DW$57, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
     888                      .dwattr $C$DW$57, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     889                      .dwattr $C$DW$57, DW_AT_accessibility(DW_ACCESS_public)
     890              $C$DW$58        .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:14 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0371210                           PAGE   18

     891                      .dwattr $C$DW$58, DW_AT_type(*$C$DW$T$19)
     892                      .dwattr $C$DW$58, DW_AT_name("PIEVECT")
     893                      .dwattr $C$DW$58, DW_AT_TI_symbol_name("_PIEVECT")
     894                      .dwattr $C$DW$58, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x0f)
     895                      .dwattr $C$DW$58, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     896                      .dwattr $C$DW$58, DW_AT_accessibility(DW_ACCESS_public)
     897                      .dwendtag $C$DW$T$23
     898              
     899              
     900              $C$DW$T$24      .dwtag  DW_TAG_union_type
     901                      .dwattr $C$DW$T$24, DW_AT_name("PIECTRL_REG")
     902                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x01)
     903              $C$DW$59        .dwtag  DW_TAG_member
     904                      .dwattr $C$DW$59, DW_AT_type(*$C$DW$T$19)
     905                      .dwattr $C$DW$59, DW_AT_name("all")
     906                      .dwattr $C$DW$59, DW_AT_TI_symbol_name("_all")
     907                      .dwattr $C$DW$59, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     908                      .dwattr $C$DW$59, DW_AT_accessibility(DW_ACCESS_public)
     909              $C$DW$60        .dwtag  DW_TAG_member
     910                      .dwattr $C$DW$60, DW_AT_type(*$C$DW$T$23)
     911                      .dwattr $C$DW$60, DW_AT_name("bit")
     912                      .dwattr $C$DW$60, DW_AT_TI_symbol_name("_bit")
     913                      .dwattr $C$DW$60, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     914                      .dwattr $C$DW$60, DW_AT_accessibility(DW_ACCESS_public)
     915                      .dwendtag $C$DW$T$24
     916              
     917              
     918              $C$DW$T$25      .dwtag  DW_TAG_structure_type
     919                      .dwattr $C$DW$T$25, DW_AT_name("PIEIER_BITS")
     920                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x01)
     921              $C$DW$61        .dwtag  DW_TAG_member
     922                      .dwattr $C$DW$61, DW_AT_type(*$C$DW$T$19)
     923                      .dwattr $C$DW$61, DW_AT_name("INTx1")
     924                      .dwattr $C$DW$61, DW_AT_TI_symbol_name("_INTx1")
     925                      .dwattr $C$DW$61, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
     926                      .dwattr $C$DW$61, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     927                      .dwattr $C$DW$61, DW_AT_accessibility(DW_ACCESS_public)
     928              $C$DW$62        .dwtag  DW_TAG_member
     929                      .dwattr $C$DW$62, DW_AT_type(*$C$DW$T$19)
     930                      .dwattr $C$DW$62, DW_AT_name("INTx2")
     931                      .dwattr $C$DW$62, DW_AT_TI_symbol_name("_INTx2")
     932                      .dwattr $C$DW$62, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
     933                      .dwattr $C$DW$62, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     934                      .dwattr $C$DW$62, DW_AT_accessibility(DW_ACCESS_public)
     935              $C$DW$63        .dwtag  DW_TAG_member
     936                      .dwattr $C$DW$63, DW_AT_type(*$C$DW$T$19)
     937                      .dwattr $C$DW$63, DW_AT_name("INTx3")
     938                      .dwattr $C$DW$63, DW_AT_TI_symbol_name("_INTx3")
     939                      .dwattr $C$DW$63, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
     940                      .dwattr $C$DW$63, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     941                      .dwattr $C$DW$63, DW_AT_accessibility(DW_ACCESS_public)
     942              $C$DW$64        .dwtag  DW_TAG_member
     943                      .dwattr $C$DW$64, DW_AT_type(*$C$DW$T$19)
     944                      .dwattr $C$DW$64, DW_AT_name("INTx4")
     945                      .dwattr $C$DW$64, DW_AT_TI_symbol_name("_INTx4")
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:14 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0371210                           PAGE   19

     946                      .dwattr $C$DW$64, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
     947                      .dwattr $C$DW$64, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     948                      .dwattr $C$DW$64, DW_AT_accessibility(DW_ACCESS_public)
     949              $C$DW$65        .dwtag  DW_TAG_member
     950                      .dwattr $C$DW$65, DW_AT_type(*$C$DW$T$19)
     951                      .dwattr $C$DW$65, DW_AT_name("INTx5")
     952                      .dwattr $C$DW$65, DW_AT_TI_symbol_name("_INTx5")
     953                      .dwattr $C$DW$65, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
     954                      .dwattr $C$DW$65, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     955                      .dwattr $C$DW$65, DW_AT_accessibility(DW_ACCESS_public)
     956              $C$DW$66        .dwtag  DW_TAG_member
     957                      .dwattr $C$DW$66, DW_AT_type(*$C$DW$T$19)
     958                      .dwattr $C$DW$66, DW_AT_name("INTx6")
     959                      .dwattr $C$DW$66, DW_AT_TI_symbol_name("_INTx6")
     960                      .dwattr $C$DW$66, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
     961                      .dwattr $C$DW$66, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     962                      .dwattr $C$DW$66, DW_AT_accessibility(DW_ACCESS_public)
     963              $C$DW$67        .dwtag  DW_TAG_member
     964                      .dwattr $C$DW$67, DW_AT_type(*$C$DW$T$19)
     965                      .dwattr $C$DW$67, DW_AT_name("INTx7")
     966                      .dwattr $C$DW$67, DW_AT_TI_symbol_name("_INTx7")
     967                      .dwattr $C$DW$67, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
     968                      .dwattr $C$DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     969                      .dwattr $C$DW$67, DW_AT_accessibility(DW_ACCESS_public)
     970              $C$DW$68        .dwtag  DW_TAG_member
     971                      .dwattr $C$DW$68, DW_AT_type(*$C$DW$T$19)
     972                      .dwattr $C$DW$68, DW_AT_name("INTx8")
     973                      .dwattr $C$DW$68, DW_AT_TI_symbol_name("_INTx8")
     974                      .dwattr $C$DW$68, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
     975                      .dwattr $C$DW$68, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     976                      .dwattr $C$DW$68, DW_AT_accessibility(DW_ACCESS_public)
     977              $C$DW$69        .dwtag  DW_TAG_member
     978                      .dwattr $C$DW$69, DW_AT_type(*$C$DW$T$19)
     979                      .dwattr $C$DW$69, DW_AT_name("rsvd")
     980                      .dwattr $C$DW$69, DW_AT_TI_symbol_name("_rsvd")
     981                      .dwattr $C$DW$69, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x08)
     982                      .dwattr $C$DW$69, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     983                      .dwattr $C$DW$69, DW_AT_accessibility(DW_ACCESS_public)
     984                      .dwendtag $C$DW$T$25
     985              
     986              
     987              $C$DW$T$26      .dwtag  DW_TAG_union_type
     988                      .dwattr $C$DW$T$26, DW_AT_name("PIEIER_REG")
     989                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x01)
     990              $C$DW$70        .dwtag  DW_TAG_member
     991                      .dwattr $C$DW$70, DW_AT_type(*$C$DW$T$19)
     992                      .dwattr $C$DW$70, DW_AT_name("all")
     993                      .dwattr $C$DW$70, DW_AT_TI_symbol_name("_all")
     994                      .dwattr $C$DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     995                      .dwattr $C$DW$70, DW_AT_accessibility(DW_ACCESS_public)
     996              $C$DW$71        .dwtag  DW_TAG_member
     997                      .dwattr $C$DW$71, DW_AT_type(*$C$DW$T$25)
     998                      .dwattr $C$DW$71, DW_AT_name("bit")
     999                      .dwattr $C$DW$71, DW_AT_TI_symbol_name("_bit")
    1000                      .dwattr $C$DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:14 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0371210                           PAGE   20

    1001                      .dwattr $C$DW$71, DW_AT_accessibility(DW_ACCESS_public)
    1002                      .dwendtag $C$DW$T$26
    1003              
    1004              
    1005              $C$DW$T$27      .dwtag  DW_TAG_structure_type
    1006                      .dwattr $C$DW$T$27, DW_AT_name("PIEIFR_BITS")
    1007                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x01)
    1008              $C$DW$72        .dwtag  DW_TAG_member
    1009                      .dwattr $C$DW$72, DW_AT_type(*$C$DW$T$19)
    1010                      .dwattr $C$DW$72, DW_AT_name("INTx1")
    1011                      .dwattr $C$DW$72, DW_AT_TI_symbol_name("_INTx1")
    1012                      .dwattr $C$DW$72, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    1013                      .dwattr $C$DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1014                      .dwattr $C$DW$72, DW_AT_accessibility(DW_ACCESS_public)
    1015              $C$DW$73        .dwtag  DW_TAG_member
    1016                      .dwattr $C$DW$73, DW_AT_type(*$C$DW$T$19)
    1017                      .dwattr $C$DW$73, DW_AT_name("INTx2")
    1018                      .dwattr $C$DW$73, DW_AT_TI_symbol_name("_INTx2")
    1019                      .dwattr $C$DW$73, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    1020                      .dwattr $C$DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1021                      .dwattr $C$DW$73, DW_AT_accessibility(DW_ACCESS_public)
    1022              $C$DW$74        .dwtag  DW_TAG_member
    1023                      .dwattr $C$DW$74, DW_AT_type(*$C$DW$T$19)
    1024                      .dwattr $C$DW$74, DW_AT_name("INTx3")
    1025                      .dwattr $C$DW$74, DW_AT_TI_symbol_name("_INTx3")
    1026                      .dwattr $C$DW$74, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    1027                      .dwattr $C$DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1028                      .dwattr $C$DW$74, DW_AT_accessibility(DW_ACCESS_public)
    1029              $C$DW$75        .dwtag  DW_TAG_member
    1030                      .dwattr $C$DW$75, DW_AT_type(*$C$DW$T$19)
    1031                      .dwattr $C$DW$75, DW_AT_name("INTx4")
    1032                      .dwattr $C$DW$75, DW_AT_TI_symbol_name("_INTx4")
    1033                      .dwattr $C$DW$75, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    1034                      .dwattr $C$DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1035                      .dwattr $C$DW$75, DW_AT_accessibility(DW_ACCESS_public)
    1036              $C$DW$76        .dwtag  DW_TAG_member
    1037                      .dwattr $C$DW$76, DW_AT_type(*$C$DW$T$19)
    1038                      .dwattr $C$DW$76, DW_AT_name("INTx5")
    1039                      .dwattr $C$DW$76, DW_AT_TI_symbol_name("_INTx5")
    1040                      .dwattr $C$DW$76, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    1041                      .dwattr $C$DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1042                      .dwattr $C$DW$76, DW_AT_accessibility(DW_ACCESS_public)
    1043              $C$DW$77        .dwtag  DW_TAG_member
    1044                      .dwattr $C$DW$77, DW_AT_type(*$C$DW$T$19)
    1045                      .dwattr $C$DW$77, DW_AT_name("INTx6")
    1046                      .dwattr $C$DW$77, DW_AT_TI_symbol_name("_INTx6")
    1047                      .dwattr $C$DW$77, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    1048                      .dwattr $C$DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1049                      .dwattr $C$DW$77, DW_AT_accessibility(DW_ACCESS_public)
    1050              $C$DW$78        .dwtag  DW_TAG_member
    1051                      .dwattr $C$DW$78, DW_AT_type(*$C$DW$T$19)
    1052                      .dwattr $C$DW$78, DW_AT_name("INTx7")
    1053                      .dwattr $C$DW$78, DW_AT_TI_symbol_name("_INTx7")
    1054                      .dwattr $C$DW$78, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    1055                      .dwattr $C$DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:14 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0371210                           PAGE   21

    1056                      .dwattr $C$DW$78, DW_AT_accessibility(DW_ACCESS_public)
    1057              $C$DW$79        .dwtag  DW_TAG_member
    1058                      .dwattr $C$DW$79, DW_AT_type(*$C$DW$T$19)
    1059                      .dwattr $C$DW$79, DW_AT_name("INTx8")
    1060                      .dwattr $C$DW$79, DW_AT_TI_symbol_name("_INTx8")
    1061                      .dwattr $C$DW$79, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    1062                      .dwattr $C$DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1063                      .dwattr $C$DW$79, DW_AT_accessibility(DW_ACCESS_public)
    1064              $C$DW$80        .dwtag  DW_TAG_member
    1065                      .dwattr $C$DW$80, DW_AT_type(*$C$DW$T$19)
    1066                      .dwattr $C$DW$80, DW_AT_name("rsvd")
    1067                      .dwattr $C$DW$80, DW_AT_TI_symbol_name("_rsvd")
    1068                      .dwattr $C$DW$80, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x08)
    1069                      .dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1070                      .dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
    1071                      .dwendtag $C$DW$T$27
    1072              
    1073              
    1074              $C$DW$T$28      .dwtag  DW_TAG_union_type
    1075                      .dwattr $C$DW$T$28, DW_AT_name("PIEIFR_REG")
    1076                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x01)
    1077              $C$DW$81        .dwtag  DW_TAG_member
    1078                      .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$19)
    1079                      .dwattr $C$DW$81, DW_AT_name("all")
    1080                      .dwattr $C$DW$81, DW_AT_TI_symbol_name("_all")
    1081                      .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1082                      .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
    1083              $C$DW$82        .dwtag  DW_TAG_member
    1084                      .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$27)
    1085                      .dwattr $C$DW$82, DW_AT_name("bit")
    1086                      .dwattr $C$DW$82, DW_AT_TI_symbol_name("_bit")
    1087                      .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1088                      .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
    1089                      .dwendtag $C$DW$T$28
    1090              
    1091              
    1092              $C$DW$T$29      .dwtag  DW_TAG_structure_type
    1093                      .dwattr $C$DW$T$29, DW_AT_name("PIE_CTRL_REGS")
    1094                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x1a)
    1095              $C$DW$83        .dwtag  DW_TAG_member
    1096                      .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$24)
    1097                      .dwattr $C$DW$83, DW_AT_name("PIECTRL")
    1098                      .dwattr $C$DW$83, DW_AT_TI_symbol_name("_PIECTRL")
    1099                      .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1100                      .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
    1101              $C$DW$84        .dwtag  DW_TAG_member
    1102                      .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$22)
    1103                      .dwattr $C$DW$84, DW_AT_name("PIEACK")
    1104                      .dwattr $C$DW$84, DW_AT_TI_symbol_name("_PIEACK")
    1105                      .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1106                      .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
    1107              $C$DW$85        .dwtag  DW_TAG_member
    1108                      .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$26)
    1109                      .dwattr $C$DW$85, DW_AT_name("PIEIER1")
    1110                      .dwattr $C$DW$85, DW_AT_TI_symbol_name("_PIEIER1")
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:14 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0371210                           PAGE   22

    1111                      .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1112                      .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
    1113              $C$DW$86        .dwtag  DW_TAG_member
    1114                      .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$28)
    1115                      .dwattr $C$DW$86, DW_AT_name("PIEIFR1")
    1116                      .dwattr $C$DW$86, DW_AT_TI_symbol_name("_PIEIFR1")
    1117                      .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x3]
    1118                      .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
    1119              $C$DW$87        .dwtag  DW_TAG_member
    1120                      .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$26)
    1121                      .dwattr $C$DW$87, DW_AT_name("PIEIER2")
    1122                      .dwattr $C$DW$87, DW_AT_TI_symbol_name("_PIEIER2")
    1123                      .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1124                      .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
    1125              $C$DW$88        .dwtag  DW_TAG_member
    1126                      .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$28)
    1127                      .dwattr $C$DW$88, DW_AT_name("PIEIFR2")
    1128                      .dwattr $C$DW$88, DW_AT_TI_symbol_name("_PIEIFR2")
    1129                      .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x5]
    1130                      .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
    1131              $C$DW$89        .dwtag  DW_TAG_member
    1132                      .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$26)
    1133                      .dwattr $C$DW$89, DW_AT_name("PIEIER3")
    1134                      .dwattr $C$DW$89, DW_AT_TI_symbol_name("_PIEIER3")
    1135                      .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1136                      .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
    1137              $C$DW$90        .dwtag  DW_TAG_member
    1138                      .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$28)
    1139                      .dwattr $C$DW$90, DW_AT_name("PIEIFR3")
    1140                      .dwattr $C$DW$90, DW_AT_TI_symbol_name("_PIEIFR3")
    1141                      .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x7]
    1142                      .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
    1143              $C$DW$91        .dwtag  DW_TAG_member
    1144                      .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$26)
    1145                      .dwattr $C$DW$91, DW_AT_name("PIEIER4")
    1146                      .dwattr $C$DW$91, DW_AT_TI_symbol_name("_PIEIER4")
    1147                      .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1148                      .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
    1149              $C$DW$92        .dwtag  DW_TAG_member
    1150                      .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$28)
    1151                      .dwattr $C$DW$92, DW_AT_name("PIEIFR4")
    1152                      .dwattr $C$DW$92, DW_AT_TI_symbol_name("_PIEIFR4")
    1153                      .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x9]
    1154                      .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
    1155              $C$DW$93        .dwtag  DW_TAG_member
    1156                      .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$26)
    1157                      .dwattr $C$DW$93, DW_AT_name("PIEIER5")
    1158                      .dwattr $C$DW$93, DW_AT_TI_symbol_name("_PIEIER5")
    1159                      .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1160                      .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
    1161              $C$DW$94        .dwtag  DW_TAG_member
    1162                      .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$28)
    1163                      .dwattr $C$DW$94, DW_AT_name("PIEIFR5")
    1164                      .dwattr $C$DW$94, DW_AT_TI_symbol_name("_PIEIFR5")
    1165                      .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0xb]
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:14 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0371210                           PAGE   23

    1166                      .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
    1167              $C$DW$95        .dwtag  DW_TAG_member
    1168                      .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$26)
    1169                      .dwattr $C$DW$95, DW_AT_name("PIEIER6")
    1170                      .dwattr $C$DW$95, DW_AT_TI_symbol_name("_PIEIER6")
    1171                      .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1172                      .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
    1173              $C$DW$96        .dwtag  DW_TAG_member
    1174                      .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$28)
    1175                      .dwattr $C$DW$96, DW_AT_name("PIEIFR6")
    1176                      .dwattr $C$DW$96, DW_AT_TI_symbol_name("_PIEIFR6")
    1177                      .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0xd]
    1178                      .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
    1179              $C$DW$97        .dwtag  DW_TAG_member
    1180                      .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$26)
    1181                      .dwattr $C$DW$97, DW_AT_name("PIEIER7")
    1182                      .dwattr $C$DW$97, DW_AT_TI_symbol_name("_PIEIER7")
    1183                      .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1184                      .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
    1185              $C$DW$98        .dwtag  DW_TAG_member
    1186                      .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$28)
    1187                      .dwattr $C$DW$98, DW_AT_name("PIEIFR7")
    1188                      .dwattr $C$DW$98, DW_AT_TI_symbol_name("_PIEIFR7")
    1189                      .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0xf]
    1190                      .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
    1191              $C$DW$99        .dwtag  DW_TAG_member
    1192                      .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$26)
    1193                      .dwattr $C$DW$99, DW_AT_name("PIEIER8")
    1194                      .dwattr $C$DW$99, DW_AT_TI_symbol_name("_PIEIER8")
    1195                      .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1196                      .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
    1197              $C$DW$100       .dwtag  DW_TAG_member
    1198                      .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$28)
    1199                      .dwattr $C$DW$100, DW_AT_name("PIEIFR8")
    1200                      .dwattr $C$DW$100, DW_AT_TI_symbol_name("_PIEIFR8")
    1201                      .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x11]
    1202                      .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
    1203              $C$DW$101       .dwtag  DW_TAG_member
    1204                      .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$26)
    1205                      .dwattr $C$DW$101, DW_AT_name("PIEIER9")
    1206                      .dwattr $C$DW$101, DW_AT_TI_symbol_name("_PIEIER9")
    1207                      .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    1208                      .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
    1209              $C$DW$102       .dwtag  DW_TAG_member
    1210                      .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$28)
    1211                      .dwattr $C$DW$102, DW_AT_name("PIEIFR9")
    1212                      .dwattr $C$DW$102, DW_AT_TI_symbol_name("_PIEIFR9")
    1213                      .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x13]
    1214                      .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
    1215              $C$DW$103       .dwtag  DW_TAG_member
    1216                      .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$26)
    1217                      .dwattr $C$DW$103, DW_AT_name("PIEIER10")
    1218                      .dwattr $C$DW$103, DW_AT_TI_symbol_name("_PIEIER10")
    1219                      .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1220                      .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:14 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0371210                           PAGE   24

    1221              $C$DW$104       .dwtag  DW_TAG_member
    1222                      .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$28)
    1223                      .dwattr $C$DW$104, DW_AT_name("PIEIFR10")
    1224                      .dwattr $C$DW$104, DW_AT_TI_symbol_name("_PIEIFR10")
    1225                      .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x15]
    1226                      .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
    1227              $C$DW$105       .dwtag  DW_TAG_member
    1228                      .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$26)
    1229                      .dwattr $C$DW$105, DW_AT_name("PIEIER11")
    1230                      .dwattr $C$DW$105, DW_AT_TI_symbol_name("_PIEIER11")
    1231                      .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    1232                      .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
    1233              $C$DW$106       .dwtag  DW_TAG_member
    1234                      .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$28)
    1235                      .dwattr $C$DW$106, DW_AT_name("PIEIFR11")
    1236                      .dwattr $C$DW$106, DW_AT_TI_symbol_name("_PIEIFR11")
    1237                      .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x17]
    1238                      .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    1239              $C$DW$107       .dwtag  DW_TAG_member
    1240                      .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$26)
    1241                      .dwattr $C$DW$107, DW_AT_name("PIEIER12")
    1242                      .dwattr $C$DW$107, DW_AT_TI_symbol_name("_PIEIER12")
    1243                      .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1244                      .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
    1245              $C$DW$108       .dwtag  DW_TAG_member
    1246                      .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$28)
    1247                      .dwattr $C$DW$108, DW_AT_name("PIEIFR12")
    1248                      .dwattr $C$DW$108, DW_AT_TI_symbol_name("_PIEIFR12")
    1249                      .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x19]
    1250                      .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    1251                      .dwendtag $C$DW$T$29
    1252              
    1253              $C$DW$109       .dwtag  DW_TAG_TI_far_type
    1254                      .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$29)
    1255              $C$DW$T$53      .dwtag  DW_TAG_volatile_type
    1256                      .dwattr $C$DW$T$53, DW_AT_type(*$C$DW$109)
    1257              
    1258              $C$DW$T$33      .dwtag  DW_TAG_structure_type
    1259                      .dwattr $C$DW$T$33, DW_AT_name("PIE_VECT_TABLE")
    1260                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x100)
    1261              $C$DW$110       .dwtag  DW_TAG_member
    1262                      .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$32)
    1263                      .dwattr $C$DW$110, DW_AT_name("PIE1_RESERVED")
    1264                      .dwattr $C$DW$110, DW_AT_TI_symbol_name("_PIE1_RESERVED")
    1265                      .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1266                      .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    1267              $C$DW$111       .dwtag  DW_TAG_member
    1268                      .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$32)
    1269                      .dwattr $C$DW$111, DW_AT_name("PIE2_RESERVED")
    1270                      .dwattr $C$DW$111, DW_AT_TI_symbol_name("_PIE2_RESERVED")
    1271                      .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x2]
    1272                      .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    1273              $C$DW$112       .dwtag  DW_TAG_member
    1274                      .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$32)
    1275                      .dwattr $C$DW$112, DW_AT_name("PIE3_RESERVED")
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:14 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0371210                           PAGE   25

    1276                      .dwattr $C$DW$112, DW_AT_TI_symbol_name("_PIE3_RESERVED")
    1277                      .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1278                      .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    1279              $C$DW$113       .dwtag  DW_TAG_member
    1280                      .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$32)
    1281                      .dwattr $C$DW$113, DW_AT_name("PIE4_RESERVED")
    1282                      .dwattr $C$DW$113, DW_AT_TI_symbol_name("_PIE4_RESERVED")
    1283                      .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x6]
    1284                      .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    1285              $C$DW$114       .dwtag  DW_TAG_member
    1286                      .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$32)
    1287                      .dwattr $C$DW$114, DW_AT_name("PIE5_RESERVED")
    1288                      .dwattr $C$DW$114, DW_AT_TI_symbol_name("_PIE5_RESERVED")
    1289                      .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1290                      .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    1291              $C$DW$115       .dwtag  DW_TAG_member
    1292                      .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$32)
    1293                      .dwattr $C$DW$115, DW_AT_name("PIE6_RESERVED")
    1294                      .dwattr $C$DW$115, DW_AT_TI_symbol_name("_PIE6_RESERVED")
    1295                      .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0xa]
    1296                      .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    1297              $C$DW$116       .dwtag  DW_TAG_member
    1298                      .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$32)
    1299                      .dwattr $C$DW$116, DW_AT_name("PIE7_RESERVED")
    1300                      .dwattr $C$DW$116, DW_AT_TI_symbol_name("_PIE7_RESERVED")
    1301                      .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1302                      .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    1303              $C$DW$117       .dwtag  DW_TAG_member
    1304                      .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$32)
    1305                      .dwattr $C$DW$117, DW_AT_name("PIE8_RESERVED")
    1306                      .dwattr $C$DW$117, DW_AT_TI_symbol_name("_PIE8_RESERVED")
    1307                      .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    1308                      .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    1309              $C$DW$118       .dwtag  DW_TAG_member
    1310                      .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$32)
    1311                      .dwattr $C$DW$118, DW_AT_name("PIE9_RESERVED")
    1312                      .dwattr $C$DW$118, DW_AT_TI_symbol_name("_PIE9_RESERVED")
    1313                      .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1314                      .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    1315              $C$DW$119       .dwtag  DW_TAG_member
    1316                      .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$32)
    1317                      .dwattr $C$DW$119, DW_AT_name("PIE10_RESERVED")
    1318                      .dwattr $C$DW$119, DW_AT_TI_symbol_name("_PIE10_RESERVED")
    1319                      .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    1320                      .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    1321              $C$DW$120       .dwtag  DW_TAG_member
    1322                      .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$32)
    1323                      .dwattr $C$DW$120, DW_AT_name("PIE11_RESERVED")
    1324                      .dwattr $C$DW$120, DW_AT_TI_symbol_name("_PIE11_RESERVED")
    1325                      .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1326                      .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    1327              $C$DW$121       .dwtag  DW_TAG_member
    1328                      .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$32)
    1329                      .dwattr $C$DW$121, DW_AT_name("PIE12_RESERVED")
    1330                      .dwattr $C$DW$121, DW_AT_TI_symbol_name("_PIE12_RESERVED")
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:14 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0371210                           PAGE   26

    1331                      .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    1332                      .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    1333              $C$DW$122       .dwtag  DW_TAG_member
    1334                      .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$32)
    1335                      .dwattr $C$DW$122, DW_AT_name("PIE13_RESERVED")
    1336                      .dwattr $C$DW$122, DW_AT_TI_symbol_name("_PIE13_RESERVED")
    1337                      .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1338                      .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    1339              $C$DW$123       .dwtag  DW_TAG_member
    1340                      .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$32)
    1341                      .dwattr $C$DW$123, DW_AT_name("XINT13")
    1342                      .dwattr $C$DW$123, DW_AT_TI_symbol_name("_XINT13")
    1343                      .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    1344                      .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    1345              $C$DW$124       .dwtag  DW_TAG_member
    1346                      .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$32)
    1347                      .dwattr $C$DW$124, DW_AT_name("TINT2")
    1348                      .dwattr $C$DW$124, DW_AT_TI_symbol_name("_TINT2")
    1349                      .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    1350                      .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    1351              $C$DW$125       .dwtag  DW_TAG_member
    1352                      .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$32)
    1353                      .dwattr $C$DW$125, DW_AT_name("DATALOG")
    1354                      .dwattr $C$DW$125, DW_AT_TI_symbol_name("_DATALOG")
    1355                      .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e]
    1356                      .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    1357              $C$DW$126       .dwtag  DW_TAG_member
    1358                      .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$32)
    1359                      .dwattr $C$DW$126, DW_AT_name("RTOSINT")
    1360                      .dwattr $C$DW$126, DW_AT_TI_symbol_name("_RTOSINT")
    1361                      .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    1362                      .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    1363              $C$DW$127       .dwtag  DW_TAG_member
    1364                      .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$32)
    1365                      .dwattr $C$DW$127, DW_AT_name("EMUINT")
    1366                      .dwattr $C$DW$127, DW_AT_TI_symbol_name("_EMUINT")
    1367                      .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x22]
    1368                      .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    1369              $C$DW$128       .dwtag  DW_TAG_member
    1370                      .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$32)
    1371                      .dwattr $C$DW$128, DW_AT_name("XNMI")
    1372                      .dwattr $C$DW$128, DW_AT_TI_symbol_name("_XNMI")
    1373                      .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
    1374                      .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    1375              $C$DW$129       .dwtag  DW_TAG_member
    1376                      .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$32)
    1377                      .dwattr $C$DW$129, DW_AT_name("ILLEGAL")
    1378                      .dwattr $C$DW$129, DW_AT_TI_symbol_name("_ILLEGAL")
    1379                      .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x26]
    1380                      .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    1381              $C$DW$130       .dwtag  DW_TAG_member
    1382                      .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$32)
    1383                      .dwattr $C$DW$130, DW_AT_name("USER1")
    1384                      .dwattr $C$DW$130, DW_AT_TI_symbol_name("_USER1")
    1385                      .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:14 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0371210                           PAGE   27

    1386                      .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    1387              $C$DW$131       .dwtag  DW_TAG_member
    1388                      .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$32)
    1389                      .dwattr $C$DW$131, DW_AT_name("USER2")
    1390                      .dwattr $C$DW$131, DW_AT_TI_symbol_name("_USER2")
    1391                      .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x2a]
    1392                      .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    1393              $C$DW$132       .dwtag  DW_TAG_member
    1394                      .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$32)
    1395                      .dwattr $C$DW$132, DW_AT_name("USER3")
    1396                      .dwattr $C$DW$132, DW_AT_TI_symbol_name("_USER3")
    1397                      .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
    1398                      .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    1399              $C$DW$133       .dwtag  DW_TAG_member
    1400                      .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$32)
    1401                      .dwattr $C$DW$133, DW_AT_name("USER4")
    1402                      .dwattr $C$DW$133, DW_AT_TI_symbol_name("_USER4")
    1403                      .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x2e]
    1404                      .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    1405              $C$DW$134       .dwtag  DW_TAG_member
    1406                      .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$32)
    1407                      .dwattr $C$DW$134, DW_AT_name("USER5")
    1408                      .dwattr $C$DW$134, DW_AT_TI_symbol_name("_USER5")
    1409                      .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
    1410                      .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    1411              $C$DW$135       .dwtag  DW_TAG_member
    1412                      .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$32)
    1413                      .dwattr $C$DW$135, DW_AT_name("USER6")
    1414                      .dwattr $C$DW$135, DW_AT_TI_symbol_name("_USER6")
    1415                      .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x32]
    1416                      .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    1417              $C$DW$136       .dwtag  DW_TAG_member
    1418                      .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$32)
    1419                      .dwattr $C$DW$136, DW_AT_name("USER7")
    1420                      .dwattr $C$DW$136, DW_AT_TI_symbol_name("_USER7")
    1421                      .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
    1422                      .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    1423              $C$DW$137       .dwtag  DW_TAG_member
    1424                      .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$32)
    1425                      .dwattr $C$DW$137, DW_AT_name("USER8")
    1426                      .dwattr $C$DW$137, DW_AT_TI_symbol_name("_USER8")
    1427                      .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x36]
    1428                      .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
    1429              $C$DW$138       .dwtag  DW_TAG_member
    1430                      .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$32)
    1431                      .dwattr $C$DW$138, DW_AT_name("USER9")
    1432                      .dwattr $C$DW$138, DW_AT_TI_symbol_name("_USER9")
    1433                      .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
    1434                      .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    1435              $C$DW$139       .dwtag  DW_TAG_member
    1436                      .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$32)
    1437                      .dwattr $C$DW$139, DW_AT_name("USER10")
    1438                      .dwattr $C$DW$139, DW_AT_TI_symbol_name("_USER10")
    1439                      .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x3a]
    1440                      .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:14 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0371210                           PAGE   28

    1441              $C$DW$140       .dwtag  DW_TAG_member
    1442                      .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$32)
    1443                      .dwattr $C$DW$140, DW_AT_name("USER11")
    1444                      .dwattr $C$DW$140, DW_AT_TI_symbol_name("_USER11")
    1445                      .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c]
    1446                      .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    1447              $C$DW$141       .dwtag  DW_TAG_member
    1448                      .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$32)
    1449                      .dwattr $C$DW$141, DW_AT_name("USER12")
    1450                      .dwattr $C$DW$141, DW_AT_TI_symbol_name("_USER12")
    1451                      .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x3e]
    1452                      .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    1453              $C$DW$142       .dwtag  DW_TAG_member
    1454                      .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$32)
    1455                      .dwattr $C$DW$142, DW_AT_name("SEQ1INT")
    1456                      .dwattr $C$DW$142, DW_AT_TI_symbol_name("_SEQ1INT")
    1457                      .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x40]
    1458                      .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    1459              $C$DW$143       .dwtag  DW_TAG_member
    1460                      .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$32)
    1461                      .dwattr $C$DW$143, DW_AT_name("SEQ2INT")
    1462                      .dwattr $C$DW$143, DW_AT_TI_symbol_name("_SEQ2INT")
    1463                      .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x42]
    1464                      .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    1465              $C$DW$144       .dwtag  DW_TAG_member
    1466                      .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$32)
    1467                      .dwattr $C$DW$144, DW_AT_name("rsvd1_3")
    1468                      .dwattr $C$DW$144, DW_AT_TI_symbol_name("_rsvd1_3")
    1469                      .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x44]
    1470                      .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    1471              $C$DW$145       .dwtag  DW_TAG_member
    1472                      .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$32)
    1473                      .dwattr $C$DW$145, DW_AT_name("XINT1")
    1474                      .dwattr $C$DW$145, DW_AT_TI_symbol_name("_XINT1")
    1475                      .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x46]
    1476                      .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    1477              $C$DW$146       .dwtag  DW_TAG_member
    1478                      .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$32)
    1479                      .dwattr $C$DW$146, DW_AT_name("XINT2")
    1480                      .dwattr $C$DW$146, DW_AT_TI_symbol_name("_XINT2")
    1481                      .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x48]
    1482                      .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
    1483              $C$DW$147       .dwtag  DW_TAG_member
    1484                      .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$32)
    1485                      .dwattr $C$DW$147, DW_AT_name("ADCINT")
    1486                      .dwattr $C$DW$147, DW_AT_TI_symbol_name("_ADCINT")
    1487                      .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x4a]
    1488                      .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
    1489              $C$DW$148       .dwtag  DW_TAG_member
    1490                      .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$32)
    1491                      .dwattr $C$DW$148, DW_AT_name("TINT0")
    1492                      .dwattr $C$DW$148, DW_AT_TI_symbol_name("_TINT0")
    1493                      .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x4c]
    1494                      .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    1495              $C$DW$149       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:14 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0371210                           PAGE   29

    1496                      .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$32)
    1497                      .dwattr $C$DW$149, DW_AT_name("WAKEINT")
    1498                      .dwattr $C$DW$149, DW_AT_TI_symbol_name("_WAKEINT")
    1499                      .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x4e]
    1500                      .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    1501              $C$DW$150       .dwtag  DW_TAG_member
    1502                      .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$32)
    1503                      .dwattr $C$DW$150, DW_AT_name("EPWM1_TZINT")
    1504                      .dwattr $C$DW$150, DW_AT_TI_symbol_name("_EPWM1_TZINT")
    1505                      .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x50]
    1506                      .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
    1507              $C$DW$151       .dwtag  DW_TAG_member
    1508                      .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$32)
    1509                      .dwattr $C$DW$151, DW_AT_name("EPWM2_TZINT")
    1510                      .dwattr $C$DW$151, DW_AT_TI_symbol_name("_EPWM2_TZINT")
    1511                      .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x52]
    1512                      .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    1513              $C$DW$152       .dwtag  DW_TAG_member
    1514                      .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$32)
    1515                      .dwattr $C$DW$152, DW_AT_name("EPWM3_TZINT")
    1516                      .dwattr $C$DW$152, DW_AT_TI_symbol_name("_EPWM3_TZINT")
    1517                      .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x54]
    1518                      .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    1519              $C$DW$153       .dwtag  DW_TAG_member
    1520                      .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$32)
    1521                      .dwattr $C$DW$153, DW_AT_name("EPWM4_TZINT")
    1522                      .dwattr $C$DW$153, DW_AT_TI_symbol_name("_EPWM4_TZINT")
    1523                      .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x56]
    1524                      .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    1525              $C$DW$154       .dwtag  DW_TAG_member
    1526                      .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$32)
    1527                      .dwattr $C$DW$154, DW_AT_name("EPWM5_TZINT")
    1528                      .dwattr $C$DW$154, DW_AT_TI_symbol_name("_EPWM5_TZINT")
    1529                      .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x58]
    1530                      .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
    1531              $C$DW$155       .dwtag  DW_TAG_member
    1532                      .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$32)
    1533                      .dwattr $C$DW$155, DW_AT_name("EPWM6_TZINT")
    1534                      .dwattr $C$DW$155, DW_AT_TI_symbol_name("_EPWM6_TZINT")
    1535                      .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a]
    1536                      .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
    1537              $C$DW$156       .dwtag  DW_TAG_member
    1538                      .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$32)
    1539                      .dwattr $C$DW$156, DW_AT_name("rsvd2_7")
    1540                      .dwattr $C$DW$156, DW_AT_TI_symbol_name("_rsvd2_7")
    1541                      .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x5c]
    1542                      .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    1543              $C$DW$157       .dwtag  DW_TAG_member
    1544                      .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$32)
    1545                      .dwattr $C$DW$157, DW_AT_name("rsvd2_8")
    1546                      .dwattr $C$DW$157, DW_AT_TI_symbol_name("_rsvd2_8")
    1547                      .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x5e]
    1548                      .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    1549              $C$DW$158       .dwtag  DW_TAG_member
    1550                      .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$32)
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:14 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0371210                           PAGE   30

    1551                      .dwattr $C$DW$158, DW_AT_name("EPWM1_INT")
    1552                      .dwattr $C$DW$158, DW_AT_TI_symbol_name("_EPWM1_INT")
    1553                      .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x60]
    1554                      .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    1555              $C$DW$159       .dwtag  DW_TAG_member
    1556                      .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$32)
    1557                      .dwattr $C$DW$159, DW_AT_name("EPWM2_INT")
    1558                      .dwattr $C$DW$159, DW_AT_TI_symbol_name("_EPWM2_INT")
    1559                      .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x62]
    1560                      .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    1561              $C$DW$160       .dwtag  DW_TAG_member
    1562                      .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$32)
    1563                      .dwattr $C$DW$160, DW_AT_name("EPWM3_INT")
    1564                      .dwattr $C$DW$160, DW_AT_TI_symbol_name("_EPWM3_INT")
    1565                      .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x64]
    1566                      .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    1567              $C$DW$161       .dwtag  DW_TAG_member
    1568                      .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$32)
    1569                      .dwattr $C$DW$161, DW_AT_name("EPWM4_INT")
    1570                      .dwattr $C$DW$161, DW_AT_TI_symbol_name("_EPWM4_INT")
    1571                      .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x66]
    1572                      .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    1573              $C$DW$162       .dwtag  DW_TAG_member
    1574                      .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$32)
    1575                      .dwattr $C$DW$162, DW_AT_name("EPWM5_INT")
    1576                      .dwattr $C$DW$162, DW_AT_TI_symbol_name("_EPWM5_INT")
    1577                      .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x68]
    1578                      .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    1579              $C$DW$163       .dwtag  DW_TAG_member
    1580                      .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$32)
    1581                      .dwattr $C$DW$163, DW_AT_name("EPWM6_INT")
    1582                      .dwattr $C$DW$163, DW_AT_TI_symbol_name("_EPWM6_INT")
    1583                      .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x6a]
    1584                      .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    1585              $C$DW$164       .dwtag  DW_TAG_member
    1586                      .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$32)
    1587                      .dwattr $C$DW$164, DW_AT_name("rsvd3_7")
    1588                      .dwattr $C$DW$164, DW_AT_TI_symbol_name("_rsvd3_7")
    1589                      .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x6c]
    1590                      .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    1591              $C$DW$165       .dwtag  DW_TAG_member
    1592                      .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$32)
    1593                      .dwattr $C$DW$165, DW_AT_name("rsvd3_8")
    1594                      .dwattr $C$DW$165, DW_AT_TI_symbol_name("_rsvd3_8")
    1595                      .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x6e]
    1596                      .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    1597              $C$DW$166       .dwtag  DW_TAG_member
    1598                      .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$32)
    1599                      .dwattr $C$DW$166, DW_AT_name("ECAP1_INT")
    1600                      .dwattr $C$DW$166, DW_AT_TI_symbol_name("_ECAP1_INT")
    1601                      .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x70]
    1602                      .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    1603              $C$DW$167       .dwtag  DW_TAG_member
    1604                      .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$32)
    1605                      .dwattr $C$DW$167, DW_AT_name("ECAP2_INT")
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:14 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0371210                           PAGE   31

    1606                      .dwattr $C$DW$167, DW_AT_TI_symbol_name("_ECAP2_INT")
    1607                      .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x72]
    1608                      .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    1609              $C$DW$168       .dwtag  DW_TAG_member
    1610                      .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$32)
    1611                      .dwattr $C$DW$168, DW_AT_name("ECAP3_INT")
    1612                      .dwattr $C$DW$168, DW_AT_TI_symbol_name("_ECAP3_INT")
    1613                      .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x74]
    1614                      .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    1615              $C$DW$169       .dwtag  DW_TAG_member
    1616                      .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$32)
    1617                      .dwattr $C$DW$169, DW_AT_name("ECAP4_INT")
    1618                      .dwattr $C$DW$169, DW_AT_TI_symbol_name("_ECAP4_INT")
    1619                      .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x76]
    1620                      .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    1621              $C$DW$170       .dwtag  DW_TAG_member
    1622                      .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$32)
    1623                      .dwattr $C$DW$170, DW_AT_name("ECAP5_INT")
    1624                      .dwattr $C$DW$170, DW_AT_TI_symbol_name("_ECAP5_INT")
    1625                      .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x78]
    1626                      .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    1627              $C$DW$171       .dwtag  DW_TAG_member
    1628                      .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$32)
    1629                      .dwattr $C$DW$171, DW_AT_name("ECAP6_INT")
    1630                      .dwattr $C$DW$171, DW_AT_TI_symbol_name("_ECAP6_INT")
    1631                      .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x7a]
    1632                      .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    1633              $C$DW$172       .dwtag  DW_TAG_member
    1634                      .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$32)
    1635                      .dwattr $C$DW$172, DW_AT_name("rsvd4_7")
    1636                      .dwattr $C$DW$172, DW_AT_TI_symbol_name("_rsvd4_7")
    1637                      .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x7c]
    1638                      .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
    1639              $C$DW$173       .dwtag  DW_TAG_member
    1640                      .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$32)
    1641                      .dwattr $C$DW$173, DW_AT_name("rsvd4_8")
    1642                      .dwattr $C$DW$173, DW_AT_TI_symbol_name("_rsvd4_8")
    1643                      .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x7e]
    1644                      .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
    1645              $C$DW$174       .dwtag  DW_TAG_member
    1646                      .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$32)
    1647                      .dwattr $C$DW$174, DW_AT_name("EQEP1_INT")
    1648                      .dwattr $C$DW$174, DW_AT_TI_symbol_name("_EQEP1_INT")
    1649                      .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x80]
    1650                      .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
    1651              $C$DW$175       .dwtag  DW_TAG_member
    1652                      .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$32)
    1653                      .dwattr $C$DW$175, DW_AT_name("EQEP2_INT")
    1654                      .dwattr $C$DW$175, DW_AT_TI_symbol_name("_EQEP2_INT")
    1655                      .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x82]
    1656                      .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
    1657              $C$DW$176       .dwtag  DW_TAG_member
    1658                      .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$32)
    1659                      .dwattr $C$DW$176, DW_AT_name("rsvd5_3")
    1660                      .dwattr $C$DW$176, DW_AT_TI_symbol_name("_rsvd5_3")
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:14 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0371210                           PAGE   32

    1661                      .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x84]
    1662                      .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
    1663              $C$DW$177       .dwtag  DW_TAG_member
    1664                      .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$32)
    1665                      .dwattr $C$DW$177, DW_AT_name("rsvd5_4")
    1666                      .dwattr $C$DW$177, DW_AT_TI_symbol_name("_rsvd5_4")
    1667                      .dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x86]
    1668                      .dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
    1669              $C$DW$178       .dwtag  DW_TAG_member
    1670                      .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$32)
    1671                      .dwattr $C$DW$178, DW_AT_name("rsvd5_5")
    1672                      .dwattr $C$DW$178, DW_AT_TI_symbol_name("_rsvd5_5")
    1673                      .dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x88]
    1674                      .dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
    1675              $C$DW$179       .dwtag  DW_TAG_member
    1676                      .dwattr $C$DW$179, DW_AT_type(*$C$DW$T$32)
    1677                      .dwattr $C$DW$179, DW_AT_name("rsvd5_6")
    1678                      .dwattr $C$DW$179, DW_AT_TI_symbol_name("_rsvd5_6")
    1679                      .dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x8a]
    1680                      .dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
    1681              $C$DW$180       .dwtag  DW_TAG_member
    1682                      .dwattr $C$DW$180, DW_AT_type(*$C$DW$T$32)
    1683                      .dwattr $C$DW$180, DW_AT_name("rsvd5_7")
    1684                      .dwattr $C$DW$180, DW_AT_TI_symbol_name("_rsvd5_7")
    1685                      .dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x8c]
    1686                      .dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
    1687              $C$DW$181       .dwtag  DW_TAG_member
    1688                      .dwattr $C$DW$181, DW_AT_type(*$C$DW$T$32)
    1689                      .dwattr $C$DW$181, DW_AT_name("rsvd5_8")
    1690                      .dwattr $C$DW$181, DW_AT_TI_symbol_name("_rsvd5_8")
    1691                      .dwattr $C$DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x8e]
    1692                      .dwattr $C$DW$181, DW_AT_accessibility(DW_ACCESS_public)
    1693              $C$DW$182       .dwtag  DW_TAG_member
    1694                      .dwattr $C$DW$182, DW_AT_type(*$C$DW$T$32)
    1695                      .dwattr $C$DW$182, DW_AT_name("SPIRXINTA")
    1696                      .dwattr $C$DW$182, DW_AT_TI_symbol_name("_SPIRXINTA")
    1697                      .dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x90]
    1698                      .dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)
    1699              $C$DW$183       .dwtag  DW_TAG_member
    1700                      .dwattr $C$DW$183, DW_AT_type(*$C$DW$T$32)
    1701                      .dwattr $C$DW$183, DW_AT_name("SPITXINTA")
    1702                      .dwattr $C$DW$183, DW_AT_TI_symbol_name("_SPITXINTA")
    1703                      .dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0x92]
    1704                      .dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
    1705              $C$DW$184       .dwtag  DW_TAG_member
    1706                      .dwattr $C$DW$184, DW_AT_type(*$C$DW$T$32)
    1707                      .dwattr $C$DW$184, DW_AT_name("MRINTB")
    1708                      .dwattr $C$DW$184, DW_AT_TI_symbol_name("_MRINTB")
    1709                      .dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0x94]
    1710                      .dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
    1711              $C$DW$185       .dwtag  DW_TAG_member
    1712                      .dwattr $C$DW$185, DW_AT_type(*$C$DW$T$32)
    1713                      .dwattr $C$DW$185, DW_AT_name("MXINTB")
    1714                      .dwattr $C$DW$185, DW_AT_TI_symbol_name("_MXINTB")
    1715                      .dwattr $C$DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0x96]
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:14 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0371210                           PAGE   33

    1716                      .dwattr $C$DW$185, DW_AT_accessibility(DW_ACCESS_public)
    1717              $C$DW$186       .dwtag  DW_TAG_member
    1718                      .dwattr $C$DW$186, DW_AT_type(*$C$DW$T$32)
    1719                      .dwattr $C$DW$186, DW_AT_name("MRINTA")
    1720                      .dwattr $C$DW$186, DW_AT_TI_symbol_name("_MRINTA")
    1721                      .dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0x98]
    1722                      .dwattr $C$DW$186, DW_AT_accessibility(DW_ACCESS_public)
    1723              $C$DW$187       .dwtag  DW_TAG_member
    1724                      .dwattr $C$DW$187, DW_AT_type(*$C$DW$T$32)
    1725                      .dwattr $C$DW$187, DW_AT_name("MXINTA")
    1726                      .dwattr $C$DW$187, DW_AT_TI_symbol_name("_MXINTA")
    1727                      .dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x9a]
    1728                      .dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)
    1729              $C$DW$188       .dwtag  DW_TAG_member
    1730                      .dwattr $C$DW$188, DW_AT_type(*$C$DW$T$32)
    1731                      .dwattr $C$DW$188, DW_AT_name("rsvd6_7")
    1732                      .dwattr $C$DW$188, DW_AT_TI_symbol_name("_rsvd6_7")
    1733                      .dwattr $C$DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0x9c]
    1734                      .dwattr $C$DW$188, DW_AT_accessibility(DW_ACCESS_public)
    1735              $C$DW$189       .dwtag  DW_TAG_member
    1736                      .dwattr $C$DW$189, DW_AT_type(*$C$DW$T$32)
    1737                      .dwattr $C$DW$189, DW_AT_name("rsvd6_8")
    1738                      .dwattr $C$DW$189, DW_AT_TI_symbol_name("_rsvd6_8")
    1739                      .dwattr $C$DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0x9e]
    1740                      .dwattr $C$DW$189, DW_AT_accessibility(DW_ACCESS_public)
    1741              $C$DW$190       .dwtag  DW_TAG_member
    1742                      .dwattr $C$DW$190, DW_AT_type(*$C$DW$T$32)
    1743                      .dwattr $C$DW$190, DW_AT_name("DINTCH1")
    1744                      .dwattr $C$DW$190, DW_AT_TI_symbol_name("_DINTCH1")
    1745                      .dwattr $C$DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0xa0]
    1746                      .dwattr $C$DW$190, DW_AT_accessibility(DW_ACCESS_public)
    1747              $C$DW$191       .dwtag  DW_TAG_member
    1748                      .dwattr $C$DW$191, DW_AT_type(*$C$DW$T$32)
    1749                      .dwattr $C$DW$191, DW_AT_name("DINTCH2")
    1750                      .dwattr $C$DW$191, DW_AT_TI_symbol_name("_DINTCH2")
    1751                      .dwattr $C$DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0xa2]
    1752                      .dwattr $C$DW$191, DW_AT_accessibility(DW_ACCESS_public)
    1753              $C$DW$192       .dwtag  DW_TAG_member
    1754                      .dwattr $C$DW$192, DW_AT_type(*$C$DW$T$32)
    1755                      .dwattr $C$DW$192, DW_AT_name("DINTCH3")
    1756                      .dwattr $C$DW$192, DW_AT_TI_symbol_name("_DINTCH3")
    1757                      .dwattr $C$DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0xa4]
    1758                      .dwattr $C$DW$192, DW_AT_accessibility(DW_ACCESS_public)
    1759              $C$DW$193       .dwtag  DW_TAG_member
    1760                      .dwattr $C$DW$193, DW_AT_type(*$C$DW$T$32)
    1761                      .dwattr $C$DW$193, DW_AT_name("DINTCH4")
    1762                      .dwattr $C$DW$193, DW_AT_TI_symbol_name("_DINTCH4")
    1763                      .dwattr $C$DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0xa6]
    1764                      .dwattr $C$DW$193, DW_AT_accessibility(DW_ACCESS_public)
    1765              $C$DW$194       .dwtag  DW_TAG_member
    1766                      .dwattr $C$DW$194, DW_AT_type(*$C$DW$T$32)
    1767                      .dwattr $C$DW$194, DW_AT_name("DINTCH5")
    1768                      .dwattr $C$DW$194, DW_AT_TI_symbol_name("_DINTCH5")
    1769                      .dwattr $C$DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0xa8]
    1770                      .dwattr $C$DW$194, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:14 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0371210                           PAGE   34

    1771              $C$DW$195       .dwtag  DW_TAG_member
    1772                      .dwattr $C$DW$195, DW_AT_type(*$C$DW$T$32)
    1773                      .dwattr $C$DW$195, DW_AT_name("DINTCH6")
    1774                      .dwattr $C$DW$195, DW_AT_TI_symbol_name("_DINTCH6")
    1775                      .dwattr $C$DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0xaa]
    1776                      .dwattr $C$DW$195, DW_AT_accessibility(DW_ACCESS_public)
    1777              $C$DW$196       .dwtag  DW_TAG_member
    1778                      .dwattr $C$DW$196, DW_AT_type(*$C$DW$T$32)
    1779                      .dwattr $C$DW$196, DW_AT_name("rsvd7_7")
    1780                      .dwattr $C$DW$196, DW_AT_TI_symbol_name("_rsvd7_7")
    1781                      .dwattr $C$DW$196, DW_AT_data_member_location[DW_OP_plus_uconst 0xac]
    1782                      .dwattr $C$DW$196, DW_AT_accessibility(DW_ACCESS_public)
    1783              $C$DW$197       .dwtag  DW_TAG_member
    1784                      .dwattr $C$DW$197, DW_AT_type(*$C$DW$T$32)
    1785                      .dwattr $C$DW$197, DW_AT_name("rsvd7_8")
    1786                      .dwattr $C$DW$197, DW_AT_TI_symbol_name("_rsvd7_8")
    1787                      .dwattr $C$DW$197, DW_AT_data_member_location[DW_OP_plus_uconst 0xae]
    1788                      .dwattr $C$DW$197, DW_AT_accessibility(DW_ACCESS_public)
    1789              $C$DW$198       .dwtag  DW_TAG_member
    1790                      .dwattr $C$DW$198, DW_AT_type(*$C$DW$T$32)
    1791                      .dwattr $C$DW$198, DW_AT_name("I2CINT1A")
    1792                      .dwattr $C$DW$198, DW_AT_TI_symbol_name("_I2CINT1A")
    1793                      .dwattr $C$DW$198, DW_AT_data_member_location[DW_OP_plus_uconst 0xb0]
    1794                      .dwattr $C$DW$198, DW_AT_accessibility(DW_ACCESS_public)
    1795              $C$DW$199       .dwtag  DW_TAG_member
    1796                      .dwattr $C$DW$199, DW_AT_type(*$C$DW$T$32)
    1797                      .dwattr $C$DW$199, DW_AT_name("I2CINT2A")
    1798                      .dwattr $C$DW$199, DW_AT_TI_symbol_name("_I2CINT2A")
    1799                      .dwattr $C$DW$199, DW_AT_data_member_location[DW_OP_plus_uconst 0xb2]
    1800                      .dwattr $C$DW$199, DW_AT_accessibility(DW_ACCESS_public)
    1801              $C$DW$200       .dwtag  DW_TAG_member
    1802                      .dwattr $C$DW$200, DW_AT_type(*$C$DW$T$32)
    1803                      .dwattr $C$DW$200, DW_AT_name("rsvd8_3")
    1804                      .dwattr $C$DW$200, DW_AT_TI_symbol_name("_rsvd8_3")
    1805                      .dwattr $C$DW$200, DW_AT_data_member_location[DW_OP_plus_uconst 0xb4]
    1806                      .dwattr $C$DW$200, DW_AT_accessibility(DW_ACCESS_public)
    1807              $C$DW$201       .dwtag  DW_TAG_member
    1808                      .dwattr $C$DW$201, DW_AT_type(*$C$DW$T$32)
    1809                      .dwattr $C$DW$201, DW_AT_name("rsvd8_4")
    1810                      .dwattr $C$DW$201, DW_AT_TI_symbol_name("_rsvd8_4")
    1811                      .dwattr $C$DW$201, DW_AT_data_member_location[DW_OP_plus_uconst 0xb6]
    1812                      .dwattr $C$DW$201, DW_AT_accessibility(DW_ACCESS_public)
    1813              $C$DW$202       .dwtag  DW_TAG_member
    1814                      .dwattr $C$DW$202, DW_AT_type(*$C$DW$T$32)
    1815                      .dwattr $C$DW$202, DW_AT_name("SCIRXINTC")
    1816                      .dwattr $C$DW$202, DW_AT_TI_symbol_name("_SCIRXINTC")
    1817                      .dwattr $C$DW$202, DW_AT_data_member_location[DW_OP_plus_uconst 0xb8]
    1818                      .dwattr $C$DW$202, DW_AT_accessibility(DW_ACCESS_public)
    1819              $C$DW$203       .dwtag  DW_TAG_member
    1820                      .dwattr $C$DW$203, DW_AT_type(*$C$DW$T$32)
    1821                      .dwattr $C$DW$203, DW_AT_name("SCITXINTC")
    1822                      .dwattr $C$DW$203, DW_AT_TI_symbol_name("_SCITXINTC")
    1823                      .dwattr $C$DW$203, DW_AT_data_member_location[DW_OP_plus_uconst 0xba]
    1824                      .dwattr $C$DW$203, DW_AT_accessibility(DW_ACCESS_public)
    1825              $C$DW$204       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:14 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0371210                           PAGE   35

    1826                      .dwattr $C$DW$204, DW_AT_type(*$C$DW$T$32)
    1827                      .dwattr $C$DW$204, DW_AT_name("rsvd8_7")
    1828                      .dwattr $C$DW$204, DW_AT_TI_symbol_name("_rsvd8_7")
    1829                      .dwattr $C$DW$204, DW_AT_data_member_location[DW_OP_plus_uconst 0xbc]
    1830                      .dwattr $C$DW$204, DW_AT_accessibility(DW_ACCESS_public)
    1831              $C$DW$205       .dwtag  DW_TAG_member
    1832                      .dwattr $C$DW$205, DW_AT_type(*$C$DW$T$32)
    1833                      .dwattr $C$DW$205, DW_AT_name("rsvd8_8")
    1834                      .dwattr $C$DW$205, DW_AT_TI_symbol_name("_rsvd8_8")
    1835                      .dwattr $C$DW$205, DW_AT_data_member_location[DW_OP_plus_uconst 0xbe]
    1836                      .dwattr $C$DW$205, DW_AT_accessibility(DW_ACCESS_public)
    1837              $C$DW$206       .dwtag  DW_TAG_member
    1838                      .dwattr $C$DW$206, DW_AT_type(*$C$DW$T$32)
    1839                      .dwattr $C$DW$206, DW_AT_name("SCIRXINTA")
    1840                      .dwattr $C$DW$206, DW_AT_TI_symbol_name("_SCIRXINTA")
    1841                      .dwattr $C$DW$206, DW_AT_data_member_location[DW_OP_plus_uconst 0xc0]
    1842                      .dwattr $C$DW$206, DW_AT_accessibility(DW_ACCESS_public)
    1843              $C$DW$207       .dwtag  DW_TAG_member
    1844                      .dwattr $C$DW$207, DW_AT_type(*$C$DW$T$32)
    1845                      .dwattr $C$DW$207, DW_AT_name("SCITXINTA")
    1846                      .dwattr $C$DW$207, DW_AT_TI_symbol_name("_SCITXINTA")
    1847                      .dwattr $C$DW$207, DW_AT_data_member_location[DW_OP_plus_uconst 0xc2]
    1848                      .dwattr $C$DW$207, DW_AT_accessibility(DW_ACCESS_public)
    1849              $C$DW$208       .dwtag  DW_TAG_member
    1850                      .dwattr $C$DW$208, DW_AT_type(*$C$DW$T$32)
    1851                      .dwattr $C$DW$208, DW_AT_name("SCIRXINTB")
    1852                      .dwattr $C$DW$208, DW_AT_TI_symbol_name("_SCIRXINTB")
    1853                      .dwattr $C$DW$208, DW_AT_data_member_location[DW_OP_plus_uconst 0xc4]
    1854                      .dwattr $C$DW$208, DW_AT_accessibility(DW_ACCESS_public)
    1855              $C$DW$209       .dwtag  DW_TAG_member
    1856                      .dwattr $C$DW$209, DW_AT_type(*$C$DW$T$32)
    1857                      .dwattr $C$DW$209, DW_AT_name("SCITXINTB")
    1858                      .dwattr $C$DW$209, DW_AT_TI_symbol_name("_SCITXINTB")
    1859                      .dwattr $C$DW$209, DW_AT_data_member_location[DW_OP_plus_uconst 0xc6]
    1860                      .dwattr $C$DW$209, DW_AT_accessibility(DW_ACCESS_public)
    1861              $C$DW$210       .dwtag  DW_TAG_member
    1862                      .dwattr $C$DW$210, DW_AT_type(*$C$DW$T$32)
    1863                      .dwattr $C$DW$210, DW_AT_name("ECAN0INTA")
    1864                      .dwattr $C$DW$210, DW_AT_TI_symbol_name("_ECAN0INTA")
    1865                      .dwattr $C$DW$210, DW_AT_data_member_location[DW_OP_plus_uconst 0xc8]
    1866                      .dwattr $C$DW$210, DW_AT_accessibility(DW_ACCESS_public)
    1867              $C$DW$211       .dwtag  DW_TAG_member
    1868                      .dwattr $C$DW$211, DW_AT_type(*$C$DW$T$32)
