TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:08 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0554410                           PAGE    1

       1              ;***************************************************************
       2              ;* TMS320C2000 C/C++ Codegen                         PC v6.2.7 *
       3              ;* Date/Time created: Thu Jul 02 08:31:07 2015                 *
       4              ;***************************************************************
       5                      .compiler_opts --diag_wrap=off --float_support=fpu32 --hll_source=on --mem_model:code=flat --mem_mode
       6        0002  FP      .set    XAR2
       7              
       8              $C$DW$CU        .dwtag  DW_TAG_compile_unit
       9                      .dwattr $C$DW$CU, DW_AT_name("../blink/ledBlink.c")
      10                      .dwattr $C$DW$CU, DW_AT_producer("TMS320C2000 C/C++ Codegen PC v6.2.7 Copyright (c) 1996-2014 Texas I
      11                      .dwattr $C$DW$CU, DW_AT_TI_version(0x01)
      12                      .dwattr $C$DW$CU, DW_AT_comp_dir("D:\ActiveProject\EKT5\PKMT_NONBIOS\InvertorCntrl\ISPprg")
      13              
      14              $C$DW$1 .dwtag  DW_TAG_subprogram, DW_AT_name("addedTimeTic")
      15                      .dwattr $C$DW$1, DW_AT_TI_symbol_name("_addedTimeTic")
      16                      .dwattr $C$DW$1, DW_AT_type(*$C$DW$T$5)

    1045                      .dwcfi  cfa_offset, -2
    1046                      .dwcfi  save_reg_to_mem, 26, 0
    1047                      .dwcfi  save_reg_to_reg, 78, 26
    1048                      .dwpsn  file "../blink/ledBlink.c",line 175,column 2,is_stmt
    1049 000001a1 761F!         MOVW      DP,#_GpioDataRegs+18  ; [CPU_U] 
         000001a2 0000 
    1050 000001a3 1A12!         OR        @_GpioDataRegs+18,#0x2000 ; [CPU_] |175| 
         000001a4 2000 
    1051                      .dwpsn  file "../blink/ledBlink.c",line 176,column 1,is_stmt
    1052              $C$DW$47        .dwtag  DW_TAG_TI_branch
    1053                      .dwattr $C$DW$47, DW_AT_low_pc(0x00)
    1054                      .dwattr $C$DW$47, DW_AT_TI_return
    1055 000001a5 0006          LRETR     ; [CPU_] 
    1056                      ; return occurs ; [] 
    1057                      .dwattr $C$DW$46, DW_AT_TI_end_file("../blink/ledBlink.c")
    1058                      .dwattr $C$DW$46, DW_AT_TI_end_line(0xb0)
    1059                      .dwattr $C$DW$46, DW_AT_TI_end_column(0x01)
    1060                      .dwendentry
    1061                      .dwendtag $C$DW$46
    1062              
    1063 000001a6               .sect   ".text"
    1064                      .clink
    1065                      .global _clrPin3
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:08 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0554410                           PAGE   23

    1066              
    1067              $C$DW$48        .dwtag  DW_TAG_subprogram, DW_AT_name("clrPin3")
    1068                      .dwattr $C$DW$48, DW_AT_low_pc(_clrPin3)
    1069                      .dwattr $C$DW$48, DW_AT_high_pc(0x00)
    1070                      .dwattr $C$DW$48, DW_AT_TI_symbol_name("_clrPin3")
    1071                      .dwattr $C$DW$48, DW_AT_external
    1072                      .dwattr $C$DW$48, DW_AT_TI_begin_file("../blink/ledBlink.c")
    1073                      .dwattr $C$DW$48, DW_AT_TI_begin_line(0xb2)
    1074                      .dwattr $C$DW$48, DW_AT_TI_begin_column(0x06)
    1075                      .dwattr $C$DW$48, DW_AT_TI_max_frame_size(-2)
    1076                      .dwpsn  file "../blink/ledBlink.c",line 178,column 19,is_stmt,address _clrPin3
    1077              
    1078                      .dwfde $C$DW$CIE, _clrPin3
    1079              
    1080              ;***************************************************************
    1081              ;* FNAME: _clrPin3                      FR SIZE:   0           *
    1082              ;*                                                             *
    1083              ;* FUNCTION ENVIRONMENT                                        *
    1084              ;*                                                             *
    1085              ;* FUNCTION PROPERTIES                                         *
    1086              ;*                            0 Parameter,  0 Auto,  0 SOE     *
    1087              ;***************************************************************
    1088              
    1089 000001a6       _clrPin3:
    1090                      .dwcfi  cfa_offset, -2
    1091                      .dwcfi  save_reg_to_mem, 26, 0
    1092                      .dwcfi  save_reg_to_reg, 78, 26
    1093                      .dwpsn  file "../blink/ledBlink.c",line 179,column 2,is_stmt
    1094 000001a6 761F!         MOVW      DP,#_GpioDataRegs+20  ; [CPU_U] 
         000001a7 0000 
    1095 000001a8 1A14!         OR        @_GpioDataRegs+20,#0x2000 ; [CPU_] |179| 
         000001a9 2000 
    1096                      .dwpsn  file "../blink/ledBlink.c",line 180,column 1,is_stmt
    1097              $C$DW$49        .dwtag  DW_TAG_TI_branch
    1098                      .dwattr $C$DW$49, DW_AT_low_pc(0x00)
    1099                      .dwattr $C$DW$49, DW_AT_TI_return
    1100 000001aa 0006          LRETR     ; [CPU_] 
    1101                      ; return occurs ; [] 
    1102                      .dwattr $C$DW$48, DW_AT_TI_end_file("../blink/ledBlink.c")
    1103                      .dwattr $C$DW$48, DW_AT_TI_end_line(0xb4)
    1104                      .dwattr $C$DW$48, DW_AT_TI_end_column(0x01)
    1105                      .dwendentry
    1106                      .dwendtag $C$DW$48
    1107              
    1108              ;**************************************************************
    1109              ;* UNDEFINED EXTERNAL REFERENCES                              *
    1110              ;**************************************************************
    1111                      .global _addedTimeTic
    1112                      .global _removeTimeTic
    1113                      .global _GpioDataRegs
    1114                      .global _GpioCtrlRegs
    1115              
    1116              ;***************************************************************
    1117              ;* TYPE INFORMATION                                            *
    1118              ;***************************************************************
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:08 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0554410                           PAGE   24

    1119              
    1120              $C$DW$T$20      .dwtag  DW_TAG_structure_type
    1121                      .dwattr $C$DW$T$20, DW_AT_name("GPA1_BITS")
    1122                      .dwattr $C$DW$T$20, DW_AT_byte_size(0x02)
    1123              $C$DW$50        .dwtag  DW_TAG_member
    1124                      .dwattr $C$DW$50, DW_AT_type(*$C$DW$T$19)
    1125                      .dwattr $C$DW$50, DW_AT_name("GPIO0")
    1126                      .dwattr $C$DW$50, DW_AT_TI_symbol_name("_GPIO0")
    1127                      .dwattr $C$DW$50, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x02)
    1128                      .dwattr $C$DW$50, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1129                      .dwattr $C$DW$50, DW_AT_accessibility(DW_ACCESS_public)
    1130              $C$DW$51        .dwtag  DW_TAG_member
    1131                      .dwattr $C$DW$51, DW_AT_type(*$C$DW$T$19)
    1132                      .dwattr $C$DW$51, DW_AT_name("GPIO1")
    1133                      .dwattr $C$DW$51, DW_AT_TI_symbol_name("_GPIO1")
    1134                      .dwattr $C$DW$51, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x02)
    1135                      .dwattr $C$DW$51, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1136                      .dwattr $C$DW$51, DW_AT_accessibility(DW_ACCESS_public)
    1137              $C$DW$52        .dwtag  DW_TAG_member
    1138                      .dwattr $C$DW$52, DW_AT_type(*$C$DW$T$19)
    1139                      .dwattr $C$DW$52, DW_AT_name("GPIO2")
    1140                      .dwattr $C$DW$52, DW_AT_TI_symbol_name("_GPIO2")
    1141                      .dwattr $C$DW$52, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x02)
    1142                      .dwattr $C$DW$52, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1143                      .dwattr $C$DW$52, DW_AT_accessibility(DW_ACCESS_public)
    1144              $C$DW$53        .dwtag  DW_TAG_member
    1145                      .dwattr $C$DW$53, DW_AT_type(*$C$DW$T$19)
    1146                      .dwattr $C$DW$53, DW_AT_name("GPIO3")
    1147                      .dwattr $C$DW$53, DW_AT_TI_symbol_name("_GPIO3")
    1148                      .dwattr $C$DW$53, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x02)
    1149                      .dwattr $C$DW$53, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1150                      .dwattr $C$DW$53, DW_AT_accessibility(DW_ACCESS_public)
    1151              $C$DW$54        .dwtag  DW_TAG_member
    1152                      .dwattr $C$DW$54, DW_AT_type(*$C$DW$T$19)
    1153                      .dwattr $C$DW$54, DW_AT_name("GPIO4")
    1154                      .dwattr $C$DW$54, DW_AT_TI_symbol_name("_GPIO4")
    1155                      .dwattr $C$DW$54, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x02)
    1156                      .dwattr $C$DW$54, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1157                      .dwattr $C$DW$54, DW_AT_accessibility(DW_ACCESS_public)
    1158              $C$DW$55        .dwtag  DW_TAG_member
    1159                      .dwattr $C$DW$55, DW_AT_type(*$C$DW$T$19)
    1160                      .dwattr $C$DW$55, DW_AT_name("GPIO5")
    1161                      .dwattr $C$DW$55, DW_AT_TI_symbol_name("_GPIO5")
    1162                      .dwattr $C$DW$55, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x02)
    1163                      .dwattr $C$DW$55, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1164                      .dwattr $C$DW$55, DW_AT_accessibility(DW_ACCESS_public)
    1165              $C$DW$56        .dwtag  DW_TAG_member
    1166                      .dwattr $C$DW$56, DW_AT_type(*$C$DW$T$19)
    1167                      .dwattr $C$DW$56, DW_AT_name("GPIO6")
    1168                      .dwattr $C$DW$56, DW_AT_TI_symbol_name("_GPIO6")
    1169                      .dwattr $C$DW$56, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x02)
    1170                      .dwattr $C$DW$56, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1171                      .dwattr $C$DW$56, DW_AT_accessibility(DW_ACCESS_public)
    1172              $C$DW$57        .dwtag  DW_TAG_member
    1173                      .dwattr $C$DW$57, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:08 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0554410                           PAGE   25

    1174                      .dwattr $C$DW$57, DW_AT_name("GPIO7")
    1175                      .dwattr $C$DW$57, DW_AT_TI_symbol_name("_GPIO7")
    1176                      .dwattr $C$DW$57, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x02)
    1177                      .dwattr $C$DW$57, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1178                      .dwattr $C$DW$57, DW_AT_accessibility(DW_ACCESS_public)
    1179              $C$DW$58        .dwtag  DW_TAG_member
    1180                      .dwattr $C$DW$58, DW_AT_type(*$C$DW$T$19)
    1181                      .dwattr $C$DW$58, DW_AT_name("GPIO8")
    1182                      .dwattr $C$DW$58, DW_AT_TI_symbol_name("_GPIO8")
    1183                      .dwattr $C$DW$58, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x02)
    1184                      .dwattr $C$DW$58, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1185                      .dwattr $C$DW$58, DW_AT_accessibility(DW_ACCESS_public)
    1186              $C$DW$59        .dwtag  DW_TAG_member
    1187                      .dwattr $C$DW$59, DW_AT_type(*$C$DW$T$19)
    1188                      .dwattr $C$DW$59, DW_AT_name("GPIO9")
    1189                      .dwattr $C$DW$59, DW_AT_TI_symbol_name("_GPIO9")
    1190                      .dwattr $C$DW$59, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x02)
    1191                      .dwattr $C$DW$59, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1192                      .dwattr $C$DW$59, DW_AT_accessibility(DW_ACCESS_public)
    1193              $C$DW$60        .dwtag  DW_TAG_member
    1194                      .dwattr $C$DW$60, DW_AT_type(*$C$DW$T$19)
    1195                      .dwattr $C$DW$60, DW_AT_name("GPIO10")
    1196                      .dwattr $C$DW$60, DW_AT_TI_symbol_name("_GPIO10")
    1197                      .dwattr $C$DW$60, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x02)
    1198                      .dwattr $C$DW$60, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1199                      .dwattr $C$DW$60, DW_AT_accessibility(DW_ACCESS_public)
    1200              $C$DW$61        .dwtag  DW_TAG_member
    1201                      .dwattr $C$DW$61, DW_AT_type(*$C$DW$T$19)
    1202                      .dwattr $C$DW$61, DW_AT_name("GPIO11")
    1203                      .dwattr $C$DW$61, DW_AT_TI_symbol_name("_GPIO11")
    1204                      .dwattr $C$DW$61, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x02)
    1205                      .dwattr $C$DW$61, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1206                      .dwattr $C$DW$61, DW_AT_accessibility(DW_ACCESS_public)
    1207              $C$DW$62        .dwtag  DW_TAG_member
    1208                      .dwattr $C$DW$62, DW_AT_type(*$C$DW$T$19)
    1209                      .dwattr $C$DW$62, DW_AT_name("GPIO12")
    1210                      .dwattr $C$DW$62, DW_AT_TI_symbol_name("_GPIO12")
    1211                      .dwattr $C$DW$62, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x02)
    1212                      .dwattr $C$DW$62, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1213                      .dwattr $C$DW$62, DW_AT_accessibility(DW_ACCESS_public)
    1214              $C$DW$63        .dwtag  DW_TAG_member
    1215                      .dwattr $C$DW$63, DW_AT_type(*$C$DW$T$19)
    1216                      .dwattr $C$DW$63, DW_AT_name("GPIO13")
    1217                      .dwattr $C$DW$63, DW_AT_TI_symbol_name("_GPIO13")
    1218                      .dwattr $C$DW$63, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x02)
    1219                      .dwattr $C$DW$63, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1220                      .dwattr $C$DW$63, DW_AT_accessibility(DW_ACCESS_public)
    1221              $C$DW$64        .dwtag  DW_TAG_member
    1222                      .dwattr $C$DW$64, DW_AT_type(*$C$DW$T$19)
    1223                      .dwattr $C$DW$64, DW_AT_name("GPIO14")
    1224                      .dwattr $C$DW$64, DW_AT_TI_symbol_name("_GPIO14")
    1225                      .dwattr $C$DW$64, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x02)
    1226                      .dwattr $C$DW$64, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1227                      .dwattr $C$DW$64, DW_AT_accessibility(DW_ACCESS_public)
    1228              $C$DW$65        .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:08 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0554410                           PAGE   26

    1229                      .dwattr $C$DW$65, DW_AT_type(*$C$DW$T$19)
    1230                      .dwattr $C$DW$65, DW_AT_name("GPIO15")
    1231                      .dwattr $C$DW$65, DW_AT_TI_symbol_name("_GPIO15")
    1232                      .dwattr $C$DW$65, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x02)
    1233                      .dwattr $C$DW$65, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1234                      .dwattr $C$DW$65, DW_AT_accessibility(DW_ACCESS_public)
    1235                      .dwendtag $C$DW$T$20
    1236              
    1237              
    1238              $C$DW$T$22      .dwtag  DW_TAG_union_type
    1239                      .dwattr $C$DW$T$22, DW_AT_name("GPA1_REG")
    1240                      .dwattr $C$DW$T$22, DW_AT_byte_size(0x02)
    1241              $C$DW$66        .dwtag  DW_TAG_member
    1242                      .dwattr $C$DW$66, DW_AT_type(*$C$DW$T$21)
    1243                      .dwattr $C$DW$66, DW_AT_name("all")
    1244                      .dwattr $C$DW$66, DW_AT_TI_symbol_name("_all")
    1245                      .dwattr $C$DW$66, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1246                      .dwattr $C$DW$66, DW_AT_accessibility(DW_ACCESS_public)
    1247              $C$DW$67        .dwtag  DW_TAG_member
    1248                      .dwattr $C$DW$67, DW_AT_type(*$C$DW$T$20)
    1249                      .dwattr $C$DW$67, DW_AT_name("bit")
    1250                      .dwattr $C$DW$67, DW_AT_TI_symbol_name("_bit")
    1251                      .dwattr $C$DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1252                      .dwattr $C$DW$67, DW_AT_accessibility(DW_ACCESS_public)
    1253                      .dwendtag $C$DW$T$22
    1254              
    1255              
    1256              $C$DW$T$23      .dwtag  DW_TAG_structure_type
    1257                      .dwattr $C$DW$T$23, DW_AT_name("GPA2_BITS")
    1258                      .dwattr $C$DW$T$23, DW_AT_byte_size(0x02)
    1259              $C$DW$68        .dwtag  DW_TAG_member
    1260                      .dwattr $C$DW$68, DW_AT_type(*$C$DW$T$19)
    1261                      .dwattr $C$DW$68, DW_AT_name("GPIO16")
    1262                      .dwattr $C$DW$68, DW_AT_TI_symbol_name("_GPIO16")
    1263                      .dwattr $C$DW$68, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x02)
    1264                      .dwattr $C$DW$68, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1265                      .dwattr $C$DW$68, DW_AT_accessibility(DW_ACCESS_public)
    1266              $C$DW$69        .dwtag  DW_TAG_member
    1267                      .dwattr $C$DW$69, DW_AT_type(*$C$DW$T$19)
    1268                      .dwattr $C$DW$69, DW_AT_name("GPIO17")
    1269                      .dwattr $C$DW$69, DW_AT_TI_symbol_name("_GPIO17")
    1270                      .dwattr $C$DW$69, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x02)
    1271                      .dwattr $C$DW$69, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1272                      .dwattr $C$DW$69, DW_AT_accessibility(DW_ACCESS_public)
    1273              $C$DW$70        .dwtag  DW_TAG_member
    1274                      .dwattr $C$DW$70, DW_AT_type(*$C$DW$T$19)
    1275                      .dwattr $C$DW$70, DW_AT_name("GPIO18")
    1276                      .dwattr $C$DW$70, DW_AT_TI_symbol_name("_GPIO18")
    1277                      .dwattr $C$DW$70, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x02)
    1278                      .dwattr $C$DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1279                      .dwattr $C$DW$70, DW_AT_accessibility(DW_ACCESS_public)
    1280              $C$DW$71        .dwtag  DW_TAG_member
    1281                      .dwattr $C$DW$71, DW_AT_type(*$C$DW$T$19)
    1282                      .dwattr $C$DW$71, DW_AT_name("GPIO19")
    1283                      .dwattr $C$DW$71, DW_AT_TI_symbol_name("_GPIO19")
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:08 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0554410                           PAGE   27

    1284                      .dwattr $C$DW$71, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x02)
    1285                      .dwattr $C$DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1286                      .dwattr $C$DW$71, DW_AT_accessibility(DW_ACCESS_public)
    1287              $C$DW$72        .dwtag  DW_TAG_member
    1288                      .dwattr $C$DW$72, DW_AT_type(*$C$DW$T$19)
    1289                      .dwattr $C$DW$72, DW_AT_name("GPIO20")
    1290                      .dwattr $C$DW$72, DW_AT_TI_symbol_name("_GPIO20")
    1291                      .dwattr $C$DW$72, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x02)
    1292                      .dwattr $C$DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1293                      .dwattr $C$DW$72, DW_AT_accessibility(DW_ACCESS_public)
    1294              $C$DW$73        .dwtag  DW_TAG_member
    1295                      .dwattr $C$DW$73, DW_AT_type(*$C$DW$T$19)
    1296                      .dwattr $C$DW$73, DW_AT_name("GPIO21")
    1297                      .dwattr $C$DW$73, DW_AT_TI_symbol_name("_GPIO21")
    1298                      .dwattr $C$DW$73, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x02)
    1299                      .dwattr $C$DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1300                      .dwattr $C$DW$73, DW_AT_accessibility(DW_ACCESS_public)
    1301              $C$DW$74        .dwtag  DW_TAG_member
    1302                      .dwattr $C$DW$74, DW_AT_type(*$C$DW$T$19)
    1303                      .dwattr $C$DW$74, DW_AT_name("GPIO22")
    1304                      .dwattr $C$DW$74, DW_AT_TI_symbol_name("_GPIO22")
    1305                      .dwattr $C$DW$74, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x02)
    1306                      .dwattr $C$DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1307                      .dwattr $C$DW$74, DW_AT_accessibility(DW_ACCESS_public)
    1308              $C$DW$75        .dwtag  DW_TAG_member
    1309                      .dwattr $C$DW$75, DW_AT_type(*$C$DW$T$19)
    1310                      .dwattr $C$DW$75, DW_AT_name("GPIO23")
    1311                      .dwattr $C$DW$75, DW_AT_TI_symbol_name("_GPIO23")
    1312                      .dwattr $C$DW$75, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x02)
    1313                      .dwattr $C$DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1314                      .dwattr $C$DW$75, DW_AT_accessibility(DW_ACCESS_public)
    1315              $C$DW$76        .dwtag  DW_TAG_member
    1316                      .dwattr $C$DW$76, DW_AT_type(*$C$DW$T$19)
    1317                      .dwattr $C$DW$76, DW_AT_name("GPIO24")
    1318                      .dwattr $C$DW$76, DW_AT_TI_symbol_name("_GPIO24")
    1319                      .dwattr $C$DW$76, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x02)
    1320                      .dwattr $C$DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1321                      .dwattr $C$DW$76, DW_AT_accessibility(DW_ACCESS_public)
    1322              $C$DW$77        .dwtag  DW_TAG_member
    1323                      .dwattr $C$DW$77, DW_AT_type(*$C$DW$T$19)
    1324                      .dwattr $C$DW$77, DW_AT_name("GPIO25")
    1325                      .dwattr $C$DW$77, DW_AT_TI_symbol_name("_GPIO25")
    1326                      .dwattr $C$DW$77, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x02)
    1327                      .dwattr $C$DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1328                      .dwattr $C$DW$77, DW_AT_accessibility(DW_ACCESS_public)
    1329              $C$DW$78        .dwtag  DW_TAG_member
    1330                      .dwattr $C$DW$78, DW_AT_type(*$C$DW$T$19)
    1331                      .dwattr $C$DW$78, DW_AT_name("GPIO26")
    1332                      .dwattr $C$DW$78, DW_AT_TI_symbol_name("_GPIO26")
    1333                      .dwattr $C$DW$78, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x02)
    1334                      .dwattr $C$DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1335                      .dwattr $C$DW$78, DW_AT_accessibility(DW_ACCESS_public)
    1336              $C$DW$79        .dwtag  DW_TAG_member
    1337                      .dwattr $C$DW$79, DW_AT_type(*$C$DW$T$19)
    1338                      .dwattr $C$DW$79, DW_AT_name("GPIO27")
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:08 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0554410                           PAGE   28

    1339                      .dwattr $C$DW$79, DW_AT_TI_symbol_name("_GPIO27")
    1340                      .dwattr $C$DW$79, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x02)
    1341                      .dwattr $C$DW$79, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1342                      .dwattr $C$DW$79, DW_AT_accessibility(DW_ACCESS_public)
    1343              $C$DW$80        .dwtag  DW_TAG_member
    1344                      .dwattr $C$DW$80, DW_AT_type(*$C$DW$T$19)
    1345                      .dwattr $C$DW$80, DW_AT_name("GPIO28")
    1346                      .dwattr $C$DW$80, DW_AT_TI_symbol_name("_GPIO28")
    1347                      .dwattr $C$DW$80, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x02)
    1348                      .dwattr $C$DW$80, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1349                      .dwattr $C$DW$80, DW_AT_accessibility(DW_ACCESS_public)
    1350              $C$DW$81        .dwtag  DW_TAG_member
    1351                      .dwattr $C$DW$81, DW_AT_type(*$C$DW$T$19)
    1352                      .dwattr $C$DW$81, DW_AT_name("GPIO29")
    1353                      .dwattr $C$DW$81, DW_AT_TI_symbol_name("_GPIO29")
    1354                      .dwattr $C$DW$81, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x02)
    1355                      .dwattr $C$DW$81, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1356                      .dwattr $C$DW$81, DW_AT_accessibility(DW_ACCESS_public)
    1357              $C$DW$82        .dwtag  DW_TAG_member
    1358                      .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$19)
    1359                      .dwattr $C$DW$82, DW_AT_name("GPIO30")
    1360                      .dwattr $C$DW$82, DW_AT_TI_symbol_name("_GPIO30")
    1361                      .dwattr $C$DW$82, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x02)
    1362                      .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1363                      .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
    1364              $C$DW$83        .dwtag  DW_TAG_member
    1365                      .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$19)
    1366                      .dwattr $C$DW$83, DW_AT_name("GPIO31")
    1367                      .dwattr $C$DW$83, DW_AT_TI_symbol_name("_GPIO31")
    1368                      .dwattr $C$DW$83, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x02)
    1369                      .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1370                      .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
    1371                      .dwendtag $C$DW$T$23
    1372              
    1373              
    1374              $C$DW$T$24      .dwtag  DW_TAG_union_type
    1375                      .dwattr $C$DW$T$24, DW_AT_name("GPA2_REG")
    1376                      .dwattr $C$DW$T$24, DW_AT_byte_size(0x02)
    1377              $C$DW$84        .dwtag  DW_TAG_member
    1378                      .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$21)
    1379                      .dwattr $C$DW$84, DW_AT_name("all")
    1380                      .dwattr $C$DW$84, DW_AT_TI_symbol_name("_all")
    1381                      .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1382                      .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
    1383              $C$DW$85        .dwtag  DW_TAG_member
    1384                      .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$23)
    1385                      .dwattr $C$DW$85, DW_AT_name("bit")
    1386                      .dwattr $C$DW$85, DW_AT_TI_symbol_name("_bit")
    1387                      .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1388                      .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
    1389                      .dwendtag $C$DW$T$24
    1390              
    1391              
    1392              $C$DW$T$25      .dwtag  DW_TAG_structure_type
    1393                      .dwattr $C$DW$T$25, DW_AT_name("GPACTRL_BITS")
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:08 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0554410                           PAGE   29

    1394                      .dwattr $C$DW$T$25, DW_AT_byte_size(0x02)
    1395              $C$DW$86        .dwtag  DW_TAG_member
    1396                      .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$19)
    1397                      .dwattr $C$DW$86, DW_AT_name("QUALPRD0")
    1398                      .dwattr $C$DW$86, DW_AT_TI_symbol_name("_QUALPRD0")
    1399                      .dwattr $C$DW$86, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x08)
    1400                      .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1401                      .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
    1402              $C$DW$87        .dwtag  DW_TAG_member
    1403                      .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$19)
    1404                      .dwattr $C$DW$87, DW_AT_name("QUALPRD1")
    1405                      .dwattr $C$DW$87, DW_AT_TI_symbol_name("_QUALPRD1")
    1406                      .dwattr $C$DW$87, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x08)
    1407                      .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1408                      .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
    1409              $C$DW$88        .dwtag  DW_TAG_member
    1410                      .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$19)
    1411                      .dwattr $C$DW$88, DW_AT_name("QUALPRD2")
    1412                      .dwattr $C$DW$88, DW_AT_TI_symbol_name("_QUALPRD2")
    1413                      .dwattr $C$DW$88, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x08)
    1414                      .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1415                      .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
    1416              $C$DW$89        .dwtag  DW_TAG_member
    1417                      .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$19)
    1418                      .dwattr $C$DW$89, DW_AT_name("QUALPRD3")
    1419                      .dwattr $C$DW$89, DW_AT_TI_symbol_name("_QUALPRD3")
    1420                      .dwattr $C$DW$89, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x08)
    1421                      .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1422                      .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
    1423                      .dwendtag $C$DW$T$25
    1424              
    1425              
    1426              $C$DW$T$26      .dwtag  DW_TAG_union_type
    1427                      .dwattr $C$DW$T$26, DW_AT_name("GPACTRL_REG")
    1428                      .dwattr $C$DW$T$26, DW_AT_byte_size(0x02)
    1429              $C$DW$90        .dwtag  DW_TAG_member
    1430                      .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$21)
    1431                      .dwattr $C$DW$90, DW_AT_name("all")
    1432                      .dwattr $C$DW$90, DW_AT_TI_symbol_name("_all")
    1433                      .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1434                      .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
    1435              $C$DW$91        .dwtag  DW_TAG_member
    1436                      .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$25)
    1437                      .dwattr $C$DW$91, DW_AT_name("bit")
    1438                      .dwattr $C$DW$91, DW_AT_TI_symbol_name("_bit")
    1439                      .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1440                      .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
    1441                      .dwendtag $C$DW$T$26
    1442              
    1443              
    1444              $C$DW$T$27      .dwtag  DW_TAG_structure_type
    1445                      .dwattr $C$DW$T$27, DW_AT_name("GPADAT_BITS")
    1446                      .dwattr $C$DW$T$27, DW_AT_byte_size(0x02)
    1447              $C$DW$92        .dwtag  DW_TAG_member
    1448                      .dwattr $C$DW$92, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:08 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0554410                           PAGE   30

    1449                      .dwattr $C$DW$92, DW_AT_name("GPIO0")
    1450                      .dwattr $C$DW$92, DW_AT_TI_symbol_name("_GPIO0")
    1451                      .dwattr $C$DW$92, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    1452                      .dwattr $C$DW$92, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1453                      .dwattr $C$DW$92, DW_AT_accessibility(DW_ACCESS_public)
    1454              $C$DW$93        .dwtag  DW_TAG_member
    1455                      .dwattr $C$DW$93, DW_AT_type(*$C$DW$T$19)
    1456                      .dwattr $C$DW$93, DW_AT_name("GPIO1")
    1457                      .dwattr $C$DW$93, DW_AT_TI_symbol_name("_GPIO1")
    1458                      .dwattr $C$DW$93, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    1459                      .dwattr $C$DW$93, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1460                      .dwattr $C$DW$93, DW_AT_accessibility(DW_ACCESS_public)
    1461              $C$DW$94        .dwtag  DW_TAG_member
    1462                      .dwattr $C$DW$94, DW_AT_type(*$C$DW$T$19)
    1463                      .dwattr $C$DW$94, DW_AT_name("GPIO2")
    1464                      .dwattr $C$DW$94, DW_AT_TI_symbol_name("_GPIO2")
    1465                      .dwattr $C$DW$94, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    1466                      .dwattr $C$DW$94, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1467                      .dwattr $C$DW$94, DW_AT_accessibility(DW_ACCESS_public)
    1468              $C$DW$95        .dwtag  DW_TAG_member
    1469                      .dwattr $C$DW$95, DW_AT_type(*$C$DW$T$19)
    1470                      .dwattr $C$DW$95, DW_AT_name("GPIO3")
    1471                      .dwattr $C$DW$95, DW_AT_TI_symbol_name("_GPIO3")
    1472                      .dwattr $C$DW$95, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    1473                      .dwattr $C$DW$95, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1474                      .dwattr $C$DW$95, DW_AT_accessibility(DW_ACCESS_public)
    1475              $C$DW$96        .dwtag  DW_TAG_member
    1476                      .dwattr $C$DW$96, DW_AT_type(*$C$DW$T$19)
    1477                      .dwattr $C$DW$96, DW_AT_name("GPIO4")
    1478                      .dwattr $C$DW$96, DW_AT_TI_symbol_name("_GPIO4")
    1479                      .dwattr $C$DW$96, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    1480                      .dwattr $C$DW$96, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1481                      .dwattr $C$DW$96, DW_AT_accessibility(DW_ACCESS_public)
    1482              $C$DW$97        .dwtag  DW_TAG_member
    1483                      .dwattr $C$DW$97, DW_AT_type(*$C$DW$T$19)
    1484                      .dwattr $C$DW$97, DW_AT_name("GPIO5")
    1485                      .dwattr $C$DW$97, DW_AT_TI_symbol_name("_GPIO5")
    1486                      .dwattr $C$DW$97, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    1487                      .dwattr $C$DW$97, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1488                      .dwattr $C$DW$97, DW_AT_accessibility(DW_ACCESS_public)
    1489              $C$DW$98        .dwtag  DW_TAG_member
    1490                      .dwattr $C$DW$98, DW_AT_type(*$C$DW$T$19)
    1491                      .dwattr $C$DW$98, DW_AT_name("GPIO6")
    1492                      .dwattr $C$DW$98, DW_AT_TI_symbol_name("_GPIO6")
    1493                      .dwattr $C$DW$98, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    1494                      .dwattr $C$DW$98, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1495                      .dwattr $C$DW$98, DW_AT_accessibility(DW_ACCESS_public)
    1496              $C$DW$99        .dwtag  DW_TAG_member
    1497                      .dwattr $C$DW$99, DW_AT_type(*$C$DW$T$19)
    1498                      .dwattr $C$DW$99, DW_AT_name("GPIO7")
    1499                      .dwattr $C$DW$99, DW_AT_TI_symbol_name("_GPIO7")
    1500                      .dwattr $C$DW$99, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    1501                      .dwattr $C$DW$99, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1502                      .dwattr $C$DW$99, DW_AT_accessibility(DW_ACCESS_public)
    1503              $C$DW$100       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:08 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0554410                           PAGE   31

    1504                      .dwattr $C$DW$100, DW_AT_type(*$C$DW$T$19)
    1505                      .dwattr $C$DW$100, DW_AT_name("GPIO8")
    1506                      .dwattr $C$DW$100, DW_AT_TI_symbol_name("_GPIO8")
    1507                      .dwattr $C$DW$100, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
    1508                      .dwattr $C$DW$100, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1509                      .dwattr $C$DW$100, DW_AT_accessibility(DW_ACCESS_public)
    1510              $C$DW$101       .dwtag  DW_TAG_member
    1511                      .dwattr $C$DW$101, DW_AT_type(*$C$DW$T$19)
    1512                      .dwattr $C$DW$101, DW_AT_name("GPIO9")
    1513                      .dwattr $C$DW$101, DW_AT_TI_symbol_name("_GPIO9")
    1514                      .dwattr $C$DW$101, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    1515                      .dwattr $C$DW$101, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1516                      .dwattr $C$DW$101, DW_AT_accessibility(DW_ACCESS_public)
    1517              $C$DW$102       .dwtag  DW_TAG_member
    1518                      .dwattr $C$DW$102, DW_AT_type(*$C$DW$T$19)
    1519                      .dwattr $C$DW$102, DW_AT_name("GPIO10")
    1520                      .dwattr $C$DW$102, DW_AT_TI_symbol_name("_GPIO10")
    1521                      .dwattr $C$DW$102, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
    1522                      .dwattr $C$DW$102, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1523                      .dwattr $C$DW$102, DW_AT_accessibility(DW_ACCESS_public)
    1524              $C$DW$103       .dwtag  DW_TAG_member
    1525                      .dwattr $C$DW$103, DW_AT_type(*$C$DW$T$19)
    1526                      .dwattr $C$DW$103, DW_AT_name("GPIO11")
    1527                      .dwattr $C$DW$103, DW_AT_TI_symbol_name("_GPIO11")
    1528                      .dwattr $C$DW$103, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
    1529                      .dwattr $C$DW$103, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1530                      .dwattr $C$DW$103, DW_AT_accessibility(DW_ACCESS_public)
    1531              $C$DW$104       .dwtag  DW_TAG_member
    1532                      .dwattr $C$DW$104, DW_AT_type(*$C$DW$T$19)
    1533                      .dwattr $C$DW$104, DW_AT_name("GPIO12")
    1534                      .dwattr $C$DW$104, DW_AT_TI_symbol_name("_GPIO12")
    1535                      .dwattr $C$DW$104, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
    1536                      .dwattr $C$DW$104, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1537                      .dwattr $C$DW$104, DW_AT_accessibility(DW_ACCESS_public)
    1538              $C$DW$105       .dwtag  DW_TAG_member
    1539                      .dwattr $C$DW$105, DW_AT_type(*$C$DW$T$19)
    1540                      .dwattr $C$DW$105, DW_AT_name("GPIO13")
    1541                      .dwattr $C$DW$105, DW_AT_TI_symbol_name("_GPIO13")
    1542                      .dwattr $C$DW$105, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
    1543                      .dwattr $C$DW$105, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1544                      .dwattr $C$DW$105, DW_AT_accessibility(DW_ACCESS_public)
    1545              $C$DW$106       .dwtag  DW_TAG_member
    1546                      .dwattr $C$DW$106, DW_AT_type(*$C$DW$T$19)
    1547                      .dwattr $C$DW$106, DW_AT_name("GPIO14")
    1548                      .dwattr $C$DW$106, DW_AT_TI_symbol_name("_GPIO14")
    1549                      .dwattr $C$DW$106, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
    1550                      .dwattr $C$DW$106, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1551                      .dwattr $C$DW$106, DW_AT_accessibility(DW_ACCESS_public)
    1552              $C$DW$107       .dwtag  DW_TAG_member
    1553                      .dwattr $C$DW$107, DW_AT_type(*$C$DW$T$19)
    1554                      .dwattr $C$DW$107, DW_AT_name("GPIO15")
    1555                      .dwattr $C$DW$107, DW_AT_TI_symbol_name("_GPIO15")
    1556                      .dwattr $C$DW$107, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    1557                      .dwattr $C$DW$107, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1558                      .dwattr $C$DW$107, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:08 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0554410                           PAGE   32

    1559              $C$DW$108       .dwtag  DW_TAG_member
    1560                      .dwattr $C$DW$108, DW_AT_type(*$C$DW$T$19)
    1561                      .dwattr $C$DW$108, DW_AT_name("GPIO16")
    1562                      .dwattr $C$DW$108, DW_AT_TI_symbol_name("_GPIO16")
    1563                      .dwattr $C$DW$108, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    1564                      .dwattr $C$DW$108, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1565                      .dwattr $C$DW$108, DW_AT_accessibility(DW_ACCESS_public)
    1566              $C$DW$109       .dwtag  DW_TAG_member
    1567                      .dwattr $C$DW$109, DW_AT_type(*$C$DW$T$19)
    1568                      .dwattr $C$DW$109, DW_AT_name("GPIO17")
    1569                      .dwattr $C$DW$109, DW_AT_TI_symbol_name("_GPIO17")
    1570                      .dwattr $C$DW$109, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    1571                      .dwattr $C$DW$109, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1572                      .dwattr $C$DW$109, DW_AT_accessibility(DW_ACCESS_public)
    1573              $C$DW$110       .dwtag  DW_TAG_member
    1574                      .dwattr $C$DW$110, DW_AT_type(*$C$DW$T$19)
    1575                      .dwattr $C$DW$110, DW_AT_name("GPIO18")
    1576                      .dwattr $C$DW$110, DW_AT_TI_symbol_name("_GPIO18")
    1577                      .dwattr $C$DW$110, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    1578                      .dwattr $C$DW$110, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1579                      .dwattr $C$DW$110, DW_AT_accessibility(DW_ACCESS_public)
    1580              $C$DW$111       .dwtag  DW_TAG_member
    1581                      .dwattr $C$DW$111, DW_AT_type(*$C$DW$T$19)
    1582                      .dwattr $C$DW$111, DW_AT_name("GPIO19")
    1583                      .dwattr $C$DW$111, DW_AT_TI_symbol_name("_GPIO19")
    1584                      .dwattr $C$DW$111, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    1585                      .dwattr $C$DW$111, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1586                      .dwattr $C$DW$111, DW_AT_accessibility(DW_ACCESS_public)
    1587              $C$DW$112       .dwtag  DW_TAG_member
    1588                      .dwattr $C$DW$112, DW_AT_type(*$C$DW$T$19)
    1589                      .dwattr $C$DW$112, DW_AT_name("GPIO20")
    1590                      .dwattr $C$DW$112, DW_AT_TI_symbol_name("_GPIO20")
    1591                      .dwattr $C$DW$112, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    1592                      .dwattr $C$DW$112, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1593                      .dwattr $C$DW$112, DW_AT_accessibility(DW_ACCESS_public)
    1594              $C$DW$113       .dwtag  DW_TAG_member
    1595                      .dwattr $C$DW$113, DW_AT_type(*$C$DW$T$19)
    1596                      .dwattr $C$DW$113, DW_AT_name("GPIO21")
    1597                      .dwattr $C$DW$113, DW_AT_TI_symbol_name("_GPIO21")
    1598                      .dwattr $C$DW$113, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    1599                      .dwattr $C$DW$113, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1600                      .dwattr $C$DW$113, DW_AT_accessibility(DW_ACCESS_public)
    1601              $C$DW$114       .dwtag  DW_TAG_member
    1602                      .dwattr $C$DW$114, DW_AT_type(*$C$DW$T$19)
    1603                      .dwattr $C$DW$114, DW_AT_name("GPIO22")
    1604                      .dwattr $C$DW$114, DW_AT_TI_symbol_name("_GPIO22")
    1605                      .dwattr $C$DW$114, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    1606                      .dwattr $C$DW$114, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1607                      .dwattr $C$DW$114, DW_AT_accessibility(DW_ACCESS_public)
    1608              $C$DW$115       .dwtag  DW_TAG_member
    1609                      .dwattr $C$DW$115, DW_AT_type(*$C$DW$T$19)
    1610                      .dwattr $C$DW$115, DW_AT_name("GPIO23")
    1611                      .dwattr $C$DW$115, DW_AT_TI_symbol_name("_GPIO23")
    1612                      .dwattr $C$DW$115, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    1613                      .dwattr $C$DW$115, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:08 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0554410                           PAGE   33

    1614                      .dwattr $C$DW$115, DW_AT_accessibility(DW_ACCESS_public)
    1615              $C$DW$116       .dwtag  DW_TAG_member
    1616                      .dwattr $C$DW$116, DW_AT_type(*$C$DW$T$19)
    1617                      .dwattr $C$DW$116, DW_AT_name("GPIO24")
    1618                      .dwattr $C$DW$116, DW_AT_TI_symbol_name("_GPIO24")
    1619                      .dwattr $C$DW$116, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
    1620                      .dwattr $C$DW$116, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1621                      .dwattr $C$DW$116, DW_AT_accessibility(DW_ACCESS_public)
    1622              $C$DW$117       .dwtag  DW_TAG_member
    1623                      .dwattr $C$DW$117, DW_AT_type(*$C$DW$T$19)
    1624                      .dwattr $C$DW$117, DW_AT_name("GPIO25")
    1625                      .dwattr $C$DW$117, DW_AT_TI_symbol_name("_GPIO25")
    1626                      .dwattr $C$DW$117, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    1627                      .dwattr $C$DW$117, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1628                      .dwattr $C$DW$117, DW_AT_accessibility(DW_ACCESS_public)
    1629              $C$DW$118       .dwtag  DW_TAG_member
    1630                      .dwattr $C$DW$118, DW_AT_type(*$C$DW$T$19)
    1631                      .dwattr $C$DW$118, DW_AT_name("GPIO26")
    1632                      .dwattr $C$DW$118, DW_AT_TI_symbol_name("_GPIO26")
    1633                      .dwattr $C$DW$118, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
    1634                      .dwattr $C$DW$118, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1635                      .dwattr $C$DW$118, DW_AT_accessibility(DW_ACCESS_public)
    1636              $C$DW$119       .dwtag  DW_TAG_member
    1637                      .dwattr $C$DW$119, DW_AT_type(*$C$DW$T$19)
    1638                      .dwattr $C$DW$119, DW_AT_name("GPIO27")
    1639                      .dwattr $C$DW$119, DW_AT_TI_symbol_name("_GPIO27")
    1640                      .dwattr $C$DW$119, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
    1641                      .dwattr $C$DW$119, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1642                      .dwattr $C$DW$119, DW_AT_accessibility(DW_ACCESS_public)
    1643              $C$DW$120       .dwtag  DW_TAG_member
    1644                      .dwattr $C$DW$120, DW_AT_type(*$C$DW$T$19)
    1645                      .dwattr $C$DW$120, DW_AT_name("GPIO28")
    1646                      .dwattr $C$DW$120, DW_AT_TI_symbol_name("_GPIO28")
    1647                      .dwattr $C$DW$120, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
    1648                      .dwattr $C$DW$120, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1649                      .dwattr $C$DW$120, DW_AT_accessibility(DW_ACCESS_public)
    1650              $C$DW$121       .dwtag  DW_TAG_member
    1651                      .dwattr $C$DW$121, DW_AT_type(*$C$DW$T$19)
    1652                      .dwattr $C$DW$121, DW_AT_name("GPIO29")
    1653                      .dwattr $C$DW$121, DW_AT_TI_symbol_name("_GPIO29")
    1654                      .dwattr $C$DW$121, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
    1655                      .dwattr $C$DW$121, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1656                      .dwattr $C$DW$121, DW_AT_accessibility(DW_ACCESS_public)
    1657              $C$DW$122       .dwtag  DW_TAG_member
    1658                      .dwattr $C$DW$122, DW_AT_type(*$C$DW$T$19)
    1659                      .dwattr $C$DW$122, DW_AT_name("GPIO30")
    1660                      .dwattr $C$DW$122, DW_AT_TI_symbol_name("_GPIO30")
    1661                      .dwattr $C$DW$122, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
    1662                      .dwattr $C$DW$122, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1663                      .dwattr $C$DW$122, DW_AT_accessibility(DW_ACCESS_public)
    1664              $C$DW$123       .dwtag  DW_TAG_member
    1665                      .dwattr $C$DW$123, DW_AT_type(*$C$DW$T$19)
    1666                      .dwattr $C$DW$123, DW_AT_name("GPIO31")
    1667                      .dwattr $C$DW$123, DW_AT_TI_symbol_name("_GPIO31")
    1668                      .dwattr $C$DW$123, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:08 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0554410                           PAGE   34

    1669                      .dwattr $C$DW$123, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1670                      .dwattr $C$DW$123, DW_AT_accessibility(DW_ACCESS_public)
    1671                      .dwendtag $C$DW$T$27
    1672              
    1673              
    1674              $C$DW$T$28      .dwtag  DW_TAG_union_type
    1675                      .dwattr $C$DW$T$28, DW_AT_name("GPADAT_REG")
    1676                      .dwattr $C$DW$T$28, DW_AT_byte_size(0x02)
    1677              $C$DW$124       .dwtag  DW_TAG_member
    1678                      .dwattr $C$DW$124, DW_AT_type(*$C$DW$T$21)
    1679                      .dwattr $C$DW$124, DW_AT_name("all")
    1680                      .dwattr $C$DW$124, DW_AT_TI_symbol_name("_all")
    1681                      .dwattr $C$DW$124, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1682                      .dwattr $C$DW$124, DW_AT_accessibility(DW_ACCESS_public)
    1683              $C$DW$125       .dwtag  DW_TAG_member
    1684                      .dwattr $C$DW$125, DW_AT_type(*$C$DW$T$27)
    1685                      .dwattr $C$DW$125, DW_AT_name("bit")
    1686                      .dwattr $C$DW$125, DW_AT_TI_symbol_name("_bit")
    1687                      .dwattr $C$DW$125, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1688                      .dwattr $C$DW$125, DW_AT_accessibility(DW_ACCESS_public)
    1689                      .dwendtag $C$DW$T$28
    1690              
    1691              
    1692              $C$DW$T$29      .dwtag  DW_TAG_structure_type
    1693                      .dwattr $C$DW$T$29, DW_AT_name("GPB1_BITS")
    1694                      .dwattr $C$DW$T$29, DW_AT_byte_size(0x02)
    1695              $C$DW$126       .dwtag  DW_TAG_member
    1696                      .dwattr $C$DW$126, DW_AT_type(*$C$DW$T$19)
    1697                      .dwattr $C$DW$126, DW_AT_name("GPIO32")
    1698                      .dwattr $C$DW$126, DW_AT_TI_symbol_name("_GPIO32")
    1699                      .dwattr $C$DW$126, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x02)
    1700                      .dwattr $C$DW$126, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1701                      .dwattr $C$DW$126, DW_AT_accessibility(DW_ACCESS_public)
    1702              $C$DW$127       .dwtag  DW_TAG_member
    1703                      .dwattr $C$DW$127, DW_AT_type(*$C$DW$T$19)
    1704                      .dwattr $C$DW$127, DW_AT_name("GPIO33")
    1705                      .dwattr $C$DW$127, DW_AT_TI_symbol_name("_GPIO33")
    1706                      .dwattr $C$DW$127, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x02)
    1707                      .dwattr $C$DW$127, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1708                      .dwattr $C$DW$127, DW_AT_accessibility(DW_ACCESS_public)
    1709              $C$DW$128       .dwtag  DW_TAG_member
    1710                      .dwattr $C$DW$128, DW_AT_type(*$C$DW$T$19)
    1711                      .dwattr $C$DW$128, DW_AT_name("GPIO34")
    1712                      .dwattr $C$DW$128, DW_AT_TI_symbol_name("_GPIO34")
    1713                      .dwattr $C$DW$128, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x02)
    1714                      .dwattr $C$DW$128, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1715                      .dwattr $C$DW$128, DW_AT_accessibility(DW_ACCESS_public)
    1716              $C$DW$129       .dwtag  DW_TAG_member
    1717                      .dwattr $C$DW$129, DW_AT_type(*$C$DW$T$19)
    1718                      .dwattr $C$DW$129, DW_AT_name("GPIO35")
    1719                      .dwattr $C$DW$129, DW_AT_TI_symbol_name("_GPIO35")
    1720                      .dwattr $C$DW$129, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x02)
    1721                      .dwattr $C$DW$129, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1722                      .dwattr $C$DW$129, DW_AT_accessibility(DW_ACCESS_public)
    1723              $C$DW$130       .dwtag  DW_TAG_member
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:08 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0554410                           PAGE   35

    1724                      .dwattr $C$DW$130, DW_AT_type(*$C$DW$T$19)
    1725                      .dwattr $C$DW$130, DW_AT_name("GPIO36")
    1726                      .dwattr $C$DW$130, DW_AT_TI_symbol_name("_GPIO36")
    1727                      .dwattr $C$DW$130, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x02)
    1728                      .dwattr $C$DW$130, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1729                      .dwattr $C$DW$130, DW_AT_accessibility(DW_ACCESS_public)
    1730              $C$DW$131       .dwtag  DW_TAG_member
    1731                      .dwattr $C$DW$131, DW_AT_type(*$C$DW$T$19)
    1732                      .dwattr $C$DW$131, DW_AT_name("GPIO37")
    1733                      .dwattr $C$DW$131, DW_AT_TI_symbol_name("_GPIO37")
    1734                      .dwattr $C$DW$131, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x02)
    1735                      .dwattr $C$DW$131, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1736                      .dwattr $C$DW$131, DW_AT_accessibility(DW_ACCESS_public)
    1737              $C$DW$132       .dwtag  DW_TAG_member
    1738                      .dwattr $C$DW$132, DW_AT_type(*$C$DW$T$19)
    1739                      .dwattr $C$DW$132, DW_AT_name("GPIO38")
    1740                      .dwattr $C$DW$132, DW_AT_TI_symbol_name("_GPIO38")
    1741                      .dwattr $C$DW$132, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x02)
    1742                      .dwattr $C$DW$132, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1743                      .dwattr $C$DW$132, DW_AT_accessibility(DW_ACCESS_public)
    1744              $C$DW$133       .dwtag  DW_TAG_member
    1745                      .dwattr $C$DW$133, DW_AT_type(*$C$DW$T$19)
    1746                      .dwattr $C$DW$133, DW_AT_name("GPIO39")
    1747                      .dwattr $C$DW$133, DW_AT_TI_symbol_name("_GPIO39")
    1748                      .dwattr $C$DW$133, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x02)
    1749                      .dwattr $C$DW$133, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1750                      .dwattr $C$DW$133, DW_AT_accessibility(DW_ACCESS_public)
    1751              $C$DW$134       .dwtag  DW_TAG_member
    1752                      .dwattr $C$DW$134, DW_AT_type(*$C$DW$T$19)
    1753                      .dwattr $C$DW$134, DW_AT_name("GPIO40")
    1754                      .dwattr $C$DW$134, DW_AT_TI_symbol_name("_GPIO40")
    1755                      .dwattr $C$DW$134, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x02)
    1756                      .dwattr $C$DW$134, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1757                      .dwattr $C$DW$134, DW_AT_accessibility(DW_ACCESS_public)
    1758              $C$DW$135       .dwtag  DW_TAG_member
    1759                      .dwattr $C$DW$135, DW_AT_type(*$C$DW$T$19)
    1760                      .dwattr $C$DW$135, DW_AT_name("GPIO41")
    1761                      .dwattr $C$DW$135, DW_AT_TI_symbol_name("_GPIO41")
    1762                      .dwattr $C$DW$135, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x02)
    1763                      .dwattr $C$DW$135, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1764                      .dwattr $C$DW$135, DW_AT_accessibility(DW_ACCESS_public)
    1765              $C$DW$136       .dwtag  DW_TAG_member
    1766                      .dwattr $C$DW$136, DW_AT_type(*$C$DW$T$19)
    1767                      .dwattr $C$DW$136, DW_AT_name("GPIO42")
    1768                      .dwattr $C$DW$136, DW_AT_TI_symbol_name("_GPIO42")
    1769                      .dwattr $C$DW$136, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x02)
    1770                      .dwattr $C$DW$136, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1771                      .dwattr $C$DW$136, DW_AT_accessibility(DW_ACCESS_public)
    1772              $C$DW$137       .dwtag  DW_TAG_member
    1773                      .dwattr $C$DW$137, DW_AT_type(*$C$DW$T$19)
    1774                      .dwattr $C$DW$137, DW_AT_name("GPIO43")
    1775                      .dwattr $C$DW$137, DW_AT_TI_symbol_name("_GPIO43")
    1776                      .dwattr $C$DW$137, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x02)
    1777                      .dwattr $C$DW$137, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1778                      .dwattr $C$DW$137, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:08 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0554410                           PAGE   36

    1779              $C$DW$138       .dwtag  DW_TAG_member
    1780                      .dwattr $C$DW$138, DW_AT_type(*$C$DW$T$19)
    1781                      .dwattr $C$DW$138, DW_AT_name("GPIO44")
    1782                      .dwattr $C$DW$138, DW_AT_TI_symbol_name("_GPIO44")
    1783                      .dwattr $C$DW$138, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x02)
    1784                      .dwattr $C$DW$138, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1785                      .dwattr $C$DW$138, DW_AT_accessibility(DW_ACCESS_public)
    1786              $C$DW$139       .dwtag  DW_TAG_member
    1787                      .dwattr $C$DW$139, DW_AT_type(*$C$DW$T$19)
    1788                      .dwattr $C$DW$139, DW_AT_name("GPIO45")
    1789                      .dwattr $C$DW$139, DW_AT_TI_symbol_name("_GPIO45")
    1790                      .dwattr $C$DW$139, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x02)
    1791                      .dwattr $C$DW$139, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1792                      .dwattr $C$DW$139, DW_AT_accessibility(DW_ACCESS_public)
    1793              $C$DW$140       .dwtag  DW_TAG_member
    1794                      .dwattr $C$DW$140, DW_AT_type(*$C$DW$T$19)
    1795                      .dwattr $C$DW$140, DW_AT_name("GPIO46")
    1796                      .dwattr $C$DW$140, DW_AT_TI_symbol_name("_GPIO46")
    1797                      .dwattr $C$DW$140, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x02)
    1798                      .dwattr $C$DW$140, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1799                      .dwattr $C$DW$140, DW_AT_accessibility(DW_ACCESS_public)
    1800              $C$DW$141       .dwtag  DW_TAG_member
    1801                      .dwattr $C$DW$141, DW_AT_type(*$C$DW$T$19)
    1802                      .dwattr $C$DW$141, DW_AT_name("GPIO47")
    1803                      .dwattr $C$DW$141, DW_AT_TI_symbol_name("_GPIO47")
    1804                      .dwattr $C$DW$141, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x02)
    1805                      .dwattr $C$DW$141, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1806                      .dwattr $C$DW$141, DW_AT_accessibility(DW_ACCESS_public)
    1807                      .dwendtag $C$DW$T$29
    1808              
    1809              
    1810              $C$DW$T$30      .dwtag  DW_TAG_union_type
    1811                      .dwattr $C$DW$T$30, DW_AT_name("GPB1_REG")
    1812                      .dwattr $C$DW$T$30, DW_AT_byte_size(0x02)
    1813              $C$DW$142       .dwtag  DW_TAG_member
    1814                      .dwattr $C$DW$142, DW_AT_type(*$C$DW$T$21)
    1815                      .dwattr $C$DW$142, DW_AT_name("all")
    1816                      .dwattr $C$DW$142, DW_AT_TI_symbol_name("_all")
    1817                      .dwattr $C$DW$142, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1818                      .dwattr $C$DW$142, DW_AT_accessibility(DW_ACCESS_public)
    1819              $C$DW$143       .dwtag  DW_TAG_member
    1820                      .dwattr $C$DW$143, DW_AT_type(*$C$DW$T$29)
    1821                      .dwattr $C$DW$143, DW_AT_name("bit")
    1822                      .dwattr $C$DW$143, DW_AT_TI_symbol_name("_bit")
    1823                      .dwattr $C$DW$143, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1824                      .dwattr $C$DW$143, DW_AT_accessibility(DW_ACCESS_public)
    1825                      .dwendtag $C$DW$T$30
    1826              
    1827              
    1828              $C$DW$T$31      .dwtag  DW_TAG_structure_type
    1829                      .dwattr $C$DW$T$31, DW_AT_name("GPB2_BITS")
    1830                      .dwattr $C$DW$T$31, DW_AT_byte_size(0x02)
    1831              $C$DW$144       .dwtag  DW_TAG_member
    1832                      .dwattr $C$DW$144, DW_AT_type(*$C$DW$T$19)
    1833                      .dwattr $C$DW$144, DW_AT_name("GPIO48")
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:08 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0554410                           PAGE   37

    1834                      .dwattr $C$DW$144, DW_AT_TI_symbol_name("_GPIO48")
    1835                      .dwattr $C$DW$144, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x02)
    1836                      .dwattr $C$DW$144, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1837                      .dwattr $C$DW$144, DW_AT_accessibility(DW_ACCESS_public)
    1838              $C$DW$145       .dwtag  DW_TAG_member
    1839                      .dwattr $C$DW$145, DW_AT_type(*$C$DW$T$19)
    1840                      .dwattr $C$DW$145, DW_AT_name("GPIO49")
    1841                      .dwattr $C$DW$145, DW_AT_TI_symbol_name("_GPIO49")
    1842                      .dwattr $C$DW$145, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x02)
    1843                      .dwattr $C$DW$145, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1844                      .dwattr $C$DW$145, DW_AT_accessibility(DW_ACCESS_public)
    1845              $C$DW$146       .dwtag  DW_TAG_member
    1846                      .dwattr $C$DW$146, DW_AT_type(*$C$DW$T$19)
    1847                      .dwattr $C$DW$146, DW_AT_name("GPIO50")
    1848                      .dwattr $C$DW$146, DW_AT_TI_symbol_name("_GPIO50")
    1849                      .dwattr $C$DW$146, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x02)
    1850                      .dwattr $C$DW$146, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1851                      .dwattr $C$DW$146, DW_AT_accessibility(DW_ACCESS_public)
    1852              $C$DW$147       .dwtag  DW_TAG_member
    1853                      .dwattr $C$DW$147, DW_AT_type(*$C$DW$T$19)
    1854                      .dwattr $C$DW$147, DW_AT_name("GPIO51")
    1855                      .dwattr $C$DW$147, DW_AT_TI_symbol_name("_GPIO51")
    1856                      .dwattr $C$DW$147, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x02)
    1857                      .dwattr $C$DW$147, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1858                      .dwattr $C$DW$147, DW_AT_accessibility(DW_ACCESS_public)
    1859              $C$DW$148       .dwtag  DW_TAG_member
    1860                      .dwattr $C$DW$148, DW_AT_type(*$C$DW$T$19)
    1861                      .dwattr $C$DW$148, DW_AT_name("GPIO52")
    1862                      .dwattr $C$DW$148, DW_AT_TI_symbol_name("_GPIO52")
    1863                      .dwattr $C$DW$148, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x02)
    1864                      .dwattr $C$DW$148, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1865                      .dwattr $C$DW$148, DW_AT_accessibility(DW_ACCESS_public)
    1866              $C$DW$149       .dwtag  DW_TAG_member
    1867                      .dwattr $C$DW$149, DW_AT_type(*$C$DW$T$19)
    1868                      .dwattr $C$DW$149, DW_AT_name("GPIO53")
    1869                      .dwattr $C$DW$149, DW_AT_TI_symbol_name("_GPIO53")
    1870                      .dwattr $C$DW$149, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x02)
    1871                      .dwattr $C$DW$149, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1872                      .dwattr $C$DW$149, DW_AT_accessibility(DW_ACCESS_public)
    1873              $C$DW$150       .dwtag  DW_TAG_member
    1874                      .dwattr $C$DW$150, DW_AT_type(*$C$DW$T$19)
    1875                      .dwattr $C$DW$150, DW_AT_name("GPIO54")
    1876                      .dwattr $C$DW$150, DW_AT_TI_symbol_name("_GPIO54")
    1877                      .dwattr $C$DW$150, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x02)
    1878                      .dwattr $C$DW$150, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1879                      .dwattr $C$DW$150, DW_AT_accessibility(DW_ACCESS_public)
    1880              $C$DW$151       .dwtag  DW_TAG_member
    1881                      .dwattr $C$DW$151, DW_AT_type(*$C$DW$T$19)
    1882                      .dwattr $C$DW$151, DW_AT_name("GPIO55")
    1883                      .dwattr $C$DW$151, DW_AT_TI_symbol_name("_GPIO55")
    1884                      .dwattr $C$DW$151, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x02)
    1885                      .dwattr $C$DW$151, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1886                      .dwattr $C$DW$151, DW_AT_accessibility(DW_ACCESS_public)
    1887              $C$DW$152       .dwtag  DW_TAG_member
    1888                      .dwattr $C$DW$152, DW_AT_type(*$C$DW$T$19)
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:08 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0554410                           PAGE   38

    1889                      .dwattr $C$DW$152, DW_AT_name("GPIO56")
    1890                      .dwattr $C$DW$152, DW_AT_TI_symbol_name("_GPIO56")
    1891                      .dwattr $C$DW$152, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x02)
    1892                      .dwattr $C$DW$152, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1893                      .dwattr $C$DW$152, DW_AT_accessibility(DW_ACCESS_public)
    1894              $C$DW$153       .dwtag  DW_TAG_member
    1895                      .dwattr $C$DW$153, DW_AT_type(*$C$DW$T$19)
    1896                      .dwattr $C$DW$153, DW_AT_name("GPIO57")
    1897                      .dwattr $C$DW$153, DW_AT_TI_symbol_name("_GPIO57")
    1898                      .dwattr $C$DW$153, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x02)
    1899                      .dwattr $C$DW$153, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1900                      .dwattr $C$DW$153, DW_AT_accessibility(DW_ACCESS_public)
    1901              $C$DW$154       .dwtag  DW_TAG_member
    1902                      .dwattr $C$DW$154, DW_AT_type(*$C$DW$T$19)
    1903                      .dwattr $C$DW$154, DW_AT_name("GPIO58")
    1904                      .dwattr $C$DW$154, DW_AT_TI_symbol_name("_GPIO58")
    1905                      .dwattr $C$DW$154, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x02)
    1906                      .dwattr $C$DW$154, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1907                      .dwattr $C$DW$154, DW_AT_accessibility(DW_ACCESS_public)
    1908              $C$DW$155       .dwtag  DW_TAG_member
    1909                      .dwattr $C$DW$155, DW_AT_type(*$C$DW$T$19)
    1910                      .dwattr $C$DW$155, DW_AT_name("GPIO59")
    1911                      .dwattr $C$DW$155, DW_AT_TI_symbol_name("_GPIO59")
    1912                      .dwattr $C$DW$155, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x02)
    1913                      .dwattr $C$DW$155, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1914                      .dwattr $C$DW$155, DW_AT_accessibility(DW_ACCESS_public)
    1915              $C$DW$156       .dwtag  DW_TAG_member
    1916                      .dwattr $C$DW$156, DW_AT_type(*$C$DW$T$19)
    1917                      .dwattr $C$DW$156, DW_AT_name("GPIO60")
    1918                      .dwattr $C$DW$156, DW_AT_TI_symbol_name("_GPIO60")
    1919                      .dwattr $C$DW$156, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x02)
    1920                      .dwattr $C$DW$156, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1921                      .dwattr $C$DW$156, DW_AT_accessibility(DW_ACCESS_public)
    1922              $C$DW$157       .dwtag  DW_TAG_member
    1923                      .dwattr $C$DW$157, DW_AT_type(*$C$DW$T$19)
    1924                      .dwattr $C$DW$157, DW_AT_name("GPIO61")
    1925                      .dwattr $C$DW$157, DW_AT_TI_symbol_name("_GPIO61")
    1926                      .dwattr $C$DW$157, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x02)
    1927                      .dwattr $C$DW$157, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1928                      .dwattr $C$DW$157, DW_AT_accessibility(DW_ACCESS_public)
    1929              $C$DW$158       .dwtag  DW_TAG_member
    1930                      .dwattr $C$DW$158, DW_AT_type(*$C$DW$T$19)
    1931                      .dwattr $C$DW$158, DW_AT_name("GPIO62")
    1932                      .dwattr $C$DW$158, DW_AT_TI_symbol_name("_GPIO62")
    1933                      .dwattr $C$DW$158, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x02)
    1934                      .dwattr $C$DW$158, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1935                      .dwattr $C$DW$158, DW_AT_accessibility(DW_ACCESS_public)
    1936              $C$DW$159       .dwtag  DW_TAG_member
    1937                      .dwattr $C$DW$159, DW_AT_type(*$C$DW$T$19)
    1938                      .dwattr $C$DW$159, DW_AT_name("GPIO63")
    1939                      .dwattr $C$DW$159, DW_AT_TI_symbol_name("_GPIO63")
    1940                      .dwattr $C$DW$159, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x02)
    1941                      .dwattr $C$DW$159, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1942                      .dwattr $C$DW$159, DW_AT_accessibility(DW_ACCESS_public)
    1943                      .dwendtag $C$DW$T$31
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:08 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0554410                           PAGE   39

    1944              
    1945              
    1946              $C$DW$T$32      .dwtag  DW_TAG_union_type
    1947                      .dwattr $C$DW$T$32, DW_AT_name("GPB2_REG")
    1948                      .dwattr $C$DW$T$32, DW_AT_byte_size(0x02)
    1949              $C$DW$160       .dwtag  DW_TAG_member
    1950                      .dwattr $C$DW$160, DW_AT_type(*$C$DW$T$21)
    1951                      .dwattr $C$DW$160, DW_AT_name("all")
    1952                      .dwattr $C$DW$160, DW_AT_TI_symbol_name("_all")
    1953                      .dwattr $C$DW$160, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1954                      .dwattr $C$DW$160, DW_AT_accessibility(DW_ACCESS_public)
    1955              $C$DW$161       .dwtag  DW_TAG_member
    1956                      .dwattr $C$DW$161, DW_AT_type(*$C$DW$T$31)
    1957                      .dwattr $C$DW$161, DW_AT_name("bit")
    1958                      .dwattr $C$DW$161, DW_AT_TI_symbol_name("_bit")
    1959                      .dwattr $C$DW$161, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1960                      .dwattr $C$DW$161, DW_AT_accessibility(DW_ACCESS_public)
    1961                      .dwendtag $C$DW$T$32
    1962              
    1963              
    1964              $C$DW$T$33      .dwtag  DW_TAG_structure_type
    1965                      .dwattr $C$DW$T$33, DW_AT_name("GPBCTRL_BITS")
    1966                      .dwattr $C$DW$T$33, DW_AT_byte_size(0x02)
    1967              $C$DW$162       .dwtag  DW_TAG_member
    1968                      .dwattr $C$DW$162, DW_AT_type(*$C$DW$T$19)
    1969                      .dwattr $C$DW$162, DW_AT_name("QUALPRD0")
    1970                      .dwattr $C$DW$162, DW_AT_TI_symbol_name("_QUALPRD0")
    1971                      .dwattr $C$DW$162, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x08)
    1972                      .dwattr $C$DW$162, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1973                      .dwattr $C$DW$162, DW_AT_accessibility(DW_ACCESS_public)
    1974              $C$DW$163       .dwtag  DW_TAG_member
    1975                      .dwattr $C$DW$163, DW_AT_type(*$C$DW$T$19)
    1976                      .dwattr $C$DW$163, DW_AT_name("QUALPRD1")
    1977                      .dwattr $C$DW$163, DW_AT_TI_symbol_name("_QUALPRD1")
    1978                      .dwattr $C$DW$163, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x08)
    1979                      .dwattr $C$DW$163, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1980                      .dwattr $C$DW$163, DW_AT_accessibility(DW_ACCESS_public)
    1981              $C$DW$164       .dwtag  DW_TAG_member
    1982                      .dwattr $C$DW$164, DW_AT_type(*$C$DW$T$19)
    1983                      .dwattr $C$DW$164, DW_AT_name("QUALPRD2")
    1984                      .dwattr $C$DW$164, DW_AT_TI_symbol_name("_QUALPRD2")
    1985                      .dwattr $C$DW$164, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x08)
    1986                      .dwattr $C$DW$164, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1987                      .dwattr $C$DW$164, DW_AT_accessibility(DW_ACCESS_public)
    1988              $C$DW$165       .dwtag  DW_TAG_member
    1989                      .dwattr $C$DW$165, DW_AT_type(*$C$DW$T$19)
    1990                      .dwattr $C$DW$165, DW_AT_name("QUALPRD3")
    1991                      .dwattr $C$DW$165, DW_AT_TI_symbol_name("_QUALPRD3")
    1992                      .dwattr $C$DW$165, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x08)
    1993                      .dwattr $C$DW$165, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    1994                      .dwattr $C$DW$165, DW_AT_accessibility(DW_ACCESS_public)
    1995                      .dwendtag $C$DW$T$33
    1996              
    1997              
    1998              $C$DW$T$34      .dwtag  DW_TAG_union_type
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:08 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0554410                           PAGE   40

    1999                      .dwattr $C$DW$T$34, DW_AT_name("GPBCTRL_REG")
    2000                      .dwattr $C$DW$T$34, DW_AT_byte_size(0x02)
    2001              $C$DW$166       .dwtag  DW_TAG_member
    2002                      .dwattr $C$DW$166, DW_AT_type(*$C$DW$T$21)
    2003                      .dwattr $C$DW$166, DW_AT_name("all")
    2004                      .dwattr $C$DW$166, DW_AT_TI_symbol_name("_all")
    2005                      .dwattr $C$DW$166, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2006                      .dwattr $C$DW$166, DW_AT_accessibility(DW_ACCESS_public)
    2007              $C$DW$167       .dwtag  DW_TAG_member
    2008                      .dwattr $C$DW$167, DW_AT_type(*$C$DW$T$33)
    2009                      .dwattr $C$DW$167, DW_AT_name("bit")
    2010                      .dwattr $C$DW$167, DW_AT_TI_symbol_name("_bit")
    2011                      .dwattr $C$DW$167, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2012                      .dwattr $C$DW$167, DW_AT_accessibility(DW_ACCESS_public)
    2013                      .dwendtag $C$DW$T$34
    2014              
    2015              
    2016              $C$DW$T$35      .dwtag  DW_TAG_structure_type
    2017                      .dwattr $C$DW$T$35, DW_AT_name("GPBDAT_BITS")
    2018                      .dwattr $C$DW$T$35, DW_AT_byte_size(0x02)
    2019              $C$DW$168       .dwtag  DW_TAG_member
    2020                      .dwattr $C$DW$168, DW_AT_type(*$C$DW$T$19)
    2021                      .dwattr $C$DW$168, DW_AT_name("GPIO32")
    2022                      .dwattr $C$DW$168, DW_AT_TI_symbol_name("_GPIO32")
    2023                      .dwattr $C$DW$168, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    2024                      .dwattr $C$DW$168, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2025                      .dwattr $C$DW$168, DW_AT_accessibility(DW_ACCESS_public)
    2026              $C$DW$169       .dwtag  DW_TAG_member
    2027                      .dwattr $C$DW$169, DW_AT_type(*$C$DW$T$19)
    2028                      .dwattr $C$DW$169, DW_AT_name("GPIO33")
    2029                      .dwattr $C$DW$169, DW_AT_TI_symbol_name("_GPIO33")
    2030                      .dwattr $C$DW$169, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    2031                      .dwattr $C$DW$169, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2032                      .dwattr $C$DW$169, DW_AT_accessibility(DW_ACCESS_public)
    2033              $C$DW$170       .dwtag  DW_TAG_member
    2034                      .dwattr $C$DW$170, DW_AT_type(*$C$DW$T$19)
    2035                      .dwattr $C$DW$170, DW_AT_name("GPIO34")
    2036                      .dwattr $C$DW$170, DW_AT_TI_symbol_name("_GPIO34")
    2037                      .dwattr $C$DW$170, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    2038                      .dwattr $C$DW$170, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2039                      .dwattr $C$DW$170, DW_AT_accessibility(DW_ACCESS_public)
    2040              $C$DW$171       .dwtag  DW_TAG_member
    2041                      .dwattr $C$DW$171, DW_AT_type(*$C$DW$T$19)
    2042                      .dwattr $C$DW$171, DW_AT_name("GPIO35")
    2043                      .dwattr $C$DW$171, DW_AT_TI_symbol_name("_GPIO35")
    2044                      .dwattr $C$DW$171, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    2045                      .dwattr $C$DW$171, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2046                      .dwattr $C$DW$171, DW_AT_accessibility(DW_ACCESS_public)
    2047              $C$DW$172       .dwtag  DW_TAG_member
    2048                      .dwattr $C$DW$172, DW_AT_type(*$C$DW$T$19)
    2049                      .dwattr $C$DW$172, DW_AT_name("GPIO36")
    2050                      .dwattr $C$DW$172, DW_AT_TI_symbol_name("_GPIO36")
    2051                      .dwattr $C$DW$172, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
    2052                      .dwattr $C$DW$172, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2053                      .dwattr $C$DW$172, DW_AT_accessibility(DW_ACCESS_public)
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:08 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0554410                           PAGE   41

    2054              $C$DW$173       .dwtag  DW_TAG_member
    2055                      .dwattr $C$DW$173, DW_AT_type(*$C$DW$T$19)
    2056                      .dwattr $C$DW$173, DW_AT_name("GPIO37")
    2057                      .dwattr $C$DW$173, DW_AT_TI_symbol_name("_GPIO37")
    2058                      .dwattr $C$DW$173, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    2059                      .dwattr $C$DW$173, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2060                      .dwattr $C$DW$173, DW_AT_accessibility(DW_ACCESS_public)
    2061              $C$DW$174       .dwtag  DW_TAG_member
    2062                      .dwattr $C$DW$174, DW_AT_type(*$C$DW$T$19)
    2063                      .dwattr $C$DW$174, DW_AT_name("GPIO38")
    2064                      .dwattr $C$DW$174, DW_AT_TI_symbol_name("_GPIO38")
    2065                      .dwattr $C$DW$174, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    2066                      .dwattr $C$DW$174, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2067                      .dwattr $C$DW$174, DW_AT_accessibility(DW_ACCESS_public)
    2068              $C$DW$175       .dwtag  DW_TAG_member
    2069                      .dwattr $C$DW$175, DW_AT_type(*$C$DW$T$19)
    2070                      .dwattr $C$DW$175, DW_AT_name("GPIO39")
    2071                      .dwattr $C$DW$175, DW_AT_TI_symbol_name("_GPIO39")
    2072                      .dwattr $C$DW$175, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    2073                      .dwattr $C$DW$175, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2074                      .dwattr $C$DW$175, DW_AT_accessibility(DW_ACCESS_public)
    2075              $C$DW$176       .dwtag  DW_TAG_member
    2076                      .dwattr $C$DW$176, DW_AT_type(*$C$DW$T$19)
    2077                      .dwattr $C$DW$176, DW_AT_name("GPIO40")
    2078                      .dwattr $C$DW$176, DW_AT_TI_symbol_name("_GPIO40")
    2079                      .dwattr $C$DW$176, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
    2080                      .dwattr $C$DW$176, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2081                      .dwattr $C$DW$176, DW_AT_accessibility(DW_ACCESS_public)
    2082              $C$DW$177       .dwtag  DW_TAG_member
    2083                      .dwattr $C$DW$177, DW_AT_type(*$C$DW$T$19)
    2084                      .dwattr $C$DW$177, DW_AT_name("GPIO41")
    2085                      .dwattr $C$DW$177, DW_AT_TI_symbol_name("_GPIO41")
    2086                      .dwattr $C$DW$177, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    2087                      .dwattr $C$DW$177, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2088                      .dwattr $C$DW$177, DW_AT_accessibility(DW_ACCESS_public)
    2089              $C$DW$178       .dwtag  DW_TAG_member
    2090                      .dwattr $C$DW$178, DW_AT_type(*$C$DW$T$19)
    2091                      .dwattr $C$DW$178, DW_AT_name("GPIO42")
    2092                      .dwattr $C$DW$178, DW_AT_TI_symbol_name("_GPIO42")
    2093                      .dwattr $C$DW$178, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
    2094                      .dwattr $C$DW$178, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2095                      .dwattr $C$DW$178, DW_AT_accessibility(DW_ACCESS_public)
    2096              $C$DW$179       .dwtag  DW_TAG_member
    2097                      .dwattr $C$DW$179, DW_AT_type(*$C$DW$T$19)
    2098                      .dwattr $C$DW$179, DW_AT_name("GPIO43")
    2099                      .dwattr $C$DW$179, DW_AT_TI_symbol_name("_GPIO43")
    2100                      .dwattr $C$DW$179, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
    2101                      .dwattr $C$DW$179, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2102                      .dwattr $C$DW$179, DW_AT_accessibility(DW_ACCESS_public)
    2103              $C$DW$180       .dwtag  DW_TAG_member
    2104                      .dwattr $C$DW$180, DW_AT_type(*$C$DW$T$19)
    2105                      .dwattr $C$DW$180, DW_AT_name("GPIO44")
    2106                      .dwattr $C$DW$180, DW_AT_TI_symbol_name("_GPIO44")
    2107                      .dwattr $C$DW$180, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
    2108                      .dwattr $C$DW$180, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:08 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0554410                           PAGE   42

    2109                      .dwattr $C$DW$180, DW_AT_accessibility(DW_ACCESS_public)
    2110              $C$DW$181       .dwtag  DW_TAG_member
    2111                      .dwattr $C$DW$181, DW_AT_type(*$C$DW$T$19)
    2112                      .dwattr $C$DW$181, DW_AT_name("GPIO45")
    2113                      .dwattr $C$DW$181, DW_AT_TI_symbol_name("_GPIO45")
    2114                      .dwattr $C$DW$181, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
    2115                      .dwattr $C$DW$181, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2116                      .dwattr $C$DW$181, DW_AT_accessibility(DW_ACCESS_public)
    2117              $C$DW$182       .dwtag  DW_TAG_member
    2118                      .dwattr $C$DW$182, DW_AT_type(*$C$DW$T$19)
    2119                      .dwattr $C$DW$182, DW_AT_name("GPIO46")
    2120                      .dwattr $C$DW$182, DW_AT_TI_symbol_name("_GPIO46")
    2121                      .dwattr $C$DW$182, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
    2122                      .dwattr $C$DW$182, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2123                      .dwattr $C$DW$182, DW_AT_accessibility(DW_ACCESS_public)
    2124              $C$DW$183       .dwtag  DW_TAG_member
    2125                      .dwattr $C$DW$183, DW_AT_type(*$C$DW$T$19)
    2126                      .dwattr $C$DW$183, DW_AT_name("GPIO47")
    2127                      .dwattr $C$DW$183, DW_AT_TI_symbol_name("_GPIO47")
    2128                      .dwattr $C$DW$183, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    2129                      .dwattr $C$DW$183, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2130                      .dwattr $C$DW$183, DW_AT_accessibility(DW_ACCESS_public)
    2131              $C$DW$184       .dwtag  DW_TAG_member
    2132                      .dwattr $C$DW$184, DW_AT_type(*$C$DW$T$19)
    2133                      .dwattr $C$DW$184, DW_AT_name("GPIO48")
    2134                      .dwattr $C$DW$184, DW_AT_TI_symbol_name("_GPIO48")
    2135                      .dwattr $C$DW$184, DW_AT_bit_offset(0x0f), DW_AT_bit_size(0x01)
    2136                      .dwattr $C$DW$184, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2137                      .dwattr $C$DW$184, DW_AT_accessibility(DW_ACCESS_public)
    2138              $C$DW$185       .dwtag  DW_TAG_member
    2139                      .dwattr $C$DW$185, DW_AT_type(*$C$DW$T$19)
    2140                      .dwattr $C$DW$185, DW_AT_name("GPIO49")
    2141                      .dwattr $C$DW$185, DW_AT_TI_symbol_name("_GPIO49")
    2142                      .dwattr $C$DW$185, DW_AT_bit_offset(0x0e), DW_AT_bit_size(0x01)
    2143                      .dwattr $C$DW$185, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2144                      .dwattr $C$DW$185, DW_AT_accessibility(DW_ACCESS_public)
    2145              $C$DW$186       .dwtag  DW_TAG_member
    2146                      .dwattr $C$DW$186, DW_AT_type(*$C$DW$T$19)
    2147                      .dwattr $C$DW$186, DW_AT_name("GPIO50")
    2148                      .dwattr $C$DW$186, DW_AT_TI_symbol_name("_GPIO50")
    2149                      .dwattr $C$DW$186, DW_AT_bit_offset(0x0d), DW_AT_bit_size(0x01)
    2150                      .dwattr $C$DW$186, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2151                      .dwattr $C$DW$186, DW_AT_accessibility(DW_ACCESS_public)
    2152              $C$DW$187       .dwtag  DW_TAG_member
    2153                      .dwattr $C$DW$187, DW_AT_type(*$C$DW$T$19)
    2154                      .dwattr $C$DW$187, DW_AT_name("GPIO51")
    2155                      .dwattr $C$DW$187, DW_AT_TI_symbol_name("_GPIO51")
    2156                      .dwattr $C$DW$187, DW_AT_bit_offset(0x0c), DW_AT_bit_size(0x01)
    2157                      .dwattr $C$DW$187, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2158                      .dwattr $C$DW$187, DW_AT_accessibility(DW_ACCESS_public)
    2159              $C$DW$188       .dwtag  DW_TAG_member
    2160                      .dwattr $C$DW$188, DW_AT_type(*$C$DW$T$19)
    2161                      .dwattr $C$DW$188, DW_AT_name("GPIO52")
    2162                      .dwattr $C$DW$188, DW_AT_TI_symbol_name("_GPIO52")
    2163                      .dwattr $C$DW$188, DW_AT_bit_offset(0x0b), DW_AT_bit_size(0x01)
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:08 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0554410                           PAGE   43

    2164                      .dwattr $C$DW$188, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2165                      .dwattr $C$DW$188, DW_AT_accessibility(DW_ACCESS_public)
    2166              $C$DW$189       .dwtag  DW_TAG_member
    2167                      .dwattr $C$DW$189, DW_AT_type(*$C$DW$T$19)
    2168                      .dwattr $C$DW$189, DW_AT_name("GPIO53")
    2169                      .dwattr $C$DW$189, DW_AT_TI_symbol_name("_GPIO53")
    2170                      .dwattr $C$DW$189, DW_AT_bit_offset(0x0a), DW_AT_bit_size(0x01)
    2171                      .dwattr $C$DW$189, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2172                      .dwattr $C$DW$189, DW_AT_accessibility(DW_ACCESS_public)
    2173              $C$DW$190       .dwtag  DW_TAG_member
    2174                      .dwattr $C$DW$190, DW_AT_type(*$C$DW$T$19)
    2175                      .dwattr $C$DW$190, DW_AT_name("GPIO54")
    2176                      .dwattr $C$DW$190, DW_AT_TI_symbol_name("_GPIO54")
    2177                      .dwattr $C$DW$190, DW_AT_bit_offset(0x09), DW_AT_bit_size(0x01)
    2178                      .dwattr $C$DW$190, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2179                      .dwattr $C$DW$190, DW_AT_accessibility(DW_ACCESS_public)
    2180              $C$DW$191       .dwtag  DW_TAG_member
    2181                      .dwattr $C$DW$191, DW_AT_type(*$C$DW$T$19)
    2182                      .dwattr $C$DW$191, DW_AT_name("GPIO55")
    2183                      .dwattr $C$DW$191, DW_AT_TI_symbol_name("_GPIO55")
    2184                      .dwattr $C$DW$191, DW_AT_bit_offset(0x08), DW_AT_bit_size(0x01)
    2185                      .dwattr $C$DW$191, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2186                      .dwattr $C$DW$191, DW_AT_accessibility(DW_ACCESS_public)
    2187              $C$DW$192       .dwtag  DW_TAG_member
    2188                      .dwattr $C$DW$192, DW_AT_type(*$C$DW$T$19)
    2189                      .dwattr $C$DW$192, DW_AT_name("GPIO56")
    2190                      .dwattr $C$DW$192, DW_AT_TI_symbol_name("_GPIO56")
    2191                      .dwattr $C$DW$192, DW_AT_bit_offset(0x07), DW_AT_bit_size(0x01)
    2192                      .dwattr $C$DW$192, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2193                      .dwattr $C$DW$192, DW_AT_accessibility(DW_ACCESS_public)
    2194              $C$DW$193       .dwtag  DW_TAG_member
    2195                      .dwattr $C$DW$193, DW_AT_type(*$C$DW$T$19)
    2196                      .dwattr $C$DW$193, DW_AT_name("GPIO57")
    2197                      .dwattr $C$DW$193, DW_AT_TI_symbol_name("_GPIO57")
    2198                      .dwattr $C$DW$193, DW_AT_bit_offset(0x06), DW_AT_bit_size(0x01)
    2199                      .dwattr $C$DW$193, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2200                      .dwattr $C$DW$193, DW_AT_accessibility(DW_ACCESS_public)
    2201              $C$DW$194       .dwtag  DW_TAG_member
    2202                      .dwattr $C$DW$194, DW_AT_type(*$C$DW$T$19)
    2203                      .dwattr $C$DW$194, DW_AT_name("GPIO58")
    2204                      .dwattr $C$DW$194, DW_AT_TI_symbol_name("_GPIO58")
    2205                      .dwattr $C$DW$194, DW_AT_bit_offset(0x05), DW_AT_bit_size(0x01)
    2206                      .dwattr $C$DW$194, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2207                      .dwattr $C$DW$194, DW_AT_accessibility(DW_ACCESS_public)
    2208              $C$DW$195       .dwtag  DW_TAG_member
    2209                      .dwattr $C$DW$195, DW_AT_type(*$C$DW$T$19)
    2210                      .dwattr $C$DW$195, DW_AT_name("GPIO59")
    2211                      .dwattr $C$DW$195, DW_AT_TI_symbol_name("_GPIO59")
    2212                      .dwattr $C$DW$195, DW_AT_bit_offset(0x04), DW_AT_bit_size(0x01)
    2213                      .dwattr $C$DW$195, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2214                      .dwattr $C$DW$195, DW_AT_accessibility(DW_ACCESS_public)
    2215              $C$DW$196       .dwtag  DW_TAG_member
    2216                      .dwattr $C$DW$196, DW_AT_type(*$C$DW$T$19)
    2217                      .dwattr $C$DW$196, DW_AT_name("GPIO60")
    2218                      .dwattr $C$DW$196, DW_AT_TI_symbol_name("_GPIO60")
TMS320C2000 Assembler PC v6.2.7 Thu Jul 02 08:31:08 2015

Tools Copyright (c) 1996-2014 Texas Instruments Incorporated
C:\Users\Tester\AppData\Local\Temp\0554410                           PAGE   44

    2219                      .dwattr $C$DW$196, DW_AT_bit_offset(0x03), DW_AT_bit_size(0x01)
    2220                      .dwattr $C$DW$196, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2221                      .dwattr $C$DW$196, DW_AT_accessibility(DW_ACCESS_public)
    2222              $C$DW$197       .dwtag  DW_TAG_member
    2223                      .dwattr $C$DW$197, DW_AT_type(*$C$DW$T$19)
    2224                      .dwattr $C$DW$197, DW_AT_name("GPIO61")
    2225                      .dwattr $C$DW$197, DW_AT_TI_symbol_name("_GPIO61")
    2226                      .dwattr $C$DW$197, DW_AT_bit_offset(0x02), DW_AT_bit_size(0x01)
    2227                      .dwattr $C$DW$197, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2228                      .dwattr $C$DW$197, DW_AT_accessibility(DW_ACCESS_public)
    2229              $C$DW$198       .dwtag  DW_TAG_member
    2230                      .dwattr $C$DW$198, DW_AT_type(*$C$DW$T$19)
    2231                      .dwattr $C$DW$198, DW_AT_name("GPIO62")
    2232                      .dwattr $C$DW$198, DW_AT_TI_symbol_name("_GPIO62")
    2233                      .dwattr $C$DW$198, DW_AT_bit_offset(0x01), DW_AT_bit_size(0x01)
    2234                      .dwattr $C$DW$198, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2235                      .dwattr $C$DW$198, DW_AT_accessibility(DW_ACCESS_public)
    2236              $C$DW$199       .dwtag  DW_TAG_member
    2237                      .dwattr $C$DW$199, DW_AT_type(*$C$DW$T$19)
    2238                      .dwattr $C$DW$199, DW_AT_name("GPIO63")
    2239                      .dwattr $C$DW$199, DW_AT_TI_symbol_name("_GPIO63")
    2240                      .dwattr $C$DW$199, DW_AT_bit_offset(0x00), DW_AT_bit_size(0x01)
    2241                      .dwattr $C$DW$199, DW_AT_data_member_location[DW_OP_plus_uconst 0x1]
    2242                      .dwattr $C$DW$199, DW_AT_accessibility(DW_ACCESS_public)
    2243                      .dwendtag $C$DW$T$35
    2244              
    2245              
    2246              $C$DW$T$36      .dwtag  DW_TAG_union_type
    2247                      .dwattr $C$DW$T$36, DW_AT_name("GPBDAT_REG")
    2248                      .dwattr $C$DW$T$36, DW_AT_byte_size(0x02)
    2249              $C$DW$200       .dwtag  DW_TAG_member
    2250                      .dwattr $C$DW$200, DW_AT_type(*$C$DW$T$21)
    2251                      .dwattr $C$DW$200, DW_AT_name("all")
    2252                      .dwattr $C$DW$200, DW_AT_TI_symbol_name("_all")
    2253                      .dwattr $C$DW$200, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2254                      .dwattr $C$DW$200, DW_AT_accessibility(DW_ACCESS_public)
    2255              $C$DW$201       .dwtag  DW_TAG_member
    2256                      .dwattr $C$DW$201, DW_AT_type(*$C$DW$T$35)
    2257                      .dwattr $C$DW$201, DW_AT_name("bit")
    2258                      .dwattr $C$DW$201, DW_AT_TI_symbol_name("_bit")
    2259                      .dwattr $C$DW$201, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2260                      .dwattr $C$DW$201, DW_AT_accessibility(DW_ACCESS_public)
    2261                      .dwendtag $C$DW$T$36
    2262              
    2263              
    2264              $C$DW$T$37      .dwtag  DW_TAG_structure_type
    2265                      .dwattr $C$DW$T$37, DW_AT_name("GPC1_BITS")
    2266                      .dwattr $C$DW$T$37, DW_AT_byte_size(0x02)
    2267              $C$DW$202       .dwtag  DW_TAG_member
